[
  {
    "game": "The Legend of Zelda: The Minish Cap",
    "meta-rating": "89",
    "meta-user": "9.0",
    "date": "Jan 10, 2005",
    "rating": 4,
    "shortname": "minish",
    "status": "complete",
    "notes": "Minish Cap is a pretty great game in the 2D Zelda tradition. I actually prefer the 2D Zelda games over the 3D Ocarina of Time and descendants. The game has excellent graphics and music, and mostly strong gameplay. I have played Minish Cap before, at least twice as far as I remember.\r\n\r\nThe story is fairly typical Zelda fare, although it does a few things differently. Zelda\u0027s been turned to stone rather than kidnapped, (spoilers) the bad guy isn\u0027t Gannon in disguise, there\u0027s no explicit triforce (although there is a \u0022Light force\u0022 which is probably the same thing) and no master sword.\r\n\r\nThe main thrust of the quest is that you\u0027re looking for the 4 elements, which you need to reforge The Four Sword, an ancient magical sword that can defeat evil and restore the princess to life. In the process you discover that the legendary race of tiny elves called \u0022Picori\u0022, who call themselves \u0022Minish\u0022, are real and gain the ability to shrink down to their world using a magical talking hat who accompanies Link on his journey.\r\n\r\nI like the shrinking mechanic. It adds a real sense of wonder to the game. Figuring out how to access particular areas in town in Minish form is fun, as the town becomes quite mazelike when you\u0027re tiny. Traversal can be a little slow though, especially when you have to retrace your steps back out to whatever object changes your size. It\u0027s also reasonably well integrated with the world and some of the dungeons, rather than feeling like a compete gimmick.\r\n\r\nThe game has a couple of items that are just really fun to use. Digging with the mole mitts is oddly satisfying. The game\u0027s version of Roc\u0027s Cape (allowing Link to jump) is also really fun to bounce around with, although it interacts a little oddly with cliffs and bottomless pits. The Four Sword is tragically underused, and is pretty much only used for \u0022press multiple buttons at once\u0022 and \u0022push heavier blocks\u0022. It\u0027s a shame they don\u0027t allow you to use any item except the sword while split, as that would have opened up some interesting puzzles.\r\n\r\nHowever, the game is flawed.\r\n* The game is relatively short, having only 5 main dungeons \u002B the final castle (compared to 11 for Link To The Past, also on GBA). The world also ends up feeling a little small and pokey.\r\n* One thing I hadn\u0027t remembered is that Ezlo, the sentient hat who accompanies Link, is actually fairly annoying. Not the worst offender in the Zelda series, but he does like to break in with obvious comments.\r\n* The control scheme also doesn\u0027t make great use of the buttons available. The L button is exclusively for fusing kinstones, and Select is dedicated to asking for useless hints from Ezlo. Meanwhile there\u0027s no quick way to get to the map or use more than 2 items at a time.\r\n* The disconnected/non-local nature of kinstone fusion can be annoying. Sometimes if you\u0027re stuck trying to do something in the overworld, the solution is actually to go away and fuse kinstones with some random NPC to add something to the environment.\r\n *The game is also pretty easy. I only came close to dying once (but had a bottled fairy, so not even then). I\u0027d normally expect to die a few times in the course of a Zelda game. None of the puzzles struck me as particularly taxing either. I got stuck only twice, and that was due to the game not communicating what I was supposed to be doing between dungeons (and even in this case Ezlo was no help at all).\r\n* It has a shitty stealth minigame you have to play twice. I hate those.\r\n* It reuses the same miniboss fight way too much. 6 times, only varying in numbers and colours, in the final dungeon, plus a few before that.\r\n\r\nIt makes up for the short length a little by having fairly extensive side quests and optional content. The kinstone fusion mechanic adds a lot of fun to exploring and retreading areas. There are also quite a few optional pieces of equipment to find, as well as optional sword skills and some other fun things. There are a ton of heart containers too (because there are so few bosses but the game is still going up to a 20 heart maximum). There\u0027s a figurine collection mechanic, which uses a separate currency (shells) to play a gashapon machine. There\u0027s no real reward for finishing it though, and the interface to play the machine is very slow and clunky. I wasn\u0027t a fan.\r\n\r\nAll in all, a strong game to start with.",
    "completion-date": "2017-05-27"
  },
  {
    "game": "Game \u0026 Watch Gallery 4",
    "meta-rating": "71",
    "meta-user": "8.1",
    "date": "Oct 28, 2002",
    "rating": 2,
    "shortname": "g\u0026w4",
    "status": "not-complete",
    "notes": "Game and Watch Gallery 4 is a collection of mini games. These are based on the games from the Game and Watch series, very old single-game LCD handhelds produced by Nintendo. You may have noticed that this is entry number 4 in the series. Well, the previous 3 are on Gameboy/Gameboy Colour, so this is the only one we\u0027re playing for the challenge. It also has one of the lower metacritic scores, 71, just making it into the list.\r\n\r\n\r\n\r\nThere\u0027s no story mode. I haven\u0027t \u0022completed\u0022 the game (in terms of reaching the credits, which are in the game). I haven\u0027t unlocked all the games either. But at this point I\u0027m not having any fun, as I just find the minigames too slow and frustrating. I\u0027ve played more than 2 hours, and played all the games unlocked so far. So I\u0027m pronouncing this as \u0022done\u0022. I may come back to it at some point if I feel like it, as I think part of the problem is that the game isn\u0027t really designed to be played intensively towards the goal of beating it and moving on. Here\u0027s what I\u0027ve got to say about what I\u0027ve seen so far:\r\n\r\n\r\n\r\nInitially it wasn\u0027t clear if the game had a traditional end, since the mini games play indefinitely for high scores. After a little play and googling to figure out how things work, I found the game has an unlockables system. You earn stars which in turn unlock new features and games. I looked it up and the game does have an unlockable credits screen. To get there you need 170 stars, out of the 220 total that can be earned by playing the game.\r\n\r\nEach mini game is played on a single screen. Everything moves between fixed separate states. For example, in many games you are moving a character around a flat floor. But you won\u0027t move him smoothly and continuously like you would in a normal game. Instead he will jump between several fixed points where he\u0027s allowed to stand. Everything in the game moves like this in classic. In modern, some things do move more naturally, although you always control your character like that. This jerky motion is true to the original LCDs, which could only display by turning preset areas of the screen on and off. In addition to the mini games themselves, there\u0027s a \u0022gallery\u0022 which contains some miscellany: a sound test, records of all the hints the game has given you, etc.\r\n\r\nEach game (with some exceptions) has two modes: classic and modern. Classic is a recreation of the graphics and gameplay of the original, whereas modern is updated with new art and animation and gameplay tweaks, usually featuring Mario characters rather than generic sprites. There are also easy and hard difficulties. In each combination of mode and difficulty you can earn 5 stars: usually 1 per 200 points, so you need a high score of 1000 to earn all 5 stars. So each game has 20 stars to get. There are some exceptions to this rule that I\u0027ll note below. You start with 6 games unlocked, and unlock another 5 full games with modes/stars to earn, plus 9 smaller games with no stars. This gives a total of 20 games to play.\r\n\r\nThe modern variants have a nice level of detail and polish, and generally good graphics that will usually change a bit as you progress through a game. I found the music loops a bit short and grating sometimes. The classic variants, presumably, are faithful to the original but are nothing special. The screens always look really crowded and messy because of the LCD effect where all the possible states are visible but inactive.\r\n\r\nThe general theme of most the games is that you wait for some kind of threat to appear, and position your character to intercept that threat. The game then becomes about reading all the upcoming threats and timing your movement counter all of them correctly. This type of gameplay seems to flip between slow and boring to suddenly overwhelmingly hectic with almost no warning. I think it probably worked well given the limitations of LCD devices, but it doesn\u0027t sit well on a modern system where so much more is possible.\r\n\r\nI would have preferred the games to ramp up difficulty faster, leading to a shorter but more intense experience each time you play, and lower score targets to get the stars. I think that would have worked better, for me at least. The hard variants were moving in that direction a bit.\r\n\r\nHere are short reviews of individual games:\r\n\r\n\r\nBoxing - Pretty much what it says on the tin, you can dodge, and block/punch low and high. In modern you play Luigi fighting a loop of Wiggler, Boo, and Waluigi. In classic, just boxers. I came up with a strategy (dodge a lot) that allowed me to win easily. Instead of score, it\u0027s 3 KOs per star. Instead of easy/hard, it\u0027s 1 or 2 player. I can\u0027t play 2 player as it needs a link cable.\r\n\r\nDonkey Kong 3 - Another competitive game like Boxing, with 1p and 2p modes. Play as Mario shooting bubbles to push a fireball or boo down 3 lanes toward DK, who is doing the same. Also not too hard to win, although a lot slower to earn stars as you\u0027re actually scoring points and it\u0027s only 10 per win. In modern, bubbles seem a bit janky and sometimes pop for no reason. Classic is basically identical.\r\n\r\nDonkey Kong Jr - A platformer where DKjr must grab a key and use it to free DKsr. Each level is replayed 4 times before moving onto the next... and there are only 4 levels in total. Gets very repetitive very fast. Also because we\u0027re still in the Game and Watch LCD style, it\u0027s very clunky compared to a real platformer. Again classic is much the same, except even more clunky.\r\n\r\nRainshower - In classic/modern you are protecting clothes/Mario characters hanging on a washing line from falling raindrops/waterbombs. This one starts off really slow. It takes an age to get points, as each rain drop takes several seconds to fall and will only give you 1 or 2 points. Also, drops will often fall through empty space so you don\u0027t have to do anything.\r\n\r\nMario\u0027s Cement Factory - Mario is running around, riding elevators, to drop blobs of concrete down through the levels of the factory. Movement is very frustrating due to the jerkiness, I often fell off an elevator because I moved at the exact moment it did. And you just die if you miss an elevator. I wasn\u0027t a fan.\r\n\r\nChef - Classic and Modern are significantly different. In modern Princess Peach juggles bits of food thrown by Mario and Luigi until they are done, at which point they can be dropped down to a hungry Yoshi. Feed Yoshi enough and he\u0027ll lay an egg that will hatch into a new baby Yoshi who you then have to feed. All of this gains you points. In modern you are a chef juggling bits of food again, but you just have to keep them up indefinitely, away from the hungry mouse below. Fairly straightforward, modern hard mixes it up as the food moves between columns rather than just bouncing straight up and down.\r\n\r\nMario Bros. - Not what I was expecting, you play Mario and Luigi in a cookie factory, pass the cookies between conveyor belts. Requires you to control one bro with each hand, which takes a bit of coordination.\r\n\r\nDonkey Kong - Classic Donkey Kong, as Mario jump over barrels and climb up the stage to rescue princess peach. Pretty similar to Donkey Kong Jr but with less variety.",
    "completion-date": "2017-05-30"
  },
  {
    "game": "Yu-Gi-Oh! Ultimate Masters: World Championship Tournament 2006",
    "meta-rating": "73",
    "meta-user": "7.6",
    "date": "Mar 14, 2006",
    "rating": 2,
    "shortname": "ygo",
    "status": "not-complete",
    "notes": "Yu-Gi-Oh! Ultimate Masters: World Championship Tournament 2006 is an adaptation of the Yu-Gi-Oh Trading/Collectible Card Game, aka Duel Monsters, one of several on the GBA (3 made it into the challenge for reference). If you really don\u0027t know anything about Yu-Gi-Oh, I suggest you look it up elsewhere (also where you living under a rock in the early 2000s?) As for my experience with the franchise, I enjoyed the anime as a child, and more recently the Abridged Series on Youtube, but was never really into the trading card game. It\u0027s also worth noting I\u0027m not a big fan of TCGs/CCGs in general, the only one I\u0027ve played much of is Hearthstone, but I\u0027ve lost interest in that too.\r\n\r\n\r\n\r\nI\u0027m abandoning Yu-Gi-Oh. I really didn\u0027t want to, as 2 in a row right at the start of the challenge is a bad precedent, but the game has broken me. This is within the rules as the game doesn\u0027t have a traditional story mode or ending, and I\u0027ve played for more than 2 hours (more like 10). This evening has hammered home that I\u0027m not having fun. I beat the same opponent twice in a row easily, and then proceeded to lose 14 times in a row before getting the 3rd win, due to a combination of abominable luck and occasional misplays. Then I looked it up and discovered I need 5 wins, not 3, to unlock the whole of the next tier of opponents. Blargh.\r\n\r\n\r\nI\u0027ve played a representative sample of the game\u0027s modes, and I think I\u0027ve seen everything in the game barring just more cards and decks, which doesn\u0027t interest me that much.\r\n\r\n\r\nIn Free Duel you fight opponents with set decks in regular duels. More are unlocked in tiers by repeatedly beating the earlier ones. In Duel Puzzle, the only mode I really enjoyed, you get a set board position and have to figure out how to win in one turn. In Limited you have to win with a deck that obeys certain restrictions. In Theme you have to achieve an objective other than just winning in the traditional way. And in survival you have to win as many duels in a row as possible with a single life point total.\r\n\r\nThe game has so many cards, to a Yu-Gi-Oh noob like me it\u0027s overwhelming. Apparently it\u0027s all the cards released when the game came out (give or take a few). I have 380 already and that\u0027s only a small fraction of the total. And every one of those has a paragraph or 2 of text you need to read to understand it.\r\n\r\n\r\nI don\u0027t want to ramble too much about why I don\u0027t like Yu-Gi-Oh. A few short points though:\r\n* Lack of resource management other than cards and life means the game lacks depth.\r\n* Too many powerful cards means \u0022normal\u0022 play of regular summoning and fighting monsters is almost non-existent.\r\n* No standard effects/keywords means almost every card has a lot of text on it.\r\n* Very fiddly rules around chaining and countering.\r\n* Activation of cards on the opponents turn makes for a slow and clunky video game version.\r\n\r\nGraphically the game is a little disappointing, as you can\u0027t really see card art in the main view and it\u0027s not exactly stellar in the zoomed in view. That\u0027s probably inevitable on the GBA\u0027s screen though. The interface is functional enough when you get used to it. The deck management interface is complex but has solid functionality for managing the hundreds of cards you\u0027ll accumulate. Background music and sound effects are unintrusive, nothing spectacular.",
    "completion-date": "2017-06-02"
  },
  {
    "game": "Spyro: Season of Ice",
    "meta-rating": "74",
    "meta-user": "8.0",
    "date": "Oct 29, 2001",
    "rating": 3,
    "shortname": "ssoi",
    "status": "complete",
    "notes": "Spyro: Season of Ice is an isometric 3d platformer with 2d graphics. It\u0027s a sequel to the classic 3d collectathon platformer series from the Playstation 1 era. Unlike the home console series and other sequels, which have gone in some crazy directions, Season of Ice is a direct sequel to the original trilogy and sticks pretty close in terms of gameplay too. I\u0027m a big fan of the PS1 Spyro games.\r\n\r\n\r\nYou explore isometric 3d worlds as Spyro, a juvenile purple dragon, accompanied by his faithful dragonfly pal Sparx. An Rynoc has stolen the sorceresses\u0027 spell book (from Spyro 3) and has accidentally given himself 2 heads in an attempt to become smart. He needs 100 pairs of fairy wings to brew a potion to fix himself, and so has cast another spell to encase all the fairies in ice. Spyro, being the designated hero, has to go and save them and defeat the bad guy. Standard stuff, and the main villain is pretty nonthreatening and forgettable compared to some of the characters in the original series, but it gets the job done.\r\n\r\n\r\n\r\nThe gameplay is basically the same as the originals, with Spyro charging, flaming, jumping and gliding to get around and collect gems and free fairies.\r\n\r\nThe shift to isometric graphics on the gba\u0027s small screen hasn\u0027t gone perfectly though. The camera feels very close in, and combined with the repetitive tiled graphics it\u0027s very difficult to stay oriented as you navigate around. In the later levels too you need to do long glides over bottomless pits, and it can sometimes be hard to tell what height platforms are, and so whether you can reach them.\r\n\r\n\r\nThe game has issues with its difficulty curve I think. When you die, none of the enemies come back (which is nice as one of your objectives in each level is to kill all of the enemies). However, some objectives, like the flammable objects in every level, do reset. This can make the game very frustrating as you try and find the last thing to finish up and get the fairy, but make one slip into one of the omnipresent bottomless pits and have to start all over. This is extra frustrating when you can\u0027t find your way back to where you were because of the hard to navigate levels.\r\n\r\nThose bottomless pits are the game\u0027s biggest problem. They\u0027re everywhere and they always kill you instantly. (Often they\u0027re actually water rather than pits but it\u0027s functionally the same). This saps a fair bit of fun out of the game. I think they could have made it a lot more fun if falling in a pit took away one hit point, rather than killing you instantly. That would remove a lot of the frustration.\r\n\r\nAnother annoyance is that whenever you complete an objective the game teleports you back to the questgiver who gives you the fairy. This can be really irritating when that\u0027s all the way across the level. I also had issues with the camera control. You can hold L and press the directional buttons to look around, but if you\u0027re not completely stopped when you do so you\u0027ll just walk instead. More than once this lead to me accidentally falling off a ledge when I was trying to look across the gap.\r\n\r\nEach of the 4 hub worlds also has two non-platformer levels. There\u0027s a flying \u0022speedway\u0022 stage where you control Spyro in an over-the-shoulder flying and shooting level. These are fun enough, but having to play twice on both normal and hard to get 2 fairies feels a bit like filler. Depth perception is an issue in these stages, as is replaying them to get all the gems. The exception is the final one on hard which is brutally hard. And remember you need to beat this to finish the game.\r\n\r\n\r\n There are also top down stages where you play as Sparx, which revolve around finding keys to open doors and fighting insect enemies. Not particularly inspired but not bad.\r\n\r\nThe boss fights are dissapointing. There are only 2, at the halfway point and the end, and they play identically apart from cosmetic changes.\r\n\r\nI beat this one 100% (because you haven\u0027t really played a Spyro game if you haven\u0027t obsessively collected every gem). You have to get all 99 fairies to get to the final boss anyway, which is a bit of a harsh requirement compared to other games in the series where you just need a good chunk of the collectables to finish the game. There\u0027s also a bonus level for getting 100 fairies (1 from the final boss). The game is fairly short, I beat it in the best part of a day.\r\n\r\n\r\nI enjoyed it, but its flaws mean it gets frustrating at times. I referred to maps of the levels a few times, which make it so much easier to find your way around.",
    "completion-date": "2017-06-02"
  },
  {
    "game": "Teenage Mutant Ninja Turtles",
    "meta-rating": "71",
    "meta-user": "8.9",
    "date": "Oct 31, 2003",
    "rating": 3,
    "shortname": "tmnt03",
    "status": "complete",
    "notes": "Teenage Mutant Ninja Turtles is a side scrolling beat em up based on the beloved, and sometimes abused, franchise. Actually there are several TMNT games on the GBA. Confusingly, this one is based on the 2003 animated series. There\u0027s another, just titled TMNT (the acronym, not spelled out) released in 2007, based on the movie. But that\u0027s for another time.\r\n\r\n\r\nAt the beginning you pick your turtle from the 4, and get down to it. Initially I thought the game was insanely short after I beat the 4 acts with the first character in less than an hour. But as it turns out the 4 turtles have significantly different paths, rather than it just being a different character on the same levels, and I went through them all. There are some collectible secret crystals to find, but I didn\u0027t really bother with them.\r\n\r\n\r\nThe story is nothing special but it gets the job done. A mad scientist has created some robot dogs and is using them to terrorise the turtles and April O\u0027Neil, so they go to kick his ass and discover that Shredder is really behind it. Also Casey and Raph just beat up some gang members.\r\n\r\n\r\nThe basic gameplay is simple sidescrolling beat-em-up stuff, on a single plane (no moving towards/away from the camera). Just mashing the basic combo is enough to beat normal easily enough, but there are other combos and charge moves that are kind of fun to pull off. The 4 turtles play pretty similarly, with the same inputs giving differently animated combos, but I didn\u0027t really have to change my style. There are some minigame levels too. Here\u0027s a quick summary of each turtle\u0027s path:\r\n\r\nLeonardo:\r\nAct 1 - Beating up robot dogs, dudes, and crawling through the sewers. Not much to say.\r\nAct 2 - Kind of a rail shooter, driving a car through the sewers you shoot down incoming robot dogs. Kind of \u0022boss fight\u0022 with a steel door while waves of dogs attack.\r\nAct 3 - Beating up foot ninjas, science goons, and more doggos in a lab. The science dudes with guns gave me a little trouble.\r\nAct 4 - Boss fight against a weird chicken walker robot. Just avoid his attacks and wail on his head. Missles are slightly hard to avoid. I did actually die once here.\r\n\r\nRaphael:\r\nAct 1 - Beat up a ton of gang members in the city streets.\r\nAct 2 - Boss fight with Casey. Dodge one of his hits, hit him until he falls over, repeat.\r\nAct 3 - Weirdly hard race minigame vs Casey. You basically need to memorise the course as there\u0027s no time to react to stuff and go fast enough to win.\r\nAct 4 - A kind of arena fight with an AI controlled Casey, ending in a gang boss fight.\r\n\r\n\r\nDonnatello\r\nAct 1 - Beat up some gang members in the city streets.\r\nAct 2 - Going through a lab with more ninjas and science goons. Has some more platformer elements/obstacles. They don\u0027t work that well...\r\nAct 3 - Escaping on a glider in a side scrolling shooter minigame.\r\nAct 4 - Boss fight with 2 invisible ninjas. You turn on heat vision, get a few hits in, and repeat.\r\n\r\nMichaelangelo\r\nAct 1 - Beat up ninjas and science goons in subway tunnels.\r\nAct 2 - Crazy skateboarding minigame where you\u0027re going down a tunnel avoiding barrels and grabbing crystals.\r\nAct 3 - Light (and annoying) platforming over some lava, plus fights with unique monster enemies.\r\nAct 4 - Arena fight with some more monsters.\r\n\r\n...and then finally you fight your way up Shredder\u0027s tower to fight the man himself, which is actually a fairly tough fight.\r\n\r\n\r\nOverall, it\u0027s a solid enough game, although still quite short even after beating all the turtles and the extra stage for the final ending. The fighting isn\u0027t that nuanced or challenging, on normal anyway. Nothing that hasn\u0027t been done better before, but not actively bad either.",
    "completion-date": "2017-06-02"
  },
  {
    "game": "Boulder Dash EX",
    "meta-rating": "79",
    "meta-user": "tbd",
    "date": "Sep 16, 2002",
    "rating": 3,
    "shortname": "bdex",
    "status": "complete",
    "notes": "Boulder Dash Ex is a remake of the classic 8-bit Atari game Boulder Dash (no surprises there). It seems to be relatively obscure, although it has quite a good metacritic score, that comes from very few reviews. There also isn\u0027t a Wikipedia page for it (although there is one for Boulder Dash, the original game).\n\n\n\nI beat the main story mode of Boulder Dash Ex. There\u0027s also a tutorial, and a multiplayer battle mode. Finally there\u0027s a classic mode which appears to be a closer representation of the original game.\n\n\nThe campaign has a story, which is weird and seemingly unrelated to the gameplay itself. It feels very tacked on over the top. You play a blue haired cat boy named Alex who\u0027s out to rescue his pink-haired bunny girlfriend from the \u0022Dark King\u0022. To do this he needs to collect shards of a magical amulet which take the form of gems.\n\nThe gameplay is a hybrid action/puzzler. You dig out earth, collect gems, and avoid getting crushed by boulders or killed by enemies. The boulders and gems fall down in (mostly) predictable ways, and enemies patrol with set patterns, like following walls or bouncing up and down. In each level you have to collect a minimum quota of gems and then reach the exit mirror.\n\n\nIt\u0027s basically a puzzler but there are certain actiony elements. Avoiding and killing enemies by dropping rocks on them can be more based on reflexes and luck than puzzle skill. The fundamental gameplay is OK, with a few flaws. Boulders and other items fall quite slowly, and some can be held in mid-air if an enemy keeps bumping into them. This leads to quite counter-intuitive behaviour.\n\nYou play across multiple worlds, each of which has a different tileset. One annoying thing is that enemies with the same behaviour look totally different in different worlds, meaning you always have to use trial and error every time you encounter a new enemy, even though it\u0027s likely the same as one you\u0027ve seen before. The world are also pretty uninspired. Forest, desert, water, ice, lava, dark castle...\n\n\nOther than that, my main criticism is that the game feels a bit stretched, and doesn\u0027t really introduce any new mechanics in the latter part of the game. I was quite enjoying it until the last 2 worlds, which started to feel like a slog.\n",
    "completion-date": "2017-06-06"
  },
  {
    "game": "Yu-Gi-Oh! The Eternal Duelist Soul",
    "meta-rating": "81",
    "meta-user": "8.8",
    "date": "Oct 15, 2002",
    "rating": 2,
    "shortname": "ygo2",
    "status": "not-complete",
    "notes": "So, another Yu-Gi-Oh game already, name Yu-Gi-Oh: The Eternal Duellist Soul. There are only 3 in the challenge list, so this is quite unlikely. At least I\u0027m getting them out of the way early. This is the first Yu-Gi-Oh game to be released on the GBA (apart from Dungeon Dice Monsters which doesn\u0027t really count), whereas the 2006, the other game I played, was the last to be released.\n\n\n\nAgain, I played this for over 2 hours, and tried to give it a fair shake. Ultimately though, I\u0027m dropping it as it again doesn\u0027t have a real main story mode and I\u0027m not enjoying it much.\n\n\n\u0022Free Duel\u0022 is campaign in this game, but it\u0027s the same mode where you repeatedly duel a limited set of opponents for new cards, and unlock new opponents by beating the ones you\u0027ve got multiple times. Disappointingly there are no challenges in this version. The opponents in this game are characters from the original anime, rather than monsters.\n\nThe way you earn new cards is also different. Rather than earning points and spending them on packs in the shop, you get one pack every time you beat an opponent, from a limited set. This gives less choice overload. It also doesn\u0027t tell you what % of the cards from each pack you\u0027ve found which is less helpful.\n\nThe battles themselves are pretty similar, with slightly different UI. You can see any facsimile of the art without zooming in, making it harder to keep track of what\u0027s being played/in your hand. There\u0027s also a constantly moving background which is distracting. The field is also larger and doesn\u0027t all fit on the screen at once. It\u0027s also quite slow moving. The later game definitely improved on this front.\n\n\nThere\u0027s a simple calendar/time passing system. Each battle you play takes 1 day, and on some days special events happen. That seems to be about it though.\n\nThe game starts off a lot simpler/slower. Rather than starting out with a powerful combo deck, my starter deck was a simple \u0022a bunch of monsters and spells\u0022 deck. The early opponents are similar. This made it easier to start out with, and to start improving by substituting monsters with better stats. I think I might have had more fun if I\u0027d started with this game for that reason.\n\nIn summary, again a competent Yu-Gi-Oh simulator but it has not managed to make me actually like playing Yu-Gi-Oh. Easier to get started with than the other one.\n",
    "completion-date": "2017-06-09"
  },
  {
    "game": "Riviera: The Promised Land",
    "meta-rating": "76",
    "meta-user": "8.5",
    "date": "Jun 28, 2005",
    "rating": 3,
    "shortname": "riviera",
    "status": "complete",
    "notes": "Riviera: The Promised Land is a JRPG in the \u0022Dept. Heaven\u0022 series. This is a loosely connected series of games that all have unique twists on the mechanics of JRPGs and strategy/tactics games, and a norse-mythology inspired setting. Riviera was the first one released, but Yggdra Union for GBA is also in the series. It took me a long time to get through this one because, although it wasn\u0027t obviously bad in any specific area, I just felt unmotivated to play it. I only realised later this was probably due to the speed issues I\u0027ll get to later.\n\n\nRiviera has some interesting and unique mechanics. In battle, characters don\u0027t have their own skills/spells that they know. Instead, everything is tied to items. For example, one character might be able to cast a particular spell if they have specific staff. There is no traditional exp/levelling either. Instead if a character can use an item, they will be able to \u0022master\u0022 the item with repeated use. This will award them a stat boost at the end of the battle as well as unlock a powerful \u0022overdrive\u0022 ability with that item in future battles. Items have limited durability, which means managing their use is vital.\n\n\nThis is an interesting system, but it\u0027s a little undermined by the practise mode, which lets you fight random battles where items don\u0027t lose durability. This means you can effectively grind stat increases without worrying about managing item breakage. I think the game could have been more interesting if they left that out.\n\nThe other unique gameplay feature is how movement through levels works. Rather than manually walking around like you would in Final Fantasy for example, instead you pick from options on each screen. For example you might be able to move west to another screen, or examine a treasure chest, doing each with one click.\n\nYou also have limited TP (time points) with which to do things, meaning you may not be able to do everything in a level. TP are earned by scoring well in battles. This is again a little undermined by the fact that if you\u0027re playing reasonably well in battles you get enough TP to explore every option. The other problem with this system is that it can feel a little random. Some options that require TP will be nothing but a single line of dialog, while others might reveal a hidden item, with no way to distinguish them except trial and error.\n\nThe game has serious problems though. The main one is the extremely slow pace of everything in the game. There are repetitive animations accompanying every action, some of which you\u0027ll see many times throughout the game. Battles take a long time with lots of flashy animations which, again, you\u0027ll end up seeing a lot through out the game. I found myself leaning on the \u0022speed up emulation\u0022 key a lot to avoid frustration.\n\nThere\u0027s quite a lot of reuse and repetition in the game. The same room background is regularly reused multiple times, with (maybe) some objects shifted around so you can tell them apart. Interations and dialog are often samey and sometimes copy and pasted even when it makes no sense. In general I felt like the individual chapters all dragged on a little too long, and that the game should have wrapped up one chapter earlier than it did.\n\nI also didn\u0027t think much of the story and characters. The story has some interesting ideas, where both the angels/gods and demons are really the bad guys, with the mortals caught in the middle, but it felt a bit formulaic. The supporting party characters seemed very one dimensional, with only one character trait each, no development through the game and no exploration of their back stories.\n\n\nOverall I applaud the game for experimenting and breaking away from some of the trappings of the genre, but the game falls over as it just isn\u0027t that fun or compelling with major pacing issues.\n",
    "completion-date": "2017-07-16"
  },
  {
    "game": "Boktai: The Sun Is in Your Hand",
    "meta-rating": "83",
    "meta-user": "9.0",
    "date": "Sep 16, 2003",
    "rating": 4,
    "shortname": "boktai",
    "status": "complete",
    "notes": "Boktai: The Sun Is In Your Hand is an action RPG about hunting vampires with a unique gimmick: the cartridge has a light sensor used to measure sunlight in the real world, which you use to hunt the undead in the game. Boktai is the first in a series. Boktai 2 is on the challenge list, Boktai 3 was only released in Japan, and there\u0027s a spiritual successor, Lunar Knights, on the DS.\n\n\n\nThe gimmick plays out simply enough: if the cartridge light sensor picks up sunlight, it will be sunny in-game. Undead caught outside will burn up, and inside dungeons there are skylights which will provide light inside. The main character Django\u0027s attacks use sunlight energy which he stores in batteries which can be recharged in the sun. There are other ways to manage sunlight energy like items that restore it, and a \u0022solar bank\u0022 which fills up whenever light is on the sensor and can be withdrawn from later. Playing in strong sunlight for an extended period will cause the game to overheat your gun, which seems to be a way of preventing kids from getting sunburnt.\n\n\n\nI actually own this game, and I remember as a child in England trying to play it was a pain as there was rarely enough sun to register on the game, and even then only a few bars out of a possible 10. For convenience now, I played on an emulator with a patch that allows you to set the sunlight level to whatever you want. This is less game breaking than you might think, as solar energy is only a limiting factor when you don\u0027t have any sun at all. If you have at least one bar of sun, you can recharge your batteries in the sun (albeit slowly), and opportunities to recharge are common enough that I didn\u0027t have any issues with energy even with an aggressive play style. I honestly think the game is more fun without having to worry about the sun sensor gimmick.\n\nSo with the gimmick mostly neutralised, what are we left with? An enjoyable if perhaps slightly easy action RPG somewhat reminiscent of The Legend of Zelda.\n\nThe story is light, mainly providing an excuse to go and hunt vampires. It\u0027s told through nice and short dialogs, usually just before and after the bosses. The rest of the time you\u0027re pretty free to roam. There is a companion character, Otenko, who\u0027s a kind of sunflower spirit guide. Sometimes he is a bit too heavy handed with puzzle hints, but it\u0027s usually not too obnoxious.\n\n\nThe combat is fun enough. Your main weapon, the \u0022Gun del Sol\u0022 is modular and customisable. You can swap in lenses for different elemental effects and frames for different bullet/spread patterns. You also have grenades which produce various other effects. Lenses also level up and become stronger with use. The game has light stealth elements. You can sneak past enemies completely if you need to conserve sunlight energy (usually not a problem), and they take extra damage and stun if hit from behind. Sometimes you are made to kill all the enemies in a room without being seen, which usually isn\u0027t too tough. Bosses have a weakpoint in their attack cycle you can hit for massive damage, but you can also just shoot them to chip away at their health between cycles.\n\nThe game has quite a few puzzles. A lot of these are your standard pushing boxes and pressing switches puzzles. There are also puzzles that need you to lure enemies onto switches for you. There are some more imaginitive puzzles with unique mechanics though. In particular there are some where you need to change the sunlight level in order to change the game world. You might need to hide the sun so an enemy can walk past a skylight safely or let the sun in to activate an invisible platform. On the physical cart this would be done by putting your thumb over the sensor.\n\nThe game doesn\u0027t have a full-on Zelda style overworld. Instead the main dungeons are connected by branching paths populated with mini dungeons. Usually you get quite a lot of choice in which mini-dungeons to go through to get between the larger levels. You also get some choice in the order to take on the main levels. Exploring mini-dungeons is well rewarded with unique items like gun parts and health upgrades. This does mean you spend almost all your time dungeon crawling, as there aren\u0027t really many towns or other non-dungeon areas. There are no shops, only solar banks and loan sharks to get energy, and the solar tree where you can grow fruit (i.e. healing and other useful items) over time.\n\nThe larger dungeons have an interesting structure. After you fight through and beat the boss, you\u0027re not finished. The boss is only stunned and put in a coffin. Then you have to drag the coffin back out through the level to the outside, and use the power of the sun via the \u0022Piledriver\u0022 to purify them permanently (basically play a short minigame). The coffin dragging section is not as tedious as it could have been if done badly. Your movement speed is reduced, but not too badly, and there are shortcuts/alternate paths unlocked, including some puzzles which require you to use the coffin to weigh down switches/etc.\n\nI have a few small criticisms. The game can get a bit repetitive, with little variety in enemies (which are often reused with pallet swaps) and dungeon graphics, outside of the main dungeons. The lack of much side-questing other than just collecting upgrade items is also a little disappointing, and the lack of towns/npcs makes the world feel a bit lifeless. I think the solar sensor gimmick was ultimately just a gimmick and doesn\u0027t really add much to the game, and I think it\u0027s more fun with manual light control as I had with emulation. The maps can be a bit abstract and hard to line up with the levels, especially when multiple floors are involved. The game is perhaps a little short too, and doesn\u0027t fully explore some of its mechanics (notably the plant growing Earth lens which is just unceremoniously dropped on you and used a little, rather than getting a full themed dungeon).\n\n\nThese complaints were addressed somewhat in the sequels, ultimately leading to Lunar Knights on the DS which kept the game play and visual style but made the solar sensor completely optional with in-game weather determining sunlight levels.\n\nOverall a solid game that I enjoyed a lot.\n",
    "completion-date": "2017-07-18"
  },
  {
    "game": "Need for Speed Underground",
    "meta-rating": "77",
    "meta-user": "8.2",
    "date": "Dec 18, 2003",
    "rating": 1,
    "shortname": "nfsu",
    "status": "other",
    "status-note": "Partially Complete - Drag races are broken",
    "notes": "Need for Speed is a series of arcade (in the sense of not being realistic simulators) street racing games. Need for Speed Underground for home consoles is a game that I personally have a lot of nostalgia for, having played it a lot on the PS2. The main features were the nice graphics (for the time), detailed car customisation, and fun career mode with a story told in pre-rendered cutscenes.\n\n\nThe GBA version is not up to that standard.\n\n\nThe visuals are a mess. The 3D is not technically impressive, because the GBA hardware is not up to very high quality 3D. However titles like Mario Kart, F-Zero, and other racers showed us you could do good-enough 3D on the GBA to make racing games work. NFSU\u0027s graphics look terrible though. They are far too busy, with busy background textures and aliasing everywhere. There is also a problem with the perspective/depth perception, making it hard to see turns coming up. This is compounded by the track design, which is a city with streets crossing over the main track. These side streets are blocked by invisible walls, but I sometimes mistook them for the path I was supposed to be taking. There\u0027s no minimap either. All of this adds up to make spotting upcoming turns the hardest part of the game. There are often flashing arrow signs showing where to go, but even these can be hard to make out until the last minute, and confusingly seem to render in front of other terrain.\n\nSound is not great either. There are renditions of full songs, including the iconic \u0022Get Low\u0022 title music. These are not good quality though, and crackle and pop constantly. The car engine sound effects are pretty poor too, sounding weak and tinny. There\u0027s a constant annoying tire screeching whenever you corner too.\n\n\nCore gameplay is Ok, you accelerate, brake and hand brake. The cars are very inclined to start sliding and drift around corners. The AI doesn\u0027t seem that challenging, and the only time I lost was when I crashed horribly into passing traffic or a side street with an invisible wall. There\u0027s a decent selection of tracks and cars, although the none of the tracks really stood out or had anything unique to identify them and since you never get to see a map view I couldn\u0027t really tell them apart. There are 4 modes: circuit race, sprint race (from point A to point B rather than laps), drag race, and drifting, which gives a little variety.\n\nThe exception to the game being easy is Drag racing, which seems to be kind of broken. From what I can tell, the AI is always a higher top speed than you but lower acceleration. This means you always start in the lead but the AI will win based on pure speed. The only way to win is some combination of luck and/or blocking them, which is fraught as sometimes you just spin out and die. I got to #1 in all the rankings, except for Drag mode which I gave up on. Hence the \u0022Partially complete\u0022 in the title.\n\nYou can customise cars, improving performance and changing the looks as you progress in the career mode. A lot of the visual upgrades to body work are too small to be worth bothering with though, as given the poor graphics you won\u0027t be able to see them when racing.\n\n\nThe career mode (\u0022Underground mode\u0022) is not particularly inspired in this version. There\u0027s a leaderboard of 11 NPC racers \u002B you, and each night you can challenge one to a race to improve your place on the standings. Sometimes they challenge you instead, and as a nice touch in this case is that you get to select the track and number of laps and cars. Annoyingly though, the game never tells you this information when you challenge someone else, leaving you guessing when the race is going to end. Ranking up unlocks cars and part upgrades.\n\nSome of these complaints might just be that the game hasn\u0027t aged well, and was received better at the time, but there are much better racers on the GBA which hold up more competently today. Overall I wouldn\u0027t recommend playing this game today and I didn\u0027t enjoy it much.\n",
    "completion-date": "2017-07-19"
  },
  {
    "game": "CIMA: The Enemy",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Nov 17, 2003",
    "rating": 1,
    "shortname": "cima",
    "status": "not-complete",
    "notes": "I\u0027ve given up on CIMA: The Enemy without finishing it, even though I don\u0027t have a really good excuse. The game is story driven etc. However, after making essentially no progress after a month and a half, I\u0027ve given up on it so I can continue with the challenge. This was just because the game is really unenjoyable and I\u0027ve failed to find the motivation to play it. Here\u0027s my review based on the first (roughly I think) quarter that I got through:\n\n\nI\u0027ll start with the positive. CIMA: The Enemy has pretty unique gameplay, a mix of action-RPG and RTS elements. It seems like they were trying to make something original, and that\u0027s something to be admired. It\u0027s just that it was a bad idea, poorly executed. The graphics also seemed solid, with new background tilesets showing up in every dungeon.\n\n\nThe core premise of CIMA is that you play Ark, a \u0022Gate Guardian\u0022. Ark and a group of human settlers have been kidnapped by the CIMA, a mysterious (or possibly just poorly explained) alien group who apparently get sustenance by causing humans to despair. Ark has to guide the gang out of a dungeon they\u0027ve been placed in, which must have a possibility of escape to ensure the humans remain hopefully as long as possible. Or something. This is at least an attempt to explain why the powerful CIMA have set up this elaborate dungeon and then attack one at a time in strict order of increasing power.\n\nThe actual game plays out like this: on each floor of the dungeon you control Ark, who can walk around fighting monsters and flipping switches, all the usual ARPG stuff. The twist is he must guide the settlers out. They are controlled by RTS like controls, setting waypoints for them. Sometimes you have to use them to weigh down switches or access areas you can\u0027t reach personally. The problem is you have to constantly hold their hands and protect them from infinitely respawning monsters.\n\nIt\u0027s essentially one long escort mission. For the whole game. With up to 14 people to shepherd around (mostly in groups of 4, although sometimes you\u0027ll need to handle them individually).\n\nAnd to cap it all, there\u0027s no pathfinding. At all. You have to manually set waypoints for everyone to follow, setting the path around corners and obstacles. If you set it up so they even slightly clip a corner, they\u0027ll just get stuck forever until you redo the path to clear the corner properly. This is incredibly frustrating. The same problem even applies to the companion character who just follows your player character around. When you walk around a corner, she can get stuck on it and glitch out, unable to follow. Note that in any decently made game she would just teleport back to you after you get too far away, but here she stays stuck forever. And if you don\u0027t have everyone in the exit room you can\u0027t advance to the next level.\n\nFighting regular enemies is just button mashing. Enemies pop out of nowhere making the main problem just reacting to them, and not accidentally sending your units to any empty space you haven\u0027t checked out first. Fighting bosses on the other hand, the main difficulty is that they all run around super fast and run into you, causing damage. Their actual attacks are usually not much of a problem.\n\n\nEach character has an individual (and small inventory). Most of the time it\u0027s your player character picking everything up, so you have to micromanage distributing items to everyone to keep his inventory space freed up. Almost all items except health items and upgrade materials seemed pretty useless anyway. There\u0027s a crafting system, which relies on materials farmed from enemies, and having a good relationship with the party members (which is raised by not letting them get hit and killing enemies near them). This seemed shallow and grindy.\n\nThere\u0027s just nothing fun in this game. Every aspect conspires to make it more annoying and repetitive. I have no idea how it managed to get a score of 70 to end up on the list (even though it only just made it on).\n\n",
    "completion-date": "2017-09-1"
  },
  {
    "game": "Mario \u0026 Luigi: Superstar Saga",
    "meta-rating": "90",
    "meta-user": "9.0",
    "date": "Nov 17, 2003",
    "rating": 5,
    "shortname": "m\u0026l",
    "status": "complete",
    "notes": "The Mario \u0026 Luigi is the smaller brother of the much more well known Paper Mario series, both descended from the original Super Mario RPG on the SNES. M\u0026L focuses on the exploits of both Mario brothers together, as they explore new lands and go on adventures.\n\n\n\nThe story stays away from traditional Mario game tropes. The story opens as Princess Peach has lost her voice after betrayal by an ambassador from the Bean-bean kingdom and Mario and Bowser team up to go and get it back. There are some nice twists and turns in there too. The game has a great sense of humour, with running gags including the Bros\u0027 attempts to get their message across through gesturing and no one recognising this green guy who\u0027s with Mario.\n\n\n\nThis all plays out in RPG fashion, reminiscent of games like Earthbound. Battles are turn based, but you can press the button at the right time (do an \u0022action command\u0022) to do extra damage or leap over enemy attacks. Different enemies have different weaknesses to your attacks: jumping, hammering, and elemental \u0022hand powers\u0022. There are also bros attacks which require more elaborate input to do extra damage. A nice twist on this is that after using the same Bros attack repeatedly one of the brothers will have a brainwave mid-battle, unlocking an alternate form of the attack. Bosses generally rely on good dodging of their attacks and figuring out how to deal damage to them efficiently rather than sheer statistical mastery.\n\n\nExploring the overworld is a kind of platform/rpg hybrid. You walk Mario and Lugi around, jumping the brother in front with A and in the back with B, from a fixed perspective. This works surprisingly well and avoids a lot of issues with perspective that can plague this style. Later on you gain special moves to use as well, which makes swapping the brothers important. These are naturally funny in themselves, like Mario lighting Luigi\u0027s butt on fire to charge fast across the screen. They double up as battle moves which ties the two gameplay styles together nicely.\n\nYou explore a variety of areas, which usually have some bonuses you can\u0027t grab first time through. This opens up exploration and backtracking later when you get more special moves. Near the end of the game there\u0027s some freedom in the order you complete the story too which is nice. There are a few side quests, the biggest of which revolves around finding beans to brew stat-boosting coffee.\n\nThere are also minigames, which revolve around clever use of A and B to control Mario and Luigi, like controlling them on 2 seperate minecarts while hopping obstacles. Usually you play a relatively gentle variation as part of the story and can play harder version for bonuses.\n\n\n\nOverall the game is fantastic. I can only offer a few nitpicks like a slight lack of enemy variety leading to repetitiveness near the end of an area and a slightly obnoxious final boss.\n",
    "completion-date": "2017-09-22"
  },
  {
    "game": "Lego Star Wars",
    "meta-rating": "75",
    "meta-user": "8.6",
    "date": "Mar 29, 2005",
    "rating": 2,
    "shortname": "lsw",
    "status": "complete",
    "notes": "Lego Star Wars is a crazy idea for a video game. Lego games had a history of being mostly just kid friendly (although there are some gems in there). Star Wars games/movie tie ins in general had a history of being shoddy, slapped together to come out with the films and make a quick buck. Combine the two together and you get... a great game? At least on home consoles.\n\n\n\n\nNot on the GBA however. This port fails to capture the magic that made the home console version a great game.\n\nThe game covers Episodes 1-3, letting you play through the action scenes. The stories are covered very lightly through \u0022cutscenes\u0022 consisting of pre-rendered still frames, and some short in-engine cutscenes. The slapstick humour of the console versions has mostly failed to translate due to the limited animations available.\n\nThe game looks pretty bad. It\u0027s mostly pre-rendered 3d backgrounds with a small number of pre-rendered 3d lego objects placed on top. Everything is very aliased. The game slows to a crawl when too much is going on too.\n\nGameplay is pretty uninspired. It\u0027s a fixed perspective pseudo-3D action game, with you jumping around and hitting people with lightsabers. Everything is really sluggish, worsened when the game lags in busy scenes. In particular, the character swap animation takes forever. Avoiding enemy bullets is mostly impossible due to the sluggishness, and enemies seemingly respawn infinitely. This lead to me mostly running past them.\n\n\nMost of the time you\u0027re just trying to figure out where to go. There are some very weak puzzles that revolve around hitting buttons in the right order, and the occasional goal like \u0022Free all the clone soldiers\u0022. You have to swap characters for a (very limited) set of special abilities, like higher jumps or hacking panels with R2. Boss fights are lightsaber duels that are mostly button mashing. The only hard one is Count Dooku in Episode 3 due to his bullshit force lightning attack.\n\nThere isn\u0027t much content in the game either. Each Episode only took me around an hour to get through I think. There is a little replayability with free play mode and collectables to find, but they didn\u0027t seem very enticing. Episode 2 in particular is very short. It starts at Tatooine which is a long way into the film, and only has 3 levels. Several levels re-use graphics too (multiple Tatooines, multiple Naboos, multiple Kashyyks). In spite of this, Episode 3 still feels padded with 2 very long treetop levels.\n\nAll in all, not a lot of fun. Especially with the home console versions as a yardstick. I think this is the same mistake as NFS: adapting the home console version as directly as possible without accounting for the GBA\u0027s limitations. Handhelds won\u0027t be able to do this well for a few generations after the GBA. It is possible to adapt home console games decently. The GBA Crash games spring to mind as decent attempts.\n",
    "completion-date": "2017-09-23"
  },
  {
    "game": "Metal Slug Advance",
    "meta-rating": "79",
    "meta-user": "8.3",
    "date": "Dec 2, 2004",
    "rating": 3,
    "shortname": "msa",
    "status": "complete",
    "notes": "Metal Slug Advance is a portable entry in the classic series of run-n-gun arcade games. The title is named after a tank that appears in every entry for the hero(es) to hop in and blast through the levels. I\u0027ve never played much Metal Slug before, so I can\u0027t comment on how this fits in with the series.\n\n\nStory wise, this is a spin-off, (I think) following some new recruits who start training and then find the island they are training on invaded by real enemies. At least I think that was the plot, it\u0027s not very well explained in game. Metal Slug games have never really been about the deep story though.\n\n\n\nGameplay wise, this is fairly straightforward run and gun. You run. And you gun. Occasional boss fights punctuate the levels, which are all giant machines of some kind. You start with a basic pistol and a melee knife attack, and find new gun power ups with limited ammo throughout the levels. In addition to just running through to complete the levels, there are prisoners to save and collectable cards to find which the game keeps track of for you.\n\n\nThe game is pretty short, with only a handful of levels. It wasn\u0027t hugely difficult either. There are no lives, dying just starts you back at the beginning of the current section of the level. I only had trouble with one or two of the bosses. Running through the stages wasn\u0027t particularly difficult except for one section with a forced fight next to some instant-death-bottomless-pits which was frustrating. The game does compensate by giving you a free tank if you die a lot in the same place though.\n\n\nOverall, I had fun with Metal Slug but it didn\u0027t make a big impression or stand out.\n",
    "completion-date": "2017-11-17"
  },
  {
    "game": "Mega Man Zero 4",
    "meta-rating": "77",
    "meta-user": "8.9",
    "date": "Oct 4, 2005",
    "rating": 3,
    "shortname": "mmz4",
    "status": "complete",
    "notes": "The Mega Man series is a very long running Capcom series, appearing mostly on Nintendo consoles. The Mega Man Zero sub series follows the eponymous Zero, a humanoid robot with fabulous hair who fights for a human resistance against evil \u0022maverick\u0022 robots. I believe this all fits in with the somewhat confusing overall plot of the Mega Man series. They are side scrolling action/platformers\n\n\nMega Man Zero 4 took a long time for me to complete, but for once it was not the game\u0027s fault. Rather I was quite busy changing jobs and didn\u0027t get around to play it for a few months. Although it\u0027s the fourth game in the (sub-)series, I\u0027m happy to play these out of order as I don\u0027t think the story\u0027s very important.\n\nSpeaking of which, the story follows Zero as he defends Area Zero, a rejuvenated area in an otherwise shattered world, against attack by Dr. Weil and his 8 robot bosses. The humans living there are supremely ungrateful for his efforts until the final cutscene. Mostly this is just another excuse to fight another 8 robot masters lead by some kind of evil mad scientist, like all Mega Man plots.\n\nThe game play is typical of the mega man series, particularly the Mega Man X and later games. You can run, shoot your gun, and dash and wall jump around fluidly. There\u0027s a bit more emphasis on up-close fighting as 2 of Zero\u0027s main weapons are the Z-Saber energy sword and the Z-Claw which is used to grab enemies and take their weapons. I stuck mostly to the Z-Saber, preferring its high damage.\n\nMost of the game, after the introduction level, is picking a stage from the 8 main stages and playing through to find and kill the boss at the end. Interestingly, you can change the weather. Each stage has a helpful and unhelpful weather state allowing you to tweak the difficulty. Also if you pick the unhelpful weather the state the boss will be slightly harder but will drop their \u0022EX-Ability\u0022 on death, which are various small additions to your move set. Some of these are elementally charged and will then do extra damage to some other bosses.\n\n\nAs the game goes on you get stronger in various ways. You collect E-Crystals to feed to a \u0022cyber elf\u0022, which unlocks various passive buffs. You can also find parts and craft items which buff you in various ways. This system is very opaque as there are a large number of different parts (most enemies drop a unique part), and you combine 3-4 of them to craft an item. Most combinations however produce junk and there doesn\u0027t seem to be much in the way of hints to how to craft good items. In particular, the double jump and sub tanks are massively helpful but I only even knew they existed after looking it up online. Getting the most out of these systems seems to require annoying grinding.\n\nMy main gripe with this game is it\u0027s hanging on to some old fashioned game mechanics, much to its detriment. The biggest one is that you have lives. You start with only 2 and extras are rare. Getting a game over forces you to restart the current stage at the beginning. This is very annoying as the bosses are tough and require practice to learn their move sets. But every third try you have to start all over again. This makes a fun challenge into a stupid grind. All this is exacerbated by the fact that environmental hazards like spikes and bottomless pits are instant death. This all makes me think they are trying to pad the game by making it obnoxiously frustrating rather than a fun challenge.\n\nThe last stage kicks it up another notch too, as you have to re-fight all the stage bosses back to back, followed by a two-stage final boss. I think this is traditional in Mega Man games, but that doesn\u0027t make it good.\n\n\nIt\u0027s a shame as the game is otherwise very good, with fun, fluid gameplay and challenging bosses. So I (ab)used save states to effectively give myself infinite lives. This made the game playable for me.\n",
    "completion-date": "2017-11-17"
  },
  {
    "game": "Egg Mania",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Sep 16, 2002",
    "rating": 3,
    "shortname": "em",
    "status": "complete",
    "notes": "Egg Mania is an arcade puzzle released on the PS2, Xbox, and Gamecube, and of course the GBA.\n\n\nThis is another one that I\u0027d never heard of and probably never would have played outside of the challenge.\n\nThere isn\u0027t any kind of story to this game, but it does have \u0022main modes\u0022, which end in a credits sequence, so I counted that as done. In this mode you play against 8 AI opponents in a row, and finish when you beat the last one. Each victory gets you an extra life too. The \u0022Over easy\u0022 mode lived up to its name, so I ended up beating this one in about 15 minutes. There\u0027s also a \u0022Hard boiled\u0022 mode which has further difficulty levels, but I didn\u0027t feel compelled to keep playing. There are a few other bonus modes, a survival and a time trial. There\u0027s a decent in-game tutorial too.\n\nThe gameplay is different from anything I\u0027ve played before. You play a little egg-man in a puzzle area taking up half the screen, with an opponent on the other side. The goal is to build a tower of blocks, in a somewhat Tetris-like fashion, to climb up and grab a floating hot air balloon. Blocks fall from the sky in crates, which you pick up and throw down to build your tower. There\u0027s a slowly rising water level, and if it hits a layer of blocks with holes in, they will be destroyed. Also if build up too high without completing a layer your tower will become unstable and fall down.\n\n\nThe game then ends up being to build your tower carefully, until you get high enough to build a narrow tower in the middle that will allow you to jump up and grab the balloon without falling down. There are also some powerups and other stage hazards that happen, but the only one really important is the \u0022super boots\u0022, which allow you to jump higher. This allows you to jump up and grab the end balloon much earlier, so are the best item in the game.\n\nI wasn\u0027t a fan of the graphics, which are a noisy pre-rendered 3d style. Sometimes the game felt messy and chaotic, especially when powerups are going off and fish are jumping out of the water.\n\n\nOverall, short but sweet. Decent little puzzler but nothing revolutionary.\n",
    "completion-date": "2017-11-18"
  },
  {
    "game": "Jackie Chan Adventures",
    "meta-rating": "75",
    "meta-user": "8.0",
    "date": "Nov 6, 2001",
    "rating": 2,
    "shortname": "jc",
    "status": "complete",
    "notes": "Jackie Chan Adventures is a side scrolling beat em up in the style of classic games like River City Ransom or Streets of Rage. It\u0027s based on an early 2000s cartoon named (guess what) Jackie Chan Adventures.\n\nI have somewhat fond memories of the cartoon, but never played the game.\n\n\n\nThe story more or less follows the story of the cartoon. Bad guys from an organisation called the Dark Hand are attempting to find magic scrolls to resurrect their demon master Shendu. A fictionalised  Jackie Chan, archaeologist who does some work on the side for a shady government organisation called Section 13, gets embroiled in their plot after they raid his uncle\u0027s antique shop and must stop them by finding the scrolls first. Most of the characters from the show are in the game, although some (mostly Jackie\u0027s family and allies) only appear in dialog. Oddly absent is Tohru, one of the major characters who starts as a villain and eventually becomes a good guy in the show.\n\nThe gameplay isn\u0027t great. Although you can do a few different combos, I eventually figured out that the most efficient strategy is just to use the quick jab continually. All enemies get knocked over after 3 hits and take a few knockouts to kill, and I didn\u0027t notice any attacks being particularly effective. The quick jab just hits quickest so there\u0027s the least chance of enemies hitting you first. Most of the skill comes in avoiding getting surrounded as you can get stunlocked indefinitely, particularly by the ninja enemies. Jackie Chan\u0027s fighting style revolves around fluidly improvising with the environment and objects to fight for comedic effect. You *can* pick up items and fight with them, but it\u0027s very slow and doesn\u0027t noticeably do any more damage than normal attacks, so I didn\u0027t bother much.\n\n\nYou fight waves of the same 3 enemy types (normal goons, big goons, ninjas), and are forced to finish each fight before you can move on in the stage.\n\nYou can walk up and down (towards and away from the screen) as well as left and right, but it\u0027s really hard to judge distance on this axis. This means you can end up just whiffing your punches. This is particularly bad against bosses who look big but are deceptively hard to hit, and can attack you in wider ranges. The worst part though, is that double tapping a direction does a flip and is very sensitive. This, combined with the fact that an up/down input seems not to register sometimes, means that it\u0027s very easy to accidentally do a flip up or down, which will carry you over a handrail to instant death in a pit. This was very frustrating.\n\nYou start with 3 lives and losing them means restarting the stage, which can be a long time if you die on a boss. There are slots that imply you could get more lives somehow but I never found any. Later levels have light platforming elements, but this mainly leads to accidental deaths from pits during fights and lots of frustration.\n\nBosses are pretty boring. Humanoid bosses can be easily beaten by just blocking until they attack and then throwing a jab before blocking again. More monstrous enemies only have one attack, so it\u0027s just a case of learning to dodge that one attack and wearing them down. The exception is the final boss who has multiple attacks and spawns infinite ninjas. This is mostly an endurance test.\n\nThe obvious comparison for me is Teenage Mutant Ninja Turtles. Both licensed titles, both beat em ups (with slightly different gameplay). But while TMNT was kind of fun if uninspired, Jackie Chan just slips into being repetitive and annoying.\n",
    "completion-date": "2017-11-26"
  },
  {
    "game": "Final Fantasy V Advance",
    "meta-rating": "83",
    "meta-user": "7.3",
    "date": "Nov 6, 2006",
    "rating": 3,
    "shortname": "ffv",
    "status": "complete",
    "notes": "This one was a long time coming. I had a lot of life stuff distracting me and the game itself is quite long.\n\nFinal Fantasy V Advance is a port of the original Final Fantasy V for the SNES. This is one of the titles that never originally got translated and brought to the west on the SNES. It made its western debut on the PS1 before later appearing on the GBA.\n\nFFV is a typical Final Fantasy game of its time. The art style, combat system, and grand plot spanning multiple worlds are all similar ideas that we iterated on throughout FF3-6, before FF7 which made the jump to 3D but kept a lot of the older ideas.\n\nThe story is reasonably good, typical Final Fantasy stuff. You play as 4 heroes who come together and realise they are destined to save the world, initially trying to stop the 4 elemental crystals from shattering, but then change to trying to stop Exdeath, a kind of aggregation of evil who was previously sealed in a void between worlds. Over the course of the story you learn a lot about the characters, and that they all have connections to the crystals which weren\u0027t immediately obvious. This is all handled fairly well.\n\nThe gameplay uses the \u0022ATB system\u0022 which a lot of the FF games around this time use; it\u0027s a kind of semi-real time semi-turn based system, where you wait for a meter to fill before taking your turn. On your turn you can do the usual attacks, magic, special moves etc.\n\nThe unique feature is the job system, which allows you to choose a \u0022job\u0022 (most other games would call this a class) for each part member. Each character levels up in their chosen job over time, separately from their main XP level, learning new skills. A similar system was in Final Fantasy 3, and has later appeared in other games like Final Fantasy Tactics Advance. One oddity is that spells are still bought from shops, so even if you level up the magic classes early on they won\u0027t learn more powerful spells.\n\nI do have some issues with the game though:\n\n1) Length. I felt the game was a bit over long and got fatigued in the third act. I ended up putting down the game for a long time before finally pushing through and finishing it.\n\n2) Weird balance. The combat balance is strange, some jobs are way more useful than others. Time Magic is almost mandatory due to haste(ga), which is arguably the best spell in the game. There are a lot of weird things in the game, like spells that instakill your characters if they are at certain XP levels. Near the end you get a job with an ability that has a good chance of dealing 9999 damage, with any character, any equipment, and no MP/resource cost. I could go on for a while about stuff like this.\n\n3) Unclear signposting of where to go/what to do. Often I found myself wandering the world map without a good idea where to go. This is exacerbated by the constant changing of what vehicles you have available, and so what places you can get to. I looked up stuff in a walkthrough after coming back to the game.\n\n4) Excessive encounter rate. It really sucked the fun out of exploration. Even worse, near the end there are reasons to revisit old dungeons, but they have the same (now incredibly weak) enemies that still spawn constantly, making these return visits an annoying slog with no challenge.\n\n5) Missed potential in the Job system. You can equip one job and one other skill from any that you\u0027ve unlocked. This ends up being very limiting, especially as in jobs with multiple active abilities, you must equip them in that one slot to actually use them. I really felt that some kind of points-based system allowing you deeper customisation would have been a lot more fun, which is what they introduced in some later titles.\n\n\n\nOverall, I really enjoyed the first 2/3rds of the game but felt that it fell apart in the final world.\n",
    "completion-date": "2018-04-1"
  },
  {
    "game": "Mega Man \u0026 Bass",
    "meta-rating": "79",
    "meta-user": "8.6",
    "date": "Mar 10, 2003",
    "rating": 3,
    "shortname": "mmab",
    "status": "complete",
    "notes": "Mega Man \u0026 Bass is another Mega Man game, in the original series of Mega Man games. As a running theme from the previous game, it was originally release on the SNES in Japan but not localised, and then later ported to the GBA and released abroad.\n\n\nThe game is pretty similar to the previous Mega Man game I played, Mega Man Zero 4, and most of what I had to say there still applies, so this will mainly be a comparison to that game.\n\nThe story is similarly perfunctory. A robot named King raids the robot museum for designs so he can build a robot army. Then at the end, it turns out he was working for Dr. Wily all along! These games are almost a self parody at this point (even when originally released on SNES it was alongside Mega Man 8, not to mention all the spinoffs like the X series).\n\nThe gameplay is a bit clunkier than the Zero games. There\u0027s no wall jumping and dashing is replaced with a slide along the ground. You do get a choice of Mega Man or Bass, who play a little differently. Bass has the ability to aim away from dead horizontal, which seems like technology Mega Man should really get installed.\n\n\nMMAB is more like a classic Mega Man game than Zero in that it revolves around killing the robot bosses and getting their weapons. I think the game gets better after you have a few weapons under your belt, as you have the ability to deal with situations cleverly, by picking a good weapon, rather than being forced to blast through with the default buster. Each boss is also weak to another bosses weapon. Exactly how weak varies: some are totally trivialised but some remain tricky.\n\nThe ending is a predictable gauntlet, with 2 \u0022final bosses\u0022 (King and then Dr. Wily) with multiple stages each, with refights of all the robot bosses in between. I still think this is a lazy way to pad out the game and increase the difficulty (given the lives system in place).\n\n\nMMAB is certainly not a bad game, but it repeats all the Mega Man tropes ad nauseum, which I\u0027m not a big fan of. Also, on the GBA, I think the Zero series is better.\n",
    "completion-date": "2018-04-2"
  },
  {
    "game": "Castlevania: Aria of Sorrow",
    "meta-rating": "91",
    "meta-user": "8.9",
    "date": "May 6, 2003",
    "rating": 5,
    "shortname": "caos",
    "status": "complete",
    "notes": "Castlevania: Aria of Sorrow is one of three Castlevania games we\u0027ll be playing through on the challenge, and generally considered the best one. I tend to agree with this feeling.\n\n\nThe game follows the (now classic) MetroidVania formula. You explore the castle, fight bosses, and get powerups which unlock the way to new areas of the castle. However AoS has a few twists on the classic formula.\n\n\n\nThe story is good, and has a significant twist over the usual Castlevania format. Dracula is dead, but someone born at the instant of his death is destined to inherit his power. Soma, the protagonist, was visiting a Japanese shrine at the moment of the eclipse and got sucked into Dracula\u0027s castle along with his friend (Girlfriend?) Mina. He just wants to get out safely, but gets sucked into the conspiracy. I think it suffers in the telling, which is in occasional plot text dumps when you run into someone in the castle.\n\nGameplay is fairly standard Castlevania stuff. Run, jump, and hit various undead creatures. You equip different weapons, like swords and axes, rather than the classic whip. Different weapons have different trade-offs between power, range, and speed, and provide good rewards for exploration. Bosses are interesting, generally challenging but not frustrating due to nearby save points. They telegraph their attacks nicely and so feel fair.\n\n\nThe big twist in AoS is the soul collection system. Every enemy type in the game has a unique soul, which they have a chance of dropping on death. Each of these grants a unique power for the player to use. Interestingly, some of the powerups to unlock new areas of the castle are just these souls you have to equip, like the Giant Bat soul which allows you to transform into a bat and fly around. Some are just new innate abilities you unlock though. This gives the game a pleasing collection mechanic, for the obsessive collectors out there. Some of the drop rates are quite low, so it can be frustrating to catch \u0027em all, as you end up grinding an enemy for ages. For this playthrough I just stuck with whatever happened to drop, which worked well enough.\n\nThe game looks pretty nice graphically, and has great variety in enemy designs. There are a few pallet swaps in the end game, but it\u0027s not too egregious. One criticism though, is that I found some platforms hard to pick out from the background.\n\n\nOverall, the game is just really well executed. It has tight controls, good exploration and boss fights, and enough twists on the classic MetroidVania formula to feel fresh. I had a lot of fun replaying this game another time, and blasted through it in almost no time.\n",
    "completion-date": "2018-04-2"
  },
  {
    "game": "The Mummy",
    "meta-rating": "72",
    "meta-user": "tbd",
    "date": "Nov 20, 2002",
    "rating": 2,
    "shortname": "tm",
    "status": "complete",
    "notes": "The Mummy is another tie in game. It\u0027s based on the early 2000s cartoon series, which is based on the 1999 film of the same name (which is itself a remake/reboot of a classic horror film). So we\u0027re already several levels deep in adaptation.\n\nIn terms of gameplay, it\u0027s a top down action-adventure title, most reminiscent of something like a 2D Zelda game.\n\nIn some ways, The Mummy isn\u0027t a bad game. I actually had a bit of fun in the first level, discovering the mechanics. You switch between the 3 family members (Father, Mother, and Son) any time, who each have different abilities. They can all fight, the son can cast spells and activate magic stuff, the mother can read hieroglyphs and do sweet flips, and the dad is stronk and can move heavy stuff. Generally you\u0027re always trying to unlock doors, to find keys, to unlock more doors. There\u0027s some puzzle solving, but it\u0027s not very challenging. Nearly all the puzzles can be solved by just pressing all available switches, opening all chests, etc.\n\nWhere it goes wrong, is that it stretches all this out over 4 levels, and barely introduces any new elements. There are 4 types of enemies in the whole game, and you\u0027ll fight about a million scorpions. There are a tiny number of puzzle elements which are combined in every possible combination. Each level has a new background tileset, but they all stick close to the theme of \u0022egyptian ruins\u0022.\n\n\nCombat is mostly functional, you can punch and block, or cast spells if you switch to the son. Everyone has a separate life bar, and if one of them dies you end up having to find a revive point to revive them as you\u0027ll need their unique abilities to unlock doors and progress. This ends up mostly being a drag. The hitboxes can be weird, mostly dependent on the way you face. There are 2 boss fights, one of which gets repeated. These were bad, and boil down to wailing on the bosses face and occasionally moving to avoid attacks. I died a few times to these because some of the attacks are bullshit.\n\nThe game uses a password save system, with only 4 characters. All it saves is your current level, so say goodbye to your coin collection if you die. Mercifully if you die on a boss the password just spawns you in the boss room for another try.\n\nIt has a paper thin story as an excuse for the whole thing. The Mummy is resurrecting, and hanging around Egyptian ruins doing something unspecified. You follow him and eventually stop him.\n\nOverall, The Mummy isn\u0027t a terrible game, certainly not the worst I\u0027ve seen recently, it just stretches itself out for too long.\n",
    "completion-date": "2018-04-4"
  },
  {
    "game": "Konami Collector\u0027s Series: Arcade Advanced",
    "meta-rating": "78",
    "meta-user": "tbd",
    "date": "Mar 21, 2002",
    "rating": 2,
    "shortname": "konarc",
    "status": "other",
    "status-note": "Arcade collections without an ending",
    "notes": "Konami Collector\u0027s Series: Arcade Advanced is a collection of 6 classic Konami arcade games ported to the GBA. There are a couple of these arcade collections on the list, and if I\u0027d realised I might have been tempted to filter them out. Playing old arcade games doesn\u0027t interest me greatly for the purposes of this challenge.\n\nSo, I played each game enough to get a good sense of it, and now I\u0027m moving on.\n\nFrogger\n\n\nIt\u0027s Frogger. I think I can say conclusively this is the most famous of the titles included. Certainly the only one I\u0027d heard of. Seems like a perfectly functional port.\n\nScramble\n\n\nScramble is a shooter where you\u0027re apparently invading an alien planet. You fly over a landscape, scrolling left to right, dropping bombs and shooting. Your object is to get as far as possible without dying or running out of fuel (which can be replenished by shooting fuel stations on the ground - somehow). Fun enough. The palette swaps occasionally, possibly to try and create a sense of progress but I found it quite jarring.\n\nTime Pilot\n\nTime Pilot is another shooter, this time you can move freely in any direction. You seem to be a futuristic ship shooting down biplanes in level 1 and spitfires in level 2. Presumably you\u0027ve gone back in time for some reason and are massacring the natives? The graphics look better in motion as the ships rotating in different directions gives a good sense of how they look. Seemed a bit repetetive to me.\n\nGyrus\n\nYet another shooter, this time you\u0027re in space warping between planets. In the process you fly along a tunnel and shoot alien ships flying towards you. Nice perspective effects on the tunnel, and you actually reach planets periodically which are show on screen.\n\nYie Ar Kung Fu\n\nA simple fighter where you have to beat a series of unique opponents. Better graphics than others in the collection. The gameplay is a little odd. Just pressing punch does nothing, you have to be holding a direction. Good variety of moves though. I got stuck on a guy with nunchucks who seems to have a much bigger reach and be much faster than you.\n\nRush\u0027n Attack\n\nRush\u0027n Attack is a proto-Metal Slug run\u0027n\u0027gun type game. You run left to right stabbing Russians (see what they did there?) and are trying to free POWs. The only gun appears to be a flamethrower which drops from certain enemies. Not as intense as Metal Slug eventually became but a good step on that path.\n\nOverall Konami Collector\u0027s Series: Arcade Advanced is a decent set of ports, but it doesn\u0027t make good use of the GBA hardware (as they are just straight ports), and isn\u0027t really what I look for in a game.\n",
    "completion-date": "2018-04-4"
  },
  {
    "game": "Shrek: Hassle at the Castle",
    "meta-rating": "71",
    "meta-user": "7.4",
    "date": "Oct 10, 2002",
    "rating": 2,
    "shortname": "shatc",
    "status": "complete",
    "notes": "I feel like everyone knows about Shrek. If you were living under a rock in the early 2000s, it was a very popular Dreamworks animated film, about an ogre named Shrek rescuing a princess.\n\nThis game adaptation is an action platformer, which follows the story of the first film quite closely.\n\nGameplay is a simple platformer. You can run, jump, and punch. Running requires you to keep holding the punch button after the punch, and is essential for a lot of the platforming after the first few levels. Speaking of which, the platforming is annoying, mainly because of the unclear hitboxes of the characters and platforms.\n\n\nThere\u0027s a fair bit of fighting. The punch is just a single punch, there are no combos or anything fancy. You also have a screen-clearing special attack on a meter which charges up.\n\nYou can play as several different characters (Shrek, Donkey, and Fiona), but they are all just reskins, they don\u0027t play differently.\n\nEach level has an objective, which is usually a combination of running right and punching stuff. There\u0027s one NPC escort mission, just to really spice things up. There are a few bosses, which range from pretty simple to aggravating. The hardest level was the timed escape from the castle, being chased by the dragon. This was just due to awkward platforming while having to dodge fireballs on quite limited health.\n\nNothing in Shrek is really egregiously bad, but the whole game feels limp and uninspired. Nothing made me really hate it, but nothing was really fun and engaging either. Just a mediocre lump. I finished normal difficulty. I only got the following screen instead of credits, but I wasn\u0027t about to slog through a harder mode after that.\n",
    "completion-date": "2018-04-8"
  },
  {
    "game": "Mario vs. Donkey Kong",
    "meta-rating": "81",
    "meta-user": "8.0",
    "date": "May 24, 2004",
    "rating": 3,
    "shortname": "mvdk",
    "status": "complete",
    "notes": "MvDK is a puzzle platformer,  It\u0027s something of a spritual sequel to the Donkey Kong games, particularly the title of that name for the Game Boy.\n\nIn it, Mario\u0027s toy factory, which has been producing tiny clockwork versions of himself, is raided by Donkey Kong who steals them for some reason. So Mario chases after him to take them back. You really can\u0027t make this stuff up.\n\n\n\n Each level has two parts: in the first part you find a key to unlock a door, and in the second part you just get to the trapped mini-mario to rescue them. Repeat 6 times in each world, and finish with a Lemmings-esque stage guiding the mini-marios around and a boss fight with Donkey Kong. In each level you have to navigate various obstacle, like pressing coloured switches to activate corresponding platforms or climb across vines. I enjoyed this a bit, but ultimately found in unsatisfying. I think the problem is the game is split between two worlds, puzzle and platformer, and satisfies neither.\n\nCompared to other 2d mario games, I found the platforming lackluster. Mario has momentum, like in the 3d series, but this doesn\u0027t work well in 2d. You have relatively little air control, which is annoying, and can bonk on the ceiling which is obnoxious. There\u0027s fall damage, which kicks in from a relatively low height too. Also, some of the obstacles seemed slightly buggy. The rope climbing controls took some getting used to and I had some issues with moving ropes. Everything moves slowly and you often end up waiting around for moving platforms or enemies to walk to the right position, making it boring (and frustrating if you die at the end of a stage and have to replay it). You have some \u0022advanced moves\u0022 like a backflip, which can be used to skip through some early platforming sections quickly.\n\n\nMeanwhile, the \u0022puzzles\u0022 are rarely vary puzzling. Usually it\u0027s just a case of pressing switches in order while avoiding a stupid death to a platforming mistake. Only one or two of the last stages required real thought.\n\nEach stage has 3 presents you can collect, in slightly hard to reach places, and if you do you can play a minigame at the end of the stage. However, there are only 2 minigames which cannot be skipped and take quite a bit of time. These got very wearing after a while. You can also get stars with high scores to unlock bonus stages after beating the game. This seems to mainly revolve around time attack as you get a lot of bonus points for time left on the timer.\n\nOne trend I\u0027ve noticed in several GBA game is weird assignment of the available buttons. MvDK provides a good example. There\u0027s a button you can press to pause the game and pan the camera around to view the stage. Very handy for planning your solution. To get this mode, you press L\u002BR simultaneously. Meanwhile, Select, and L/R individually are *totally unused*. I find this baffling. I had to look up this control online, because I wasn\u0027t even aware the feature existed. It\u0027s somewhat reasonable to put an optional control like this on a button and expect players to find it, but putting it on a button combo which is mentioned nowhere in the game, while other buttons go unused, is insane.\n\nGraphically, the game uses a pre-rendered 3D style, like Donkey Kong Country or Golden Sun (both games we\u0027ll be getting to in the challenge). I\u0027ve never been a big fan of this style, I think it looks awkward and messy compared to nice pixel art graphics. (It could be better if done at high resolution, but the GBA can\u0027t achieve this). The graphics are functional however, there are no problems understanding what things are supposed to be.\n\n\nOverall, Mario vs Donkey Kong is not the worst game I\u0027ve player by far, but I\u0027m not a fan of the direction it has taken, compared with other Mario platformers.\n",
    "completion-date": "2018-04-20"
  },
  {
    "game": "Final Fantasy VI Advance",
    "meta-rating": "92",
    "meta-user": "8.5",
    "date": "Feb 5, 2007",
    "rating": 3,
    "shortname": "ffvi",
    "status": "complete",
    "notes": "Final Fantasy VI Advance is the GBA port of the 6th Final Fantasy game (no surprises there). It\u0027s the next game after FFV which I played previously, but the Final Fantasy titles are unrelated (aside from some shared elements/themes/gameplay).\n\n\n\n\n\nThe game is pretty similar to FFV in a lot of respects, so I\u0027ll be discussing what\u0027s different in the gameplay and story.\n\n\n\n\nI liked the story of FFVI quite a bit. It breaks away from some of the classic RPG tropes. The game does start out with a character with amnesia, but aside from that it does well. There\u0027s a large ensemble cast of characters, and (aside from a few exceptions who barely feature), they share the spotlight. There isn\u0027t really a main protagonist, several characters form the core of the story.\n\nWhat I really liked was the aversion of the classic RPG plot: the psychopathic villain who wants to become a god and destroy the world actually succeeds at the half way point. Then the finale of the game is the party pulling themselves back together and saving a ruined world. This was an interesting twist on the \u0022multiple worlds\u0022 that many of the FF games of this era use (like FFV and its 3 worlds). The story gets super dark around the middle too, with Celes, the view point character at the time, attempting suicide. (I believe this scene can actually go a different way, but this was so impactful it seems a shame to leave it out).\n\n\nCore combat and exploration gameplay is pretty similar to FFV. Jobs are out, and each character has a unique special skill. The first half of the game frequently changes who is in the party forcing you to try out different things, and then the second half gives you freedom to choose your own party once you\u0027ve re-recruited them. One interesting point is magic. Only a couple of characters can cast magic naturally, but everyone can learn magic from magicite, the crystallized corpses of magical beings called Espers. This gives you a lot of flexibility in teaching any magic to anyone (although only characters with decent magic stats will actually be really effective). These magicites also give little stat boosts on level up allowing you to (in theory) tweak character\u0027s stats.\n\nThere\u0027s a fair bit of customisation to be found with the equipment and relics (unique items that can make big changes to how a character plays - like giving them a jump attack or changing what they can equip). This only really kicks in later in the game however, the early stages you are quite constrained on how the characters play.\n\nBalance seems better than FFV. Bosses generally seemed fair and less inclined to suddenly destroy you. Haste is relegated to second best spell behind quick, which lets you take 2 turns in a row.\n\nThis time the game has chilled out a bit with the modes of transportation - there\u0027s only one (technically 2) airship(s) which gets you everywhere. This was a lot less confusing that FFV\u0027s mishmash. The airship also has funky controls where you actually steer/fly it. There\u0027s some depth to them, like changing altitude, that doesn\u0027t really matter or get used.\n\nThe final twist on the formula is the multiple parties mechanic. In quite a few places you have to split your characters to form 2 or 3 parties you can switch between. This allows some puzzles of the \u0022one person stands on a switch while another goes through a door\u0022 style. They never do anything more complex than that though. It also means you are forced to keep multiple characters leveled up/equipped as you can\u0027t tell when you\u0027ll need more than just a party of 4. In particular in the final dungeon you need 3 full parties which each need to be up to fighting bosses.\n\nThe game goes quite open world in the second half after you regain the airship, allowing you to fly around the whole world and recruit people/side quest for magicite in seemingly any order. This works ok, but I felt the pacing of the last third is still off. Right when you want to be finishing the game, it opens up a lot of stuff to do suddenly, and you\u0027ll need to do some of it to be prepared for the final dungeon. The final dungeon itself is a bit of a slog, but not as nasty as FFV\u0027s. I ended up using the slightly OP Quick\u002BUltima combo on my magic characters to make short work of it.\n\n\n\n\nOverall, I enjoyed FFVI more than FFV, but I still think it has some issues which could be improved.\n",
    "completion-date": "2018-05-3"
  },
  {
    "game": "Super Monkey Ball Jr.",
    "meta-rating": "82",
    "meta-user": "8.6",
    "date": "Nov 19, 2002",
    "rating": 4,
    "shortname": "smb",
    "status": "complete",
    "notes": "Super Monkey Ball Jr is a port of the monkey rolling game that started in arcades, and then moved on to consoles starting with the Gamecube. It\u0027s a classic marble rolling style game, where the \u0022marbles\u0022 are monkeys in hamster balls.\n\n\nYes, it\u0027s a weird concept, but well executed.\n\n\n\nBasic gameplay is to roll your monkey (from a choice of 4) to the end of each stage. The dpad tilts the stage, along with a or b for finer control. That\u0027s basically it, but you have to contend with ramps, narrow platforms, moving platforms, pinball-style bumpers etc, as the game ramps up in difficulty. It starts very simple but gets very hard when combined with the timer pushing you forward (which maintains a fast pacing throughout).\n\nThis all works well enough, but the lack of an analog stick is a bit of a loss. This combined with the inability to control the camera (which just follows the direction you roll), can make navigating narrow pathways frustrating. You really need the camera to line up along the path so you can roll directly along the path, but you can\u0027t directly manipulate it so you end up fiddling around trying to get lined up right. This was annoying.\n\nThere are 3 difficulties/modes: Beginner (with 10 stages), Advanced (20), and Expert (30). Each has some extra stages at the end if you finish without continues (more on this in a second). I played through Beginner and Advanced. Beating any mode ends in the credits, and since Advanced seems to be normal mode, I called that done. I tried Expert, but it seems a lot harder.\n\n\nPlaying the game earns you points, which apart from high scores for each mode, are used to unlock extra game features like minigames. You accumulated these whatever you do, so this just locks the features behind play time really. Nothing spectacularly interesting seemed to be forthcoming here.\n\nThe lives and continues system is a bit dumb. You start with 2 lives and if you die, you lose your accumulated score and the chance for the extra stages at the end of the mode. Initially you can continue 5 times, but (according to the internet) one of things you can unlock is infinite continues. This seems obnoxious to me. Either just let me retry infinitely from the start, or not at all. Don\u0027t lock it behind some arbitrary play time gate.\n\nGraphically the game is 3D rendered, but the simple and abstract style means it looks decent (unlike most other 3D rendered games on the GBA). There are some draw distance issues in longer stages though, which is a little annoying.\n\n\nOverall, a decent enough port, but with some issues and a little lacking in content.\n",
    "completion-date": "2018-05-3"
  },
  {
    "game": "Hamtaro: Ham-Ham Games",
    "meta-rating": "77",
    "meta-user": "8.1",
    "date": "Jul 27, 2004",
    "rating": 3,
    "shortname": "hhg",
    "status": "complete",
    "notes": "Hamtaro: Ham-Ham Games is a track-and-field style sports game, based on the Manga/generally cute franchise of Hamtaro, a cute hamster who has cute adventures, with his cute hamster pals.\n\n\nThere\u0027s another Hamtaro game on the GBA which is quite different which we\u0027ll get on to at some point.\n\n\n\nIt has a very simple plot: the hamsters are holding a tournament, and you control Hamtaro and his team of friends as they try and beat a couple of other teams, most notably the Seahams, a pirate hamster team (which I found to be an excellent concept). That\u0027s about it for story.\n\nFor the gameplay, as you might expect, it\u0027s essentially a bunch of minigames for the different sports on offer. They mostly revolve around time button presses, with some approaching a rhythm game (notably the synchronized swimming). They all seem to function well enough, but the difficulty seemed to vary widely. Some were hilariously easy, but I lost others. In the main \u0022story\u0022 mode, you only get one shot at each event (aside from practice) and have to stick with your results.\n\n\nMy favorite was the carrot pulling, and least favorite were the two \u0022tournament sports\u0022, tennis and volleyball. The bird-back riding (think equestrian) would have been good, but the collisions seemed a bit off especially on gates oriented side-on to the camera. The others were all fine, more or less.\n\nYou can wander around the tournament grounds between events, talk to other hamsters (for simple and slightly amusing dialog), and find sunflower seeds (which you also get by winning events). I think the only use for these was buying cute costumes which didn\u0027t really appeal to me.\n\nJust playing through the events and getting to the end didn\u0027t take too long. I ended up winning about 2/3 of the gold medals overall, enough to win the tournament as a whole.\n\nThe high point of the game by far is the art. Gorgeous pixel art and animations abound throughout the game. There are a lot of unique cute hamsters in this game.\n\n\n\nOverall, a nice enough game if a little simple, saccharine sweet, and short.\n",
    "completion-date": "2018-05-3"
  },
  {
    "game": "Klonoa 2: Dream Champ Tournament",
    "meta-rating": "78",
    "meta-user": "8.8",
    "date": "Feb 23, 2005",
    "rating": 3,
    "shortname": "klonoa2",
    "status": "complete",
    "notes": "Klonoa 2 is a platformer, in the not-particularly-big-or-successful Klonoa series*. The 2 refers to this game being the second in the GBA sub-series, but the first one didn\u0027t make the list (for some reason, possible an oversight in metacritic as it seems to have been decently reviewed).\n\n\n\n\nI\u0027d describe it as a puzzle platformer, which revolves around your ability to pick up enemies and throw them using a \u0022wind bullet\u0022.\n\n\n\nThe game has a story which is actually told in game (primarily through cutscenes before every world and boss). The main character and some friends have been abducted to take part in a tournament to determine the greatest hero. After some initial surprise they don\u0027t seem particularly put out about this. There\u0027s a rival character who is a massive dickbag but inevitably has a redeeming moment at the end (although arguably this is self preservation, as he indirectly saved himself by saving the hero). Eventually it becomes apparent the guy organizing the tournament is the real bad guy after all, turning the losers into gears to form part of his machine empire. It\u0027s not Shakespeare, but it gets the job done and is a little more involved than a lot of platformers. All of this is told through surprisingly verbose cutscenes with slowly scrolling dialog, which was a little annoying.\n\nBasic gameplay is basic platforming, with the picking up and throwing of enemies as a twist. You can double jump by throwing an enemy down too. In each stage you need to find the 3 stars and get to the exit, passing through multiple rooms. Enemies are mostly non-threatening, respawn almost instantly, and are mainly used as tools to get around. In addition to basic enemies that you just throw, some have special effects when grabbed, like blasting you up higher or start the fuse on a bomb. In general, the levels are (mostly) more puzzley than actiony. Puzzles weren\u0027t too hard except for the last world, mostly involving classic elements like putting boxes on pressure plates, and I felt it dragging a bit around 2/3rds of the way through.\n\n\nIn each stage there are a bunch of optional collectibles too, which I mostly ignored. In the minigame/autoscroller stages these are annoying to collect as if you miss them you can\u0027t go back. There are tutorial and plot-related messages and hints left scattered around throughout the game. This was a bit too \u0022tell don\u0027t show\u0022 for my taste, at least after the initial controls tutorial.\n\nThe game does have some annoyances. Grabbed enemies are prone to just disappearing if anything slightly unexpected happens, like colliding with the player. This is frustrating when it happens unexpectedly during a long puzzle solution forcing you to start over. Also the bomb enemies are annoying. They\u0027ll spontaneously explode when thrown into most things, *except* the things they can actually destroy, forcing you to wait out the timer. There\u0027s also one underwater stage which is just like a normal stage except everything is in slow motion. This was especially dumb.\n\nSome of the levels deviate from the basic formula. There is a minigame level in each world where you ride a hoverboard in a 3d level with 2d sprites. Collision and depth perception were a bit dodgy. There\u0027s also an autoscroller in each world which becomes a bit less puzzley due to the constant movement forced. Finally there are boss levels. These are actually more like timed stages, as you are racing against an unseen rival to make it to the end. Sometimes you have to fight minibosses along the way though (some of which are obnoxious). The final boss is a traditional boss fight though.\n\nThe game isn\u0027t too long: 5 worlds of 9 levels each (2 of which are optional in each world), plus a final boss. The final world cranks up the difficulty a little more.\n\nOverall, nothing stellar or mindblowing, but a solid enough game.\n",
    "completion-date": "2018-05-4"
  },
  {
    "game": "Kingdom Hearts: Chain of Memories",
    "meta-rating": "76",
    "meta-user": "7.9",
    "date": "Dec 7, 2004",
    "rating": 2,
    "shortname": "khcom",
    "status": "not-complete",
    "notes": "Kingdom Hearts: Chain of Memories is an action RPG in the popular Kingdom Hearts series which blends Disney and Square-Enix properties into a surreal and surprisingly serious-at-times universe. It sits between KH1 and KH2 (both originally on the PS2) in the series continuity, and has been remade as Kingdom Hearts: Re:Chain of Memories for home consoles.\n\n\nTo avoid burying the lede: I got up to the final boss, after significant difficulties, at which point I realised actually beating her would take a lot more effort and grinding when I was already fed up. So I rage quit and moved on.\n\nThe core gameplay is an action rpg, with the twist that you are using a deck of cards to perform all your actions including hitting the enemy, casting spells, etc. The enemies also use cards for their attacks. If you attack at the same time as an enemy the higher numbered card wins out and the other is broken and does nothing. A 0 will break any other card but only if it is \u0022played\u0022 second. Outside of this you can jump and dodge and move around without cards in battle. Finally you can combine 2 or 3 cards into a \u0022sleight\u0022 which adds their values and may perform a special combo if you use the right cards. For example, 3xFire=Firaga.\n\nWhen you run out of cards in your deck, you can \u0022reload\u0022, giving you back all your unbroken cards. Some items also reload unbroken or broken cards instantly. This all means that long boss battle wear down your supply of cards, which can mean a slow and painful death if you are not quite strong enough to win.\n\n\nThis system seems nuance, and takes a little while to get your head around, but it\u0027s actually kind of shallow. High numbered cards, and 0s, are good. Low numbered cards are basically garbage. Also the fact a 0 breaks anything means that you can get royally screwed by setting up a big combo only to have the enemy break it with a 0. Most of this stuff only comes into play in boss battles. Everything happens so fast, that you don\u0027t have time to think carefully about what you\u0027re playing most of the time.\n\nYou go through a series of worlds themed around Disney properties, which is standard for Kingdom Hearts. To move between rooms you need room cards, gained by battling, which follow a similar numerical system to the battle cards. This is mostly fine, except when story rooms require you to have very specific cards and the only way to get them is to grind random battles.\n\nThe story is your typical Kingdom Hearts convoluted mess, revolving around Sora\u0027s journey through Castle Oblivion trying to find King Mickey and Riku. He starts to lose his memories and gain false memories. The worlds here are apparently constructed from memories inside Castle Oblivion, so are not real. The antagonists are the shadowy Organisation XIII, whose goals are mysterious and convoluted. I\u0027m not sure what they are really trying to achieve with any of this. Also Sora just kind of wanders into the castle apparently by chance. It\u0027s just not well explained as far as I can tell.\n\nA big criticism is that everything in KH:CoM is ripped from KH1. All the worlds, and most of the bosses with the exception of the last world and the Organisation XIII guys. They\u0027ve been modified for the card battle system and shrunk down to GBA size, but the designs are all straight from KH1.\n\nI enjoyed the first 3/4 of the game, but as alluded to above, the wheels fell off right near the end. You need very specific cards to open some story rooms near the end, and the only way to get them is to get lucky or grind for hours. What\u0027s worse is that these cards are not obviously rare, so I think I had one earlier in the game but just used it without realising the gold dust I was throwing away. The internet is full of people asking how to find a 1 Blue card, and being told they just need to grind away until it drops. I ground for hours, with no luck, so I used a cheat code just to try and finish the game. The final boss however proved to be nasty, and all that grinding for room cards does nothing to actually improve your battle deck. At this point I had had enough and quit.\n",
    "completion-date": "2018-05-6"
  },
  {
    "game": "Lufia: The Ruins of Lore",
    "meta-rating": "76",
    "meta-user": "8.3",
    "date": "May 6, 2003",
    "rating": 2,
    "shortname": "lufia",
    "status": "complete",
    "notes": "Lufia:Ruins of Lore is a JRPG in the relatively obscure (at least I hadn\u0027t heard much about it) Lufia series. The series seems to have been at its height in the SNES era, with 2 games there. Ruins of Lore is a sequel/side story to Lufia 2.\n\n\nThe game is fine, but a excessively long and slow. That\u0027s about the theme of this review.\n\n\n\nBasic gameplay is mostly classic jrpg: explore dungeons, fight monsters and bosses, save the world from ancient evil. There are a few twists that change it up though: in dungeons, monsters appear as you walk around and fights only happen when you walk into them.\n\nFights are standard turn based jrpg with some scope for getting more turns if you\u0027re faster. There is a job system for customising your characters and a pokemon - lite monster capturing system. The problem with these is that neither is really fleshed out enough to be really interesting. The job system is a bit shallow, just switch jobs to change your stats and learn new abilities that can then be used any time. The different job\u0027s abilities are not well balanced either. I mostly ignored the monster capturing and did fine. The monster designs are not inspired enough to really make it appealing. These two systems are also totally orthogonal. Allowing the two to mix somehow (teach your monsters jobs? Learn abilities from captured monsters?) might have added some much needed originality.\n\nThe interface is clunky and takes some getting used to. It ignores some conventions, for example select opens the menu and start just brings up the option to quick save. You need to press select to bring up item/skill descriptions rather than having them open all the time. Some of the item descriptions are laughably terse and unhelpful too. \u0022Charred Newt - A grilled newt.\u0022\n\n\nThe game seems to use a steep levelling curve so that you level up quickly for a short period when entering a new area and then get stuck for a long time. This makes grinding for exp relatively ineffective and ensures you\u0027re mostly at the expected level for any area/boss fight. However, it robs a lot of sense of progression. This also applies (I think*) to the job system which has some odd effects. You can stick with one job for the whole first half of the game and not master it, but if you change jobs later in the game you will almost instantly get the first few levels/abilities and master it relatively quickly.\n\nA ton of stuff in this game is just a little bit janky and annoying. There are too many too list, but here\u0027s one example: when a monster learns more skills than it can know, you get prompted after *every fight* to swap it out. There are just so many little annoyances that add up over the game.\n\nThe biggest criticism I have is that the dungeons are too long. Each ends up feeling like a slog before it\u0027s over and they are labyrinthine and lack any landmarks which makes navigation tricky. Each one seems to have some kind of unique element, although some of these are not great (invisible paths through corn you just have to trial and error through anyone?). The game forces you to renavigate some of these multiple times which really feels like unnecessary padding.\n\nThe game as a whole is slow paced, in dungeon design, combat speed, and in the pacing of the story particularly near the start. All this serves to pad the game length without adding actual enjoyment. Not cripplingly bad but still annoying. Very few parts of the game are really hard, not many bosses are really hard to beat in a stand up fight, but the game relies on the attrition of long dungeons and sudden death attacks to create artificial difficulty. The end of the game is massive slog consisting of repeating dungeons from earlier, including one which repeats 3 times(!).\n\nNone of this made me hate the game, but I also didn\u0027t really have a great time at any point of the game.\n\nNo credits shot, as the game didn\u0027t seem to have a credit roll at the end. It just ended with a \u0022Fin\u0022, which I didn\u0027t capture as I was waiting for the credits.\n",
    "completion-date": "2018-05-13"
  },
  {
    "game": "Tiger Woods PGA Tour 2004",
    "meta-rating": "75",
    "meta-user": "7.5",
    "date": "Nov 4, 2003",
    "rating": 3,
    "shortname": "tw2004",
    "status": "not-complete",
    "notes": "Tiger Woods PGA Tour 2004 is a proper golf simulator in the long running Tiger Woods series of golf simulators.\n\n\nI played enough to get an idea of how the game played. It does have a career mode with an ending but I ended up being a bit put off and didn\u0027t want to put in effort to master the game (see below for criticism). So I moved on.\n\n\n\nI was not a fan of the controls. You hold down to swing back, and then up to swing forwards. It\u0027s hard to tell exactly what you\u0027re aiming for to get maximum power. Also there doesn\u0027t seem to be any risk of inaccuracy unless you actively hold left/right to draw/fade your shot. The real issue is that the shot estimating line doesn\u0027t seem to show you where the ball will bounce, only where it will (theoretically) end up after stopping. This makes it almost useless for shooting over water, as it\u0027s very hard to judge whether you\u0027re actually going to make it over the water.\n\nThe game includes a tutorial, but this is very detailed in some useless areas (it has a separate section for both hold left to fade and hold right to draw), but doesn\u0027t explain some other fundamental aspects of the controls and interface. Not the best if you don\u0027t have the manual.\n\n\nIn terms of content, the game has 5 courses, and a few golfers to choose from. You can set a few options like wind strength that affect the match. In career mode you choose one of the golfers, with reduced stats, and play tournaments and events to earn money, improve stats, and unlock new events. It didn\u0027t seem like there was that much too it.\n\nOverall, probably not a bad golf simulator for the GBA, but it doesn\u0027t have the arcade appeal of a Mario Golf title, and if you really want a serious golf simulator you can do a lot better on modern plaforms.\n",
    "completion-date": "2018-05-15"
  },
  {
    "game": "Turok: Evolution",
    "meta-rating": "72",
    "meta-user": "7.0",
    "date": "Aug 26, 2002",
    "rating": 3,
    "shortname": "turok",
    "status": "complete",
    "notes": "Turok Evolution is an instalment of the GBA entry in the Turok series, most well known as a dinosaur hunting FPS series. There also have been handheld ports of the games on the Gameboy, GBC, and now the GBA.\n\n\nTurok Evolution is a side scrolling run\u0027n\u0027gun style platformer, a lot like Metal Slug or Contra. This entry got decent reviews but seems to be very obscure, there\u0027s not a lot of information out there on the internet.\n\nThe story is told through still slideshows with a few lines of text before most levels. It\u0027s an adaptation of the original series, with a Native American falling into an alternate reality full of dinosaurs and weird aliens with an evil American general. It\u0027s actually kind of unique, but it\u0027s only loosely touched on in this instalment.\n\nThe gameplay is run and gun shooter. It reminds me a lot of Metal Slug, particularly early on when you\u0027re mowing down waves of soldiers. Later on it shifts to dinosaurs and aliens who are a lot more bullet spongy. Unlike Metal Slug, you find multiple weapons and can shift between them at will. The weapons are the usual video game standbys of smg, shotgun, rockets, etc. You also get both alien and human versions of each weapon, which inexplicably use the same ammo despite the alien versions being laser guns. Mostly the alien versions have a different shot pattern but are otherwise similar.\n\n\nThe main annoyance of the game is the respawning enemies. As long as you stay on screen the same enemies will only respawn a finite number of times. As soon as you move and come back however, they\u0027ll spawn freshly. This makes some sections frustrating as moving back to dodge or kite enemies will cause them to spawn infinitely. Some sections seem to need strong weapons to pass in order to push through the enemies, but ammo is limited. It seems like you could paint yourself into a corner, but I managed to avoid doing so. Some enemies will get stunlocked with the pistol, but take ages to kill. This slows the game down as you want to conserve ammo, but you just have to hold fire and wait for stuff to die.\n\nBoss stages shift to a kind of 2.5d perspective, with you aiming a cursor into the background and firing. Your aim and movement are locked together, making shooting and dodging simultaneously awkward, but this mode otherwise works fine. Bosses are not too hard once you learn their weak points and patterns, although some will take ages if you don\u0027t have strong weapons. The final boss is disappointing as it has 3 stages, 2 of which are lifted from previous bosses wholesale.\n\nThe game is pretty short, with 5 areas of 3 levels \u002B a boss each. Levels are fairly short, and as death only leads you to respawning at the start of the stage frustration is mostly avoided. Some levels did take quite a few tries though. The game lacks replay value as there are no collectables or anything else to do in the game other than replay with the other playable character, who only plays slightly differently.\n\n\nOverall, a solid platformer if perhaps lacking in content.\n",
    "completion-date": "2018-05-15"
  },
  {
    "game": "Street Fighter Alpha 3",
    "meta-rating": "83",
    "meta-user": "7.7",
    "date": "Dec 1, 2002",
    "rating": 2,
    "shortname": "sfa3",
    "status": "not-complete",
    "notes": "Street Fighter Alpha 3 is a GBA port of this entry in the Street Fighter series. Unlike some other \u0022ports\u0022 on the GBA, as far as I can tell this is a pretty faithful port. The Street Fighter sequel naming scheme is very confusing so I\u0027m not sure where exactly this fits in.\n\n\nAs a disclaimer, I\u0027m not a big fighting game fan. I\u0027m fairly bad at them. I know little about Street Fighter apart from the pop culturally well known elements (Ryu, Ken, M.Bison, Hadouken etc.).\n\n\n\nThe gameplay is, to a layman like me, classic Street Fighter stuff. You have 3 punches and 3 kicks (2 of which are mapped to  pressing multiple buttons at the same time due to the GBA\u0027s lack of buttons). You can jump, hold back to block (I always find this hard to get on with), and perform special moves by entering cryptic button combos. Quarter circle forward \u002B punch for a hadouken is about all I know.\n\n\nThe game has a lot going on, and doesn\u0027t explain much of it in the game. Just to get into a fight you have to pick a character from a large selection, pick a fighting style (I think) which also changes the format of your special meter (not that I knew how to do any special attacks), and a speed. The speed options are \u0022turbo-1\u0022 and \u0022turbo-2\u0022. Just... what? None of this is explained in game. There\u0027s a training mode, but this is just a way to get an NPC fighter to stand so you can practice attacks.\n\nBasically, the game is not noob-friendly at all.\n\nSo, I lowered the difficulty (from a choice of 1-8 stars) and fired up \u0022Single mode\u0022. I button mashed my way through 9 of the 10 fights, mainly heavy kicking my way to victory. The 10th \u0022final boss\u0022 fight against M.Bison proved to be beyond me though. He was massively harder than any opponent up to that point, and seemed to block 90% of my attacks and fire out a devastating special with almost no warning. After trying for about an hour I gave up. I did almost beat him once but mostly I couldn\u0027t even get 1 of the 2 round victories required to win the match.\n\nThe best part of SFA3 is the graphics. The game looks really nice, and detailed. I\u0027m not sure whether the sprites are just taken from another version of the title or redrawn for the GBA, but either way they look great. Fighters are very detailed with a lot of animations, backgrounds are nice but not too distracting, and there are some nice extra details like Vega\u0027s claws falling off onto the floor sometimes.\n\nI\u0027m assuming this is a decent fighting game but it does nothing to help a beginner like me. It seems very inaccessible.\n",
    "completion-date": "2018-05-19"
  },
  {
    "game": "Rayman 3",
    "meta-rating": "83",
    "meta-user": "7.8",
    "date": "Mar 2, 2003",
    "rating": 3,
    "shortname": "r3",
    "status": "complete",
    "notes": "Rayman 3 is the GBA adaptation of (unsurprisingly) the 3rd game in the Rayman series. The Rayman series hasn\u0027t had that many games but the one it has have been ported to every platform imaginable. Also on the GBA is Rayman Advance, a port of the original Rayman. Note there\u0027s no Rayman 2 on GBA.\n\n\nOne theory I\u0027ve seen online (unsourced) is that Rayman 3 GBA was originally intended to be Rayman 2, but had a thin skin of 3 slapped on for marketing reasons. Having played the game, I believe this whole heartedly. The plot and gameplay are that of Rayman 2, with the only noticable R3 elements being the hoodlums in a few levels (but less than R2\u0027s robot pirates, which are the most common enemies). But anyway, on to the review.\n\nThe plot is told through the classic GBA still images with text. Rayman\u0027s pal Globox has swallowed the evil dark lum and needs rescuing from Razorbeard, a robot pirate. It\u0027s not going to win any awards, but it keeps the game moving.\n\nGameplay is a 2D platformer, similar to the original Rayman. You start with most of the classic moves: throwing fists, helicopter hair. As the game progresses you get a few new moves like upgraded punches, limited hair flight and a down smash. The gameplay is reasonably good, but the graphics on platforms sometimes make it unclear where the edge is*.\n\n\nThe game is fairly short. There are 4 worlds, each with several levels. Each level has some unique gimmick which is good. But these gimmicks are not always that inspired (like several variants of moving platforms you have to ride) and some levels in the second half are very long with little variation. Bosses are typical \u0022dodge attacks until a weak point appears\u0022 fare.\n\nThere are some minigame levels, water skiing and driving. These use the usual 3d graphics with 2 sprites superimposed and have the usual problems with unclear depth perception. Not too terrible though.\n\nI\u0027m not a big fan of the graphical style. Although it\u0027s more detailed than the original Rayman/Rayman Advance, it seems fuzzy and unclear at times. It\u0027s probably trying too hard to look like the home console version rather than develop a good art style for a 2D game.\n\nOverall, Rayman 3 is a solid game but nothing stood out as really interesting or fun, but nothing was really bad either.\n",
    "completion-date": "2018-05-19"
  },
  {
    "game": "Fire Emblem",
    "meta-rating": "88",
    "meta-user": "9.2",
    "date": "Nov 3, 2003",
    "rating": 5,
    "shortname": "fe",
    "status": "complete",
    "notes": "Fire Emblem is a tactics RPG, in the long running Fire Emblem series. The Fire Emblem games before FE(GBA) where not localised in the west, but the success of Super Smash Bros. and the Fire Emblem characters there lead to FE(GBA) being localised. Ironically none of the characters in this game appeared in any Smash game, but Roy from the previous unlocalised GBA title did. Speaking of which, this game is actually a prequel to that game, with some returning characters. Since the success of FE(GBA) the FE series has been localised fairly consistently, including the 3rd and final GBA title, Fire Emblem: The Sacred Stones which is also on the list.\n\n\nThis is another game that is quite close to my heart, which I attribute to getting me into turn-based tactics/strategy games, a genre which I now quite enjoy. There are a couple of other similar games on the GBA coming up too, including the well known Final Fantasy Tactics Advance, and some less well known titles like Tactics Ogre, Zone of the Enders, Super Robot Taisen, and Rebelstar. This puts tactics RPG as quite a big genre on the GBA. Anyway, on to the actual review.\n\n\n\nIf you\u0027ve played any Fire Emblem game, you\u0027ll know what to expect. In each level you move your army of heroes around the map, killing bad guys, and attempting to achieve some objective like seizing a castle or just wiping out the enemy units. Your units are all individual people with personalities and backstories, and unique stats, who join throughout the story (including some who must be recruited by fulfilling conditions in battle). Enemies are generally faceless mooks, with a boss in each level who has some personality.\n\nMovement around the maps is interesting, and each map generally feels unique without too much filler. You have to consider terrain, position relative to enemy units, and so on. You can also \u0022rescue\u0022, where one of your units picks up another to pull them out of harms way. This is particularly useful with the flying units who can fly over impassable terrain to drop off others. There\u0027s also a character who can give someone an extra move, which can be a (literal) lifesaver.\n\n\nWhen two units meet, a fight plays out based on their statistics and some random dice rolls. Picking your battles is really key to the whole game. There are a bunch of factors to consider, like the weapon triangle, (swords\u003Eaxes\u003Elances\u003Eswords), weight and special properties of weapons, character stats, terrain, etc. There\u0027s more depth than I can succinctly describe here, which is well explained by an in-game tutorial and the ability to press R at pretty much any time to bring up more information.\n\nOne thing I do want to emphasise is the graphics. One the map screen, individual units are quite small. They don\u0027t look amazing, but are differentiated easily and, crucially, a lot of map fits on the screen at once. The UI elements also kind of \u0022float\u0022 and move out of your way, so the whole space is utilized. Overall, it\u0027s very functional, and looks nice enough in the bargain. The game really shines when you enter battle however. The battle animations are generally gorgeous. Very detailed with many character sprites, weapon animations, etc. The critical hit animation in particular all look cool and convey the extra weight nicely. Possibly the only criticism is that units of the same class are just palette swaps of one sprite, but there are enough classes this isn\u0027t a big issue, and key story characters get unique looks.\n\nThe story and setting are based around western medieval-style fantasy, with horse mounted cavaliers, swordsmen, wizards, and dragons. There are some Japanese influences visible in certain places however, as you\u0027d expect from a Japanese game. There are two parts to the story, the first follows Lyn, a humble nomad from the plains who discovers she\u0027s heir to a Lycian princedom, but must rush to stop her newly discovered grandfather from being murdered. Part two follows Eliwood, another Lycian prince, as he attempts to find his missing father and ends up embroiled in a plot to return dragons to the world, which would be apocalyptic. Lyn\u0027s story serves as a tutorial and introduction leading into Eliwood\u0027s story as the meat of the game. Lyn and characters from her story return in Eliwood\u0027s. There\u0027s also a third story, Hector mode, which is an alternate version of Eliwood\u0027s story making Hector, a secondary character in Eliwood\u0027s story, take centre stage. The writing is good, and the story twists and turns througho\n\nThere\u0027s an ensemble cast of characters, as required to give the player enough units to play with, who are mostly well written. You can also get units to fight together and form bonds, unlocking bonus conversations between your favourite units as well as a statistical boost when they are near by. This system is not very obvious to a newcomer in this game, and was made clearer in later titles.\n\n\nOverall, Fire Emblem is a great game that means a lot to me personally. Replaying it was nothing but fun for me.\n",
    "completion-date": "2018-5-28"
  },
  {
    "game": "Dragon Ball Z: The Legacy of Goku II",
    "meta-rating": "75",
    "meta-user": "8.5",
    "date": "Jun 17, 2003",
    "rating": 4,
    "shortname": "dbzlg2",
    "status": "complete",
    "notes": "Dragon Ball Z: The Legacy of Goku II is a top down action RPG based on the very popular Dragon Ball Z manga/anime/general pop cultural phenomenon. DBZ was pretty much at its height when the GBA was released, and quite a few DBZ games made it onto the GBA. Only 3 made it into the challenge list: this game, Dragon Ball Advanced Adventure (an action platformer based on the original Dragon Ball i.e. young Goku\u0027s adventures), and Dragon Ball Z Supersonic Warriors(a 2d fighting game).\n\n\nAs you may have guessed from the title, Legacy of Goku 2 is a sequel to another GBA title, Legacy of Goku. There was also a third game, Buu\u0027s Fury. Neither of these got good enough critical ratings to get onto the list, so it seems the Legacy of Goku 2 was a high point in the series.\n\n\n\nLegacy of Goku 2 covers the Android and Cell sagas from the Anime, and follows the story relatively closely. The only exception is that some stuff is added during what is essentially a timeskip in the source material (the 3 years between Trunks arriving from the future to defeat Frieza and the Androids actually appearing).\n\nThe pacing of the game is a little odd. The first half felt like the introduction to a much longer game, but when the Androids finally appeared the plot kicked into high gear and the game ended up finishing relatively quickly. I wonder if this was because they needed to add in some content to reintroduce the gameplay and characters, without much happening in the story. Then when the story gets going everything happens much faster. The game is fairly short overall, but does have some sidequests and post-game content I didn\u0027t get into.\n\n\nGameplay is decent, but not amazing. Mostly it consists of walking around, punching enemies and throwing various special attacks. Hitboxes are a little \u0022interesting\u0022, depending on which angle you\u0027re facing. The main issue is there\u0027s no block or dodging mechanic, and after a hit you (or your enemies) get stunned. This means you can effectively stunlock enemies to death. This applies to all the bosses throughout the game. Getting that first hit in can be difficult due to the weird hitboxes though. The most threatening enemies are those that appear in large packs, as they can stunlock you to death very quickly.\n\nGraphically, the game looks fairly good, with decent bighead style pixel art. There are a few oddities, like the fact that Cell is much bigger than everyone else and has more realistic proportions.\n\nThe biggest problem with the game (other than the slightly dodgy core gameplay) is the necessity of grinding. You play as 5 different characters, each of which levels separately and you can only switch at a savepoint. There are doors in the world, which require specific characters at specific levels to open (with no attempt to explain in-fiction what these are). Sometimes you really are forced to grind, for example when you unlock Goku at level 35 you almost immediately need him at level 40 to unlock some doors. The saving grace is that levelling isn\u0027t that slow when you fight the hardest enemies available. Even an under levelled character can be brought up to scratch fairly quickly. I found this process surprisingly relaxing however, and it annoyed me less than grinding in some games does.\n\n\nOverall, Legacy of Goku is a cut above your average GBA tie in, but is let down from greatness by its short length, shallow gameplay, and grinding. I did enjoy the experience however.\n",
    "completion-date": "2018-5-31"
  },
  {
    "game": "Super Street Fighter II: Turbo Revival",
    "meta-rating": "84",
    "meta-user": "7.6",
    "date": "Oct 30, 2001",
    "rating": 2,
    "shortname": "sf2",
    "status": "not-complete",
    "notes": "Super Street Fighter II: Turbo Revival is, apparently, a GBA original iteration of Street Fighter. That said it is the fifth iteration of the \u0022Street Fighter II sub-series\u0022.\n\n\nHonestly I don\u0027t have a lot to say about this one. Given my knowledge of Street Fighter/2D fighting games, this is mostly indistinguishable from Street Fighter Alpha 3. Similarly I played through the main arcade mode until I hit a wall, and then packed it in. I can pretty much cut and paste my SFA3 review from here.\n",
    "completion-date": "2018-5-31"
  },
  {
    "game": "James Bond 007: Everything or Nothing",
    "meta-rating": "73",
    "meta-user": "8.3",
    "date": "Nov 17, 2003",
    "rating": 2,
    "shortname": "jbeon",
    "status": "complete",
    "notes": "James Bond 007: Everything or Nothing is a top down Action-Adventure game, based on the media juggernaut that is James Bond. It\u0027s actually not based on a film, but is an original story made for games.\n\n\nThere have been good James Bond game adaptations. Goldeneye on N64 is the most famous one, being an early console FPS (and thus a lot of people\u0027s first introduction to the genre) as well as titles like Nightfire. This GBA adaptation is... not the best.\n\n\nThe story is typical James Bond stuff, not great literature but it gets the job done. There\u0027s a bad guy trying to use nanotechnology to take over the world, and 007 trots the globe tracking him down, gets the girl and saves the day.\n\nGameplay isn\u0027t great. There\u0027s some emphasis on stealth, with enemies patrolling and a detection meter. It\u0027s typical \u0022stand behind the wall until the guy walks past\u0022 stuff. You can stealth kill enemies, but actually getting it to work is fiddly. Most of the time it\u0027s kind of easier to blast your way through, when the game isn\u0027t telling you that stealth is mandatory. Speaking of which, gunplay is terrible. Guns kind of auto aim, for you and the enemies, so it\u0027s just a case of trying to fire first and hoping the enemies go down quickly. There\u0027s some rappelling down walls which would be cool, but the combat is even worse when you\u0027re doing that.\n\nYou\u0027re trying to complete objectives in each level, which most often boil down to \u0022walk to a place and maybe press a button\u0022. Some levels have weird jankiness too, like the lab level where you can\u0027t shoot too many scientists even though they can attack and follow you around the whole level. 007 also has some gadgets which are mostly kind of ineffectual. You can buy upgrades between missions with little noticeable effect. Really you just want health packs to avoid dying. There are some driving sections for variety, which work a little better but get repetitive fast.\n\nGraphically the game looks pretty bad. It\u0027s trying too hard to be realistic and just looks muddy and understylised. Character designs are super boring too. Try and guess which character is James Bond in this screenshot.\n\n(It\u0027s the guy on the right for reference). The best thing I can say is each level has unique graphics, which is better than some games.\n\nIt\u0027s fairly short, without too many levels, so at least it was over quickly.\n\nOverall, nothing about EoN is heinously bad, but it\u0027s pretty uninspired and nothing was really fun about it.\n",
    "completion-date": "2018-6-3"
  },
  {
    "game": "Tony Hawk\u0027s Pro Skater 4",
    "meta-rating": "85",
    "meta-user": "8.8",
    "date": "Oct 28, 2002",
    "rating": 3,
    "shortname": "thps4",
    "status": "complete",
    "notes": "Tony Hawk is a famous professional skater. His most well known feat is being the first person to land a 900, that is a 2.5 rotation spin on a skatboard. The Tony Hawk\u0027s Pro Skater series is a big and long running series of skateboarding video games, starting on the PS1 and continuing on.\n\n\nThis is one of several GBA adaptations, and five of them made the list. This one, of course, adapts THPS4. The game has survived the transition reasonably well, but you\u0027d be better off playing a home console or PC version.\n\nThe gameplay is a reasonable port of the home version: skate around, do tricks strung together into combos to score points. The main area it has suffered is the lack of buttons on the GBA leading to some awkwardness that took a bit to get used to (e.g. R is both flip trick in the air and revert on landing).\n\nThere\u0027s no story in this one, but unlike earlier games you don\u0027t just skate with a time limit to get a high score and complete goals. Instead you explore the levels and find people who give you individual objectives to do. I never liked this about THPS4, it seemed like the awkward middle child between the earlier games\u0027 pure arcade gameplay and the later games\u0027 actual story mode. Also in this version it\u0027s a pain to find the goal givers as they look just like other random NPCs until you get close and the prompt appears.\n\n\nGoals themselves are ok, some are the usual (high/sick/pro score, find skate letters), and some of the new ones are interesting. Some can be a bit janky though.\n\nGraphics are decent but not stellar, trying to look realistic on the GBA as usual puts me off. The one problem is that the isometric viewpoint can be confusing and it can be hard to tell if things are close to the camera or high up or in the background etc. I usually had to just skate around a level for a while bouncing off stuff to understand what was going on.\n\nOverall, again not a terrible port but inferior to home versions. I\u0027m interested to see if any of the other Tony Hawk\u0027s GBA games are different.\n",
    "completion-date": "2018-6-7"
  },
  {
    "game": "Pirates of the Caribbean: Dead Man\u0027s Chest",
    "meta-rating": "70",
    "meta-user": "6.0",
    "date": "Jun 27, 2006",
    "rating": 3,
    "shortname": "potc",
    "status": "complete",
    "notes": "Pirates of the Caribbean: Dead Man\u0027s Chest is an action adventure game based on the popular Pirates of the Caribbean film franchise, which, fun fact, is based on on a ride at Disneyland.\n\nThe game is not the lazy tie in you may have been expecting. In fact, it\u0027s a surprisingly good game.\n\n\n\nBasic gameplay is a side scrolling platformer, with simple sword fighting. This is decent enough, better than a lot of the dodgy GBA platformers. The enemies can be a bit annoying, especially when they\u0027re near an edge and block you from getting on it to fight them. It\u0027s otherwise decent though.\n\n\nThis is all wrapped in another layer where you sail around the Caribbean in a pirate ship, landing on islands to get to the platformer levels. This was surprisingly cool and in-depth. You can have ship battles when you encounter enemies on the seas. These end up just being annoying, with you sailing around each other in circles, fighting against the wind.\n\nYou can buy upgrades for ship and platformer sections, explore to find bonus treasures, and look for rumours in taverns. It has a nice piratey feel too it. The main quest is fairly short, only taking me a few hours to plough through, but you could probably put in more time to exploring if you wanted to.\n\nGraphics are decent, a little ugly in places but they are generally clear including platform hitboxes.\n\n\nOverall, a surprisingly decent tie-in attempt.\n",
    "completion-date": "2018-6-12"
  },
  {
    "game": "F-Zero GP Legend",
    "meta-rating": "77",
    "meta-user": "8.3",
    "date": "Sep 20, 2004",
    "rating": 4,
    "shortname": "fzgp",
    "status": "complete",
    "notes": "F-Zero is a series of fast and futuristic anti-gravity arcade racing games. There have been quite a few of these, starting with F-Zero on the SNES.\n\n\nF-Zero GP Legend is one of 2 F-Zero titles on the GBA. It didn\u0027t get as good review scores as the other, F-Zero: Maximum Velocity.\n\nIt\u0027s an arcade racer, you accelerate, steer (with air brakes for drifting), and try to avoid crashing too much. You can boost, with a meter that gets refreshed by driving over certain parts of the track. You also have a health bar and lose if it runs out. Your ship can be repaired by driving over other sections of the track. It\u0027s pretty fun, controls are decent, and the AI is usually competetive.\n\n\n\nGraphically, it\u0027s 3D with mode-7 style stretched sprite graphics. Looks OK, with a good draw distance compared to some of the polygonal 3D games like Need for Speed. There\u0027s a nice variety in the ships too. The only problem is that the tracks are all flat and can look a bit sparse.\n\nThe game actually has a story mode, telling intertwining stories about different F-Zero racers. It\u0027s a kind of faintly cyberpunk sci-fi story, with bounty hunters tracking down criminals. Of course, everyone resolves their problem by having F-Zero races. The races in this mode are just races with slightly different objectives, like racing to the end of one lap of a long twisty track, or just a normal race, nothing amazing. I played to the completion of one of the character\u0027s story which brought up the credit. This didn\u0027t take too long, but there are multiple other unique stories for other characters.\n\nOverall, F-Zero is a pretty fun game on the GBA, even if it\u0027s not quite up to the intensity of the home console versions.\n",
    "completion-date": "2018-6-12"
  },
  {
    "game": "Tales of Phantasia",
    "meta-rating": "76",
    "meta-user": "8.0",
    "date": "Mar 6, 2006",
    "rating": 2,
    "shortname": "top",
    "status": "not-complete",
    "notes": "Very generic feeling RPG which completely failed to hold my interest for any length of time. Awkward and clunky battle system, very generic plot and characters. Gave up on it after a bit.\n",
    "completion-date": "2018-7-14"
  },
  {
    "game": "Astro Boy: Omega Factor",
    "meta-rating": "85",
    "meta-user": "8.8",
    "date": "Aug 18, 2004",
    "rating": 5,
    "shortname": "abof",
    "status": "complete",
    "notes": "Fantastic side scrolling platformer/beat em up. Great graphics (with occasional lag), big bosses, and a decent amount of content. Like a Mega Man game but with more bombast and a much less annoying continue system. One of the best games I\u0027ve played on the GBA.\n",
    "completion-date": "2018-7-15"
  },
  {
    "game": "Dokapon: Monster Hunter",
    "meta-rating": "70",
    "meta-user": "7.0",
    "date": "Oct 30, 2001",
    "rating": 2,
    "shortname": "dmh",
    "status": "not-complete",
    "notes": "RPG with some rogulike elements, in the \u0022Mystery Dungeon\u0022 style (i.e. the same boring dungeon generation as other Japanese roguelikes). Weird rock/paper/scissors based battle system (literally RPS based). Very clunky interface. Again, failed to hold my interest beyond the beginning, so I gave up to avoid stalling.\n",
    "completion-date": "2018-7-15"
  },
  {
    "game": "Tony Hawk\u0027s Underground",
    "meta-rating": "86",
    "meta-user": "7.7",
    "date": "Oct 27, 2003",
    "rating": 3,
    "shortname": "thug",
    "status": "not-complete",
    "notes": "Yes, I was on a bad streak. But it gets better after this. Can be summarised as very similar to THPS4 which I played previously. Suffers from the same problems. Adds only a few new mechanics like the ability to get off your board. Seemingly lengthy career mode where you build up a custom skater from nothing. Fundamentally not a very good version of THPS/THUG compared to the home console versions, so I moved on.\n",
    "completion-date": "2018-7-27"
  },
  {
    "game": "Metroid: Zero Mission",
    "meta-rating": "89",
    "meta-user": "8.9",
    "date": "Feb 9, 2004",
    "rating": 5,
    "shortname": "mzm",
    "status": "complete",
    "notes": "Excellent Metroidvania style platformer. Remake of the original Metroid, with much improved graphics and some gameplay tweaks, plus a new area and boss. Controls are great, exploration is fun and rewarding, generally good. Weak point is probably the bosses, as there are only a few and they are not amazing (although they look very nicely rendered).\n",
    "completion-date": "2018-7-28"
  },
  {
    "game": "Drome Racers",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Jun 19, 2003",
    "rating": 3,
    "shortname": "dr",
    "status": "complete",
    "notes": "Surprisingly good 3D racer, based on a Lego franchise. 3D graphics aren\u0027t amazing, but you can actually tell what\u0027s going on, unlike in some other GBA 3D titles. Gameplay is decent, you have a drag race warmup followed by a racetrack or offroad race. You can upgrade your cars in career mode. Computer racers seemed to be fairly uncompetetive though. Pretty decent fun actually. Tracks are a bit samey, and ice/frozen tracks are annoying. Seemingly no credits, but I did get a shot of my full trophy collection.\n",
    "completion-date": "2018-7-28"
  },
  {
    "game": "Pokemon LeafGreen Version",
    "meta-rating": "81",
    "meta-user": "8.6",
    "date": "Sep 7, 2004",
    "rating": 4,
    "shortname": "pkmnlg",
    "status": "complete",
    "notes": "It\u0027s Pokemon. A remake of the original games, so a big nostalgia hit. Graphics much improved over the original, nice sprite work in general. Suffers from some of the same problems as the original, including a weird difficulty curve in the mid-game and some progression that would be obtuse if I didn\u0027t know the games (i.e. stuff with the Silph Scope/Pokeflute, getting Tea for the border guards, etc.). I also seemed to need to do some grinding to beat the Elite 4/Champion even though I had trained my team consistently, which was a little annoying.\n",
    "completion-date": "2018-8-25"
  },
  {
    "game": "Sword of Mana",
    "meta-rating": "72",
    "meta-user": "8.3",
    "date": "Dec 1, 2003",
    "rating": 4,
    "shortname": "som",
    "status": "complete",
    "notes": "Pretty decent action RPG, in the Mana series, most famous for Secret of Mana on the SNES. Core gameplay is hack and slash, does a decent job but suffers from lack of any block/dodge mechanic. Can get repetitious as there isn\u0027t really anything comparable to Zelda items to vary the dungeon crawling. Storytelling is a little odd in places, and can be confusing. Possibly some translation problems? Or just that you need the manual for backstory. A lot of side quests, which seemed boring fetch quests, complicated by the game\u0027s slightly annoying day/night and day of the week systems. Also seemed quite easy, I didn\u0027t grind or do side quests and had no problems beating the game.\n",
    "completion-date": "2018-8-29"
  },
  {
    "game": "Tony Hawk\u0027s Pro Skater 2",
    "meta-rating": "95",
    "meta-user": "6.7",
    "date": "May 30, 2001",
    "rating": 3,
    "shortname": "thps2",
    "status": "not-complete",
    "notes": "Yet another THPS game. Much the same as the others, with the same issues again. More classic gameplay, just completing goals in a level rather than any pretence of story. Lack of the revert mechanic limits comboing somewhat compared to later titles. Actually got stuck and could not unlock the last level, and gave up.\n",
    "completion-date": "2018-8-29"
  },
  {
    "game": "Doom II",
    "meta-rating": "77",
    "meta-user": "8.6",
    "date": "Oct 28, 2002",
    "rating": 4,
    "shortname": "d2",
    "status": "complete",
    "notes": "Doom was one of the earliest first person shooters, released in 1993 for MS-DOS on the IBM PC. Pretty much all modern FPS games can trace a lineage back to Doom and its predecessor Wolfenstein 3D, both produced by id Software.\n\nDoom II, unsurprisingly, is the sequel to Doom released in 1994. It\u0027s not revolutionary sequel and doesn\u0027t add much to the original Doom. Instead it\u0027s more of an incremental improvement and level pack. Both Doom and Doom 2 got remakes for the GBA, and both are going to be featured in the challenge. D2 came up first, so this will be the more detailed review.\n\nNow the first thing that stands out about D2 is the controls. The GBA of course lacks any kind of twin analogue sticks or mouse and keyboard setup for moving and aiming. This turns out not to be an issue as Doom was originally designed to be played on just a keyboard and doesn\u0027t require aiming vertically. To shoot at enemies above or below you, you simply aim in their general direction and the game adjusts for you. Something else to note about Doom is that the game is not fully 3D as such. Levels cannot have spaces that overlap above and below each other.\n\nSo, the controls actually work OK on the GBA, although there aren\u0027t quite enough buttons to go around. There are a few options to choose from, but you always end up with something being awkward. I played with strafe on the shoulder buttons, but change weapons was an awkward shoulder \u002B A combo. Aiming can be difficult however.\n\nThe game then plays like a classic shooter. Walk around, blast demons, find the exit in each level. Often you have to press switches, find colour coded keys, and as you explore you can find secrets with extra health and ammo. All of this works pretty well, there aren\u0027t a ton of weapons, but each one feels unique and has a purpose (although I never went back to the pistol after the very beginning).\n\nNew in Doom 2 are the chainsaw, super shotgun (which I used a lot), and a few enemy types. The main problem in D2 is that it\u0027s a sequel without a major difference from the original. So the level design tries to compensate by just being bigger and more filled with enemies. The difficulty curve is fairly steep (I guess they were designing with D1 players in mind), and you find all the weapons pretty early on. There are quite a few levels, and I got a bit fed up of it by the end.\n\nI also have gripes about the level design. On the one hand, it\u0027s impressive how much variety they got out of the (by modern standards) simplistic level layout and design tools. On the other hand, the game relies a lot on bullshit surprises (oh no, a wall opened up behind you with 50 guys behind it), cryptic switches which you can\u0027t work out what just happened, and blank walls you have to hump. The map helps a lot as it show which walls are different and may be actiavatable. Also a very small number of walls need to be shot instead of activated, and this got me stuck for a long time late in the game.\n\n\nGraphically, the game looks about as good as you can get with 3D on the GBA. Up close, things look ok, but they get blurry very fast at a distance. This can make it hard to spot across wide open spaces which feature heavily in some levels. Also, the frame rate noticeably struggles when a lot of level geometry is on screen. This can have a strange slingshotting effect as you are slowed down passing some feature of the level, and end up overshooting where you were trying to move when you get to a faster part of the level.\n\nOverall, Doom 2 is a reasonable port, and its flaws and the limtations of the GBA don\u0027t stop it from being fun most of the time.\n\n",
    "completion-date": "2018-9-8"
  },
  {
    "game": "Boktai 2: Solar Boy Django",
    "meta-rating": "78",
    "meta-user": "8.0",
    "date": "Oct 19, 2004",
    "rating": 2,
    "shortname": "boktai2",
    "status": "not-complete",
    "notes": "Boktai 2 is the sequel to Boktai, which I\u0027ve already played and reviewed in the challenge. Boktai 2 is a direct sequel picking up from where B1 left off.\n\n\n\n\n\n\nThe basic gameplay of B2 is much the same as B1. The only thing that\u0027s significantly different is that the game is now melee focuses instead of ranged focused (since the Solar Gun is gone, replaced by the Sol Del Vice which is a glove that enchants the weapon it holds with sunlight power). You can still stealth around, ambush enemies and so on. Most of the enemies seem to be returning from the previous game, which is a bit disappointing.\n\n\nThe sunlight-based aspects of the gameplay have been shaken up. Midway through the game you get turned into a vampire, and are hurt by sun. This is kind of a non-issue as, even in the original game, you can just turn off or block out the sun. However to restore energy you have to sleep in your coffin which takes ages and is kind of annoying. As vampire django you also get a health restoring attack which somewhat trivialises resource management, since you can heal and recharge energy relatively easily. Eventually you get to switch back and forth.\n\nThe game gives you too many abilities, and you only get to quick switch between 4 of them at a time. This only gets worse when you get the power to switch forms as the powers of one form are unusable when you\u0027re the other form, and they don\u0027t get switched out automatically. The menu to swap powers is also quite awkward. The game also lags constantly when there is more than one enemy on screen. It\u0027s particularly terrible during boss fights.\n\nMy biggest complaint with the game is that grinding and upgrading your weapons is basically mandatory for bosses. You can happily progress through the rest of the game, but then hit a boss and find you\u0027re doing barely any damage, making the fight frustrating. This is what made me put down the game, as I couldn\u0027t be bothered to grind and had experienced crashes with the side-dungeons. To be fair to the original game, this may have been to do with the emulator and/or sunlight sensor patching rather than the original game, but still stopped me playing the side missions.\n\n\nOverall B2 rehashes a lot from B1, and what it does add is not particularly well thought through. I bored a lot of the time playing this game, and eventually got frustrated and gave up.\n",
    "completion-date": "2018-9-16"
  },
  {
    "game": "Disney\u0027s Magical Quest",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Aug 13, 2002",
    "rating": 3,
    "shortname": "dmq",
    "status": "complete",
    "notes": "Now, my list named this game as \u0022Disney\u0027s Magical Quest\u0022, but as far as I can tell, no game with that exact name exists. Rather, there are three games with titles that are a variant of \u0022Magical Quest Starring X \u0026 Y\u0022, all of which got GBA versions. Looking at the release date listed, I\u0027m pretty sure the listed version is the first title, \u0022Magical Quest starring Mickey and Minnie\u0022, so I played that.\n\nMagical Quest is a classic 2D platformer, and a port of a SNES title. As a result, it\u0027s surprisingly tough even on normal mode.\n\nGameplay is classic platformer with a few twists. At the beginning of the game you can grab and throw blocks and stunned enemies, giving it a Klonoa feel. As you play, you are given alternate costumes for Mickey which you can switch between giving different powers. These are not what you might guess, which is nice. There\u0027s a turban granting magical powers, a firefighter\u0027s uniform granting the ability to spray water with some interesting applications, and a grappling hook which is mostly an upgrade of the basic abilities. These are put to some reasonably interesting uses in the game.\n\n\nThe game is pretty short, it only took me a few hours to beat. Levels are mostly linear with some exploration. A few later levels are a bit more labyrinthine, notably the final level which has a bunch of apparently pointless side rooms with mini-boss refights.\n\nGraphically the game is alright, nothing spectacular. It suffers a bit from having platforms that can\u0027t be distinguished from the background.\n\nThe game has lives and game overs, but for the most part game overs do nothing. They return you to the start of the stage, but only a few stages have any kind of mid-level checkpoint anyway. The game does have a few bosses at the end of long stages, which is annoying.\n\n\nOverall, Magical Quest is very average. I had a bit of fun playing it, mostly experimenting with the costumes, but it is fairly bland and occasionally annoying.\n",
    "completion-date": "2018-9-16"
  },
  {
    "game": "Ultimate Brain Games",
    "meta-rating": "80",
    "meta-user": "8.3",
    "date": "Mar 18, 2003",
    "rating": 3,
    "shortname": "ubg",
    "status": "other",
    "status-note": "Not a traditional game, no ending.",
    "notes": "Ultimate Brain Games is a collection of classic board games made for the GBA.\n\n\nYup, this going to be a quick one.\n\nThe games seem competently put together, with a decent variety. They\u0027re pretty much what you\u0027d expect: Chess, Checkers, Dominoes, Mahjong Solitaire, etc. Battleships and Connect 4 get non-trademark-infringing versions with slight differences. No complaints here, but also not much to offer in the modern age. There are 1 player vs. AI and 2 player variants (where appropriate). The AI seemed reasonably competent, but might struggle to challenge e.g. hardcore chess players due to the GBA\u0027s slow processor speed.\n\n\nThere\u0027s a surprisingly detailed avatar/character creator to make your little portrait which is displayed during games. You have to remember the GBA has only local multiplayer, so this seems fairly pointless.\n\n\nObviously the game doesn\u0027t have a story mode or an ending, so I stopped after trying out the modes.\n",
    "completion-date": "2018-9-16"
  },
  {
    "game": "Doom",
    "meta-rating": "81",
    "meta-user": "8.5",
    "date": "Oct 28, 2001",
    "rating": 4,
    "shortname": "doom",
    "status": "complete",
    "notes": "The other Doom that made it to GBA. I found this one a bit more entertaining than Doom 2 as its levels were a bit shorter and simpler (compared to 2\u0027s mazes). Also seems to be a totally different port of the engine which is weird. Otherwise more or less the same as Doom 2, fun shooty action with design that\u0027s suffered a bit with age.\n",
    "completion-date": "2018-9-17"
  },
  {
    "game": "Super Puzzle Fighter II",
    "meta-rating": "83",
    "meta-user": "7.6",
    "date": "Mar 31, 2003",
    "rating": 3,
    "shortname": "spf2",
    "status": "other",
    "status-note": "No story mode.",
    "notes": "A gem matching puzzle game which is inexplicably Street Fighter themed. Seemed decent enough but nothing ground breaking. I played a bit of the arcade mode for the challenge, I\u0027m not sure if it has an end with credits but I didn\u0027t feel motivated to continue.\n",
    "completion-date": "2018-9-17"
  },
  {
    "game": "Silent Scope",
    "meta-rating": "70",
    "meta-user": "8.0",
    "date": "Sep 4, 2002",
    "rating": 2,
    "shortname": "ss",
    "status": "complete",
    "notes": "Silent Scope is a port of the classic lightgun arcade game. It\u0027s a little awkward playing on the GBA with only a dpad, but it just about works. You shoot waves of bad guys on slightly badly rendered backgrounds. The game is fairly short, although it ends with a stupid final boss where you have literally one shot or you\u0027d have to restart the game. I didn\u0027t hate it, but it wasn\u0027t particularly great.\n",
    "completion-date": "2018-9-17"
  },
  {
    "game": "Car Battler Joe",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Oct 21, 2002",
    "rating": 2,
    "shortname": "cbj",
    "status": "not-complete",
    "notes": "Car Battler Joe has an intriguing premise, it\u0027s a car battling RPG where you upgrade and level up your \u0022Gun Vehicle\u0022 and fight stuff. However, it badly fails to deliver. Missions are repetitive and mostly consist of driving from point to point. The story is a bit ropey, and seem a bit badly translated. The game\u0027s interface is absolutely abysmal, with extremely shortened names like IrnFrms (Iron Frames?) and awkward one-item-at-a-time inventory management.\n",
    "completion-date": "2018-10-1"
  },
  {
    "game": "Dragon Ball: Advanced Adventure",
    "meta-rating": "75",
    "meta-user": "8.5",
    "date": "Jun 6, 2006",
    "rating": 4,
    "shortname": "dbaa",
    "status": "complete",
    "notes": "Dragon Ball Advanced Adventure is a 2D platformer based on Dragon Ball (Not Z). It follows a young Goku as he has zany comic adventures trying to obtain all the Dragon Balls. It follows the whole arc of Dragon Ball, up to the final fight with King Piccolo, before the time skip to DBZ. It\u0027s a really solid action platformer, with good gameplay. It also has a 2D Fighting Game style mode, used for some bosses, which is not amazing but not terrible. A few levels were a little annoyingly mazey, but otherwise the game is pretty great.\n",
    "completion-date": "2018-10-1"
  },
  {
    "game": "Blender Bros.",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Apr 15, 2002",
    "rating": 3,
    "shortname": "bb",
    "status": "complete",
    "notes": "Blender Bros. is a 2D platformer in which you have to save a series of planets from some kind of evil I think. I\u0027d actually played this before in a speed running blind race setting. It\u0027s main gimmick is the collectible little companions who give you different powers. It\u0027s an OK game generally, but with obnoxious boss fights.\n\n",
    "completion-date": "2018-10-1"
  },
  {
    "game": "Mario Kart Super Circuit",
    "meta-rating": "93",
    "meta-user": "8.2",
    "date": "Aug 26, 2001",
    "rating": 3,
    "shortname": "mkss",
    "status": "other",
    "status-note": "No story mode.",
    "notes": "It\u0027s Mario Kart. Not a particularly great instalment, the controls are a little twitchy and the graphics aren\u0027t amazing, but basically it\u0027s Mario Kart. I played through the cups for the challenge and then called it a day.\n",
    "completion-date": "2018-10-1"
  },
  {
    "game": "Tim Burton\u0027s The Nightmare Before Christmas: The Pumpkin King",
    "meta-rating": "71",
    "meta-user": "5.5",
    "date": "Oct 10, 2005",
    "rating": 2,
    "shortname": "nmbcm",
    "status": "not-complete",
    "notes": "This was a bit of a surprise, it\u0027s actually a Metroidvania style 2D platformer. A decent attempt, but controls were occasionally boring and most of the levels are in practise quite linear, with most of the powerups being gimmicks that get you past specific walls. Still, a surprise. The final boss turned out to be obnoxious, mainly because fighting him took so long, after I died once I gave up.\n",
    "completion-date": "2018-10-3"
  },
  {
    "game": "The Legend of Spyro: The Eternal Night",
    "meta-rating": "80",
    "meta-user": "8.1",
    "date": "Oct 2, 2007",
    "rating": 3,
    "shortname": "los",
    "status": "complete",
    "notes": "This is from the \u0022bad kinda-edgy reboot\u0022 era of Spyro games, before he became a vehicle for the toys-to-life Skylanders. This is actually the second game in a trilogy, but the only one which made it onto the list with decent reviews. It\u0027s an OK action platformer, but with massively spongy enemies which take way too long to kill, padding out a relatively short game. Doesn\u0027t resemble any spyro I know.\n",
    "completion-date": "2018-10-6"
  },
  {
    "game": "Tactics Ogre: The Knight of Lodis",
    "meta-rating": "88",
    "meta-user": "9.1",
    "date": "May 11, 2002",
    "rating": 2,
    "shortname": "tokol",
    "status": "not-complete",
    "notes": "An SRPG in a long-running series that\u0027s never really struck big (at least in this half of the world, not so sure about Japan). Seemed OK, but I found it unplayable due to the very slow pace of battles, because of the slow animations and repeated text prompts (\u0022Choose where you want to move this character\u0022 on every single turn).\n",
    "completion-date": "2018-10-20"
  },
  {
    "game": "Turbo Turtle Adventure",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Sep 14, 2002",
    "rating": 3,
    "shortname": "tta",
    "status": "complete",
    "notes": "Simple marble (turtle) rolling puzzle game. Puzzles are pretty simplistic, mostly being \u0022find key to open door\u0022 or \u0022find powerup to traverse corresponding obstacle\u0022. You can\u0027t get any kind of look ahead at the level, so a lot of the time you\u0027re just guessing at the correct path and have to retry when you go wrong. Gets a bit convoluted later on.\n",
    "completion-date": "2018-10-21"
  },
  {
    "game": "Medal of Honor Infiltrator",
    "meta-rating": "80",
    "meta-user": "7.2",
    "date": "Nov 17, 2003",
    "rating": 4,
    "shortname": "mohi",
    "status": "complete",
    "notes": "Decent enough top down shooter with minigames. Not offensive, but nothing spectacular.\n",
    "completion-date": "2018-10-26"
  },
  {
    "game": "Worms World Party",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Oct 29, 2002",
    "rating": 3,
    "shortname": "wwp",
    "status": "other",
    "status-note": "No story mode.",
    "notes": "A reasonable portable implementation of worms, but nothing innovative.\n",
    "completion-date": "2018-10-26"
  },
  {
    "game": "Classic NES Series: Zelda II: The Adventure of Link",
    "meta-rating": "73",
    "meta-user": "7.6",
    "date": "Oct 25, 2004",
    "rating": 2,
    "shortname": "zelda2",
    "status": "not-complete",
    "notes": "Very old and dated design, dodgy sidescrolling gameplay and baffling fetch questing. I\u0027m not a fan.\n",
    "completion-date": "2018-10-28"
  },
  {
    "game": "Bomberman Max 2: Red Advance",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "May 30, 2002",
    "rating": 2,
    "shortname": "bm2ra",
    "status": "not-complete",
    "notes": "I don\u0027t like Bomberman as a single player game. It\u0027s ok in multiplayer but just kind of boring in singleplayer.\n",
    "completion-date": "2018-10-28"
  },
  {
    "game": "Atari Anniversary Advance",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Mar 25, 2002",
    "rating": 3,
    "shortname": "aaa",
    "status": "not-complete",
    "notes": "Another arcade collection, not a lot to distinguish this one either.\n",
    "completion-date": "2018-10-28"
  },
  {
    "game": "Pac-Man Collection",
    "meta-rating": "79",
    "meta-user": "7.8",
    "date": "Jul 12, 2001",
    "rating": 2,
    "shortname": "pc",
    "status": "other",
    "status-note": "No story mode.",
    "notes": "Another (more specific) arcade collection. Still not much to say about this, it\u0027s literally pacman.\n",
    "completion-date": "2018-10-28"
  },
  {
    "game": "One Piece",
    "meta-rating": "76",
    "meta-user": "7.9",
    "date": "Sep 7, 2005",
    "rating": 3,
    "shortname": "op",
    "status": "complete",
    "notes": "Another pretty good anime platformer tie-in game. Not as good as Dragon Ball or Astro Boy, and I\u0027m not a One Piece fan, but still entertaining.\n",
    "completion-date": "2018-11-4"
  },
  {
    "game": "Gekido Advance: Kintaro\u0027s Revenge",
    "meta-rating": "70",
    "meta-user": "7.0",
    "date": "Nov 25, 2003",
    "rating": 2,
    "shortname": "gakr",
    "status": "complete",
    "notes": "Decent beat-em-up with some platforming. Obstacles are annoying and has a stupid lives system, and password saves(!).\n",
    "completion-date": "2018-11-10"
  },
  {
    "game": "Namco Museum",
    "meta-rating": "79",
    "meta-user": "7.3",
    "date": "Jun 10, 2001",
    "rating": 2,
    "shortname": "nm",
    "status": "other",
    "status-note": "Arcade collection.",
    "notes": "Yet another arcade collection, nothing special here.\n",
    "completion-date": "2018-11-10"
  },
  {
    "game": "Mat Hoffman\u0027s Pro BMX",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Nov 19, 2001",
    "rating": 2,
    "shortname": "mhpbmx",
    "status": "not-complete",
    "notes": "Extreme sports game where you go left to right, and I don\u0027t even have the nostalgia as for Tony Hawk\u0027s...\n",
    "completion-date": "2018-11-10"
  },
  {
    "game": "Prince of Persia: The Sands of Time",
    "meta-rating": "75",
    "meta-user": "8.8",
    "date": "Oct 30, 2003",
    "rating": 2,
    "shortname": "pop",
    "status": "not-complete",
    "notes": "Decent platformer, with a bad adaptation of the time travel mechanics from the console game. Ended up giving up due to having missed some keys that would have required a bunch of backtracking.\n",
    "completion-date": "2018-12-2"
  },
  {
    "game": "Final Fantasy IV Advance",
    "meta-rating": "85",
    "meta-user": "7.4",
    "date": "Dec 12, 2005",
    "rating": 2,
    "shortname": "ffiv",
    "status": "not-complete",
    "notes": "Yet another Final Fantasy game, I ran out of motivation to slog through another JRPG.\n",
    "completion-date": "2019-1-6"
  },
  {
    "game": "Shaman King: Master of Spirits 2",
    "meta-rating": "72",
    "meta-user": "8.3",
    "date": "Aug 2, 2005",
    "rating": 4,
    "shortname": "skmos2",
    "status": "complete",
    "notes": "Another pretty good anime platformer. Some metroidvania-ish elements and a spirit system reminiscent of Aria of Sorrows, although the collection is not as interesting.\n",
    "completion-date": "2019-1-11"
  },
  {
    "game": "Pokemon FireRed Version",
    "meta-rating": "81",
    "meta-user": "8.7",
    "date": "Sep 7, 2004",
    "rating": 3,
    "shortname": "pkmnfr",
    "status": "not-complete",
    "notes": "Did a Nuzlocke run since this is a repeat. Died to Misty, who seems hard for where she appears in the game, since I had not managed to acquire a pokemon effective against her.\n",
    "completion-date": "2019-1-12"
  },
  {
    "game": "Iridion II",
    "meta-rating": "78",
    "meta-user": "8.3",
    "date": "May 29, 2003",
    "rating": 3,
    "shortname": "i2",
    "status": "complete",
    "notes": "Decent shooter with pre-rendered 3d and sprite scaling. Ironically for a sequel to Iridion 3d.\n",
    "completion-date": "2019-1-12"
  },
  {
    "game": "Monster Rancher Advance 2",
    "meta-rating": "79",
    "meta-user": "8.6",
    "date": "Nov 17, 2002",
    "rating": 2,
    "shortname": "mra2",
    "status": "not-complete",
    "notes": "Monster raising game which is mainly menu based. Didn\u0027t hold my attention for long.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "Virtua Tennis",
    "meta-rating": "83",
    "meta-user": "tbd",
    "date": "Oct 8, 2002",
    "rating": 2,
    "shortname": "vt",
    "status": "not-complete",
    "notes": "Pretty standard tennis simulator.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "The King of Fighters EX2: Howling Blood",
    "meta-rating": "80",
    "meta-user": "8.5",
    "date": "Dec 11, 2003",
    "rating": 2,
    "shortname": "kofex2",
    "status": "not-complete",
    "notes": "Another fighter. Unlike Street Fighter it has teams of 3 who fight in series. I\u0027m still not a fan of fighters.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "Wario Land 4",
    "meta-rating": "88",
    "meta-user": "8.6",
    "date": "Nov 18, 2001",
    "rating": 5,
    "shortname": "wl4",
    "status": "complete",
    "notes": "Excellent platformer. One of the best games on GBA with really good level design. Pretty short though.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "Donkey Kong Country",
    "meta-rating": "78",
    "meta-user": "8.9",
    "date": "Jun 9, 2003",
    "rating": 4,
    "shortname": "dkc",
    "status": "complete",
    "notes": "I\u0027ve never really played any Donkey Kong Country games before, once I got used to the controls I enjoyed it quite a bit. I don\u0027t think it\u0027s quite as polished as, for example, classic Mario games.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "Yu-Gi-Oh! Worldwide Edition: Stairway to the Destined Duel",
    "meta-rating": "72",
    "meta-user": "8.8",
    "date": "Apr 8, 2003",
    "rating": 2,
    "shortname": "ygo3",
    "status": "not-complete",
    "notes": "Yet another Yu-Gi-Oh game. At least this is the last one.\n",
    "completion-date": "2019-1-13"
  },
  {
    "game": "Crash Nitro Kart",
    "meta-rating": "77",
    "meta-user": "8.3",
    "date": "Nov 11, 2003",
    "rating": 4,
    "shortname": "cnk",
    "status": "complete",
    "notes": "A pretty decent kart racer by GBA standards. Mini-turbo controls are a bit awkward and there\u0027s a lot of rubberbanding, but otherwise good.\n",
    "completion-date": "2019-1-14"
  },
  {
    "game": "Mega Man Zero 3",
    "meta-rating": "77",
    "meta-user": "8.0",
    "date": "Oct 5, 2004",
    "rating": 4,
    "shortname": "mmz3",
    "status": "complete",
    "notes": "Much the same as other Mega Man games, this one becomes an enjoyable platformer once you use save states to fix the game\u0027s lack of checkpoints.\n",
    "completion-date": "2019-1-16"
  },
  {
    "game": "Crash Bandicoot 2: N-Tranced",
    "meta-rating": "75",
    "meta-user": "7.7",
    "date": "Jan 7, 2003",
    "rating": 4,
    "shortname": "crash2",
    "status": "complete",
    "notes": "A solid GBA adaptation of the Crash series. Note this is a seperate game, not a straight port of the PS1 game. Part 1 coming up later in the challenge.\n",
    "completion-date": "2019-1-18"
  },
  {
    "game": "Super Robot Taisen: Original Generation",
    "meta-rating": "72",
    "meta-user": "7.8",
    "date": "Aug 8, 2006",
    "rating": 3,
    "shortname": "srtog",
    "status": "not-complete",
    "notes": "Decent tactics RPG, gets a bit repetition quickly due to boring map design.\n",
    "completion-date": "2019-1-19"
  },
  {
    "game": "Spyro: Attack of the Rhynocs",
    "meta-rating": "72",
    "meta-user": "7.5",
    "date": "Oct 27, 2003",
    "rating": 4,
    "shortname": "saor",
    "status": "complete",
    "notes": "Adds a new layer to classic Spyro gameplay: escherian interlocking fetch quests. Pretty reasonable game apart from an annoying cleanup phase right at the end of  the game.\n",
    "completion-date": "2019-1-20"
  },
  {
    "game": "Activision Anthology",
    "meta-rating": "79",
    "meta-user": "tbd",
    "date": "Dec 9, 2003",
    "rating": 2,
    "shortname": "actan",
    "status": "other",
    "status-note": "Arcade collection.",
    "notes": "Yet another arcade collection. Has quite a few games.\n",
    "completion-date": "2019-1-20"
  },
  {
    "game": "LarryBoy and the Bad Apple",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Aug 8, 2006",
    "rating": 3,
    "shortname": "larry",
    "status": "complete",
    "notes": "Mario \u0026 DK - esque puzzle platformer. Running allows you to skip large sections of level, not sure if that was really intended. Surprisingly fun as you can blow through the game quickly, bad minigame boss fights.\n",
    "completion-date": "2019-1-22"
  },
  {
    "game": "Racing Gears Advance",
    "meta-rating": "83",
    "meta-user": "8.0",
    "date": "Feb 8, 2005",
    "rating": 2,
    "shortname": "rga",
    "status": "not-complete",
    "notes": "Top down racing simulator. Reminds me of micro machines, a game I enjoyed a lot as a kid. Kind of awkward and unforgiving controls.\n",
    "completion-date": "2019-1-22"
  },
  {
    "game": "Castlevania: Harmony of Dissonance",
    "meta-rating": "87",
    "meta-user": "8.0",
    "date": "Sep 16, 2002",
    "rating": 3,
    "shortname": "chod",
    "status": "complete",
    "notes": "Not as good as the other Castlevania GBA games, but still a solid platformer. Exploration can be a bit repetetive due to the 2 castles mechanic, and it has a lot of bosses, many seemingly optional and pointless.\n",
    "completion-date": "2019-1-27"
  },
  {
    "game": "X2: Wolverine\u0027s Revenge",
    "meta-rating": "72",
    "meta-user": "7.2",
    "date": "Apr 15, 2003",
    "rating": 2,
    "shortname": "x2",
    "status": "not-complete",
    "notes": "Middle of the road action platoformer, some slightly interesting mechanics with retracting wolverine\u0027s claws. Horrible bosses.\n",
    "completion-date": "2019-2-2"
  },
  {
    "game": "Rebelstar: Tactical Command",
    "meta-rating": "78",
    "meta-user": "8.8",
    "date": "Sep 6, 2005",
    "rating": 3,
    "shortname": "rtc",
    "status": "not-complete",
    "notes": "Decent but slow and fiddly tactics game. Gave up after dying to bad RNG on a mission and lacking motivation to replay the first half.",
    "completion-date": "2019-2-6"
  },
  {
    "game": "Muppet Pinball Mayhem",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "May 29, 2002",
    "rating": 2,
    "shortname": "mpm",
    "status": "not-complete",
    "notes": "I\u0027m not much of a pinballist, and there are a few coming up... I played a game and it was pinball. There is an adventure mode but I\u0027m not sure how you progress in it. Looks like there are 4 tables, so a somewhat reasonable amount of content? Moved swiftly on.",
    "completion-date": "2019-2-6"
  },
  {
    "game": "Summon Night: Swordcraft Story",
    "meta-rating": "77",
    "meta-user": "8.1",
    "date": "Jul 26, 2006",
    "rating": 4,
    "shortname": "sn",
    "status": "complete",
    "notes": "A solid action RPG, somewhat of a hidden gem I think. Story and cutscenes can drag a bit, but the core gameplay loop of exploring, gathering materials, fighting bosses and repeat is very good. Good combat.",
    "completion-date": "2019-2-9"
  },
  {
    "game": "Super Mario Advance 4: Super Mario Bros. 3",
    "meta-rating": "94",
    "meta-user": "9.1",
    "date": "Oct 21, 2003",
    "rating": 4,
    "shortname": "sma4",
    "status": "complete",
    "notes": "Pretty good Mario platformer, but not my favourite. SO MANY AUTOSCROLLERS. And miniboss fights.",
    "completion-date": "2019-2-15"
  },
  {
    "game": "CT Special Forces 2: Back in the Trenches",
    "meta-rating": "76",
    "meta-user": "tbd",
    "date": "Jun 29, 2004",
    "rating": 3,
    "shortname": "ct2",
    "status": "not-complete",
    "notes": "Decent run and gun game, reminiscent of metal slug. Game over and password save lead to me giving up about half way through the game as I wasn\u0027t having much fun and continuing would have been annoying.",
    "completion-date": "2019-2-20"
  },
  {
    "game": "Phalanx",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Dec 27, 2001",
    "rating": 2,
    "shortname": "phalanx",
    "status": "not-complete",
    "notes": "Another fairly boring shootemup. I\u0027m becoming quite bored of this style of dodgy shootemup with not much going on.",
    "completion-date": "2019-3-10"
  },
  {
    "game": "Madagascar",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "May 23, 2005",
    "rating": 2,
    "shortname": "mad",
    "status": "not-complete",
    "notes": "A pretty limp tie in platformer. Gave up fairly quickly.",
    "completion-date": "2019-3-10"
  },
  {
    "game": "Mega Man Zero",
    "meta-rating": "82",
    "meta-user": "8.9",
    "date": "Sep 9, 2002",
    "rating": 3,
    "shortname": "mmz1",
    "status": "not-complete",
    "notes": "Yet Another Mega Man(TM). Wasn\u0027t having as much fun with this one and gave up. Bosses seemed to just have a ton of health.",
    "completion-date": "2019-4-10"
  },
  {
    "game": "Wings",
    "meta-rating": "72",
    "meta-user": "tbd",
    "date": "Feb 13, 2003",
    "rating": 2,
    "shortname": "wings",
    "status": "not-complete",
    "notes": "A valiant attempt at a GBA flight sim but it\u0027s let down by controls and graphics. Pretty bad.",
    "completion-date": "2019-4-10"
  },
  {
    "game": "Fire Emblem: The Sacred Stones",
    "meta-rating": "85",
    "meta-user": "9.1",
    "date": "May 23, 2005",
    "rating": 3,
    "shortname": "fess",
    "status": "complete",
    "notes": "Shares good points with the other FE game on GBA, but level design seems lacking in this one, many levels that are waves of similar enemies without much strategic interest. Got a bit bored towards the end but pushed throught",
    "completion-date": "2019-5-7"
  },
  {
    "game": "Donkey Kong Country 3",
    "meta-rating": "77",
    "meta-user": "8.5",
    "date": "Nov 7, 2005",
    "rating": 3,
    "shortname": "dkc3",
    "status": "complete",
    "notes": "Almost good, but frustrating camera, too many gimmick levels and water levels.",
    "completion-date": "2019-5-10"
  },
  {
    "game": "Contra Advance: The Alien Wars EX",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Nov 3, 2002",
    "rating": 3,
    "shortname": "ca",
    "status": "not-complete",
    "notes": "Decent run n gun, has lives and continues with very quick deaths and a password save, so I gave up after game overing.",
    "completion-date": "2019-5-11"
  },
  {
    "game": "Mortal Kombat: Tournament Edition",
    "meta-rating": "75",
    "meta-user": "8.1",
    "date": "Aug 27, 2003",
    "rating": 2,
    "shortname": "mkt",
    "status": "not-complete",
    "notes": "Another fighting game. No apparent tutorials, no move list. Gave it a go button mashing until I lost in arcade mode.",
    "completion-date": "2019-5-11"
  },
  {
    "game": "Final Fantasy Tactics Advance",
    "meta-rating": "87",
    "meta-user": "7.8",
    "date": "Sep 8, 2003",
    "rating": 3,
    "shortname": "ffta",
    "status": "not-complete",
    "notes": "Solid tactical RPG. Eventually got stuck with seemingly grinding required to progress, and lost some gameplay due to slightly annoying save/game over system, so gave up, not wanting to stall the challenge.",
    "completion-date": "2019-5-18"
  },
  {
    "game": "Secret Agent Barbie: Royal Jewels Mission",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Oct 8, 2002",
    "rating": 2,
    "shortname": "bsa",
    "status": "complete",
    "notes": "Surprisingly competent stealth platformer despite theme. Levels are a joke and quite short.",
    "completion-date": "2019-5-18"
  },
  {
    "game": "Aggressive Inline",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Aug 27, 2002",
    "rating": 2,
    "shortname": "ai",
    "status": "not-complete",
    "notes": "Another extreme sports game that has really suffered on translation to gba.",
    "completion-date": "2019-5-18"
  },
  {
    "game": "Konami Krazy Racers",
    "meta-rating": "78",
    "meta-user": "tbd",
    "date": "Jun 10, 2001",
    "rating": 2,
    "shortname": "kkr",
    "status": "not-complete",
    "notes": "A fairly uninspired Mario Kart style racer. Gave up after the game completely locked up half way through a cup for no apparent reason.",
    "completion-date": "2019-5-18"
  },
  {
    "game": "Banjo-Kazooie: Grunty\u0027s Revenge",
    "meta-rating": "72",
    "meta-user": "7.9",
    "date": "Sep 10, 2003",
    "rating": 4,
    "shortname": "bk",
    "status": "complete",
    "notes": "Fun enough 2.5d collectathon platformer, quite faithful to the console versions. Some perspective problems and I lost patience near the end.",
    "completion-date": "2019-5-21"
  },
  {
    "game": "Pokemon Pinball: Ruby \u0026 Sapphire",
    "meta-rating": "81",
    "meta-user": "7.9",
    "date": "Aug 26, 2003",
    "rating": 3,
    "shortname": "pp",
    "status": "not-complete",
    "notes": "It\u0027s pinball. Seems to have some interesting stuff going on with catching all the pokemon, but I\u0027m still not a pinball convert.",
    "completion-date": "2019-5-21"
  },
  {
    "game": "Stuntman",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Jun 24, 2003",
    "rating": 3,
    "shortname": "sm",
    "status": "not-complete",
    "notes": "Kinda fun racing game with a twist. Suffers really badly from horrible gba 3d visuals. Ended up rage quitting a decent way into the game due to the excessively harsh completion requirements.",
    "completion-date": "2019-5-24"
  },
  {
    "game": "Columns Crown",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Feb 4, 2002",
    "rating": 2,
    "shortname": "cc",
    "status": "not-complete",
    "notes": "A fairly mediocre arcade style platformer, I wasn\u0027t a fan of the mechanics.",
    "completion-date": "2019-5-24"
  },
  {
    "game": "WarioWare: Twisted!",
    "meta-rating": "88",
    "meta-user": "8.9",
    "date": "May 23, 2005",
    "rating": 4,
    "shortname": "wwt",
    "status": "not-complete",
    "notes": "A minigame collection with a wacky sense of humour. This one is designed for a gyroscope equipped cartridge and it took some effort to get it working. Ultimately had to quit due to one particular boss minigame that is extremely hard with the faked controls.",
    "completion-date": "2019-5-25"
  },
  {
    "game": "F-Zero: Maximum Velocity",
    "meta-rating": "86",
    "meta-user": "8.4",
    "date": "Jun 12, 2001",
    "rating": 3,
    "shortname": "fzmv",
    "status": "complete",
    "notes": "Decent futuristic arcadey racer. Very slidy and hard until I discovered the trick of tapping the throttle to corner effortlessly, then the game became kind of easy. Wierdly the game doesn\u0027t give you any kind of result when finishing a grand prix, but I did all of them so I\u0027m calling it complete.",
    "completion-date": "2019-5-25"
  },
  {
    "game": "Shrek 2",
    "meta-rating": "72",
    "meta-user": "7.0",
    "date": "Apr 28, 2004",
    "rating": 3,
    "shortname": "s2",
    "status": "complete",
    "notes": "Surprisingly well executed platformer with some puzzle elements. Only gets annoying in a few stages.",
    "completion-date": "2019-5-26"
  },
  {
    "game": "Shining Force: Resurrection of the Dark Dragon",
    "meta-rating": "77",
    "meta-user": "8.9",
    "date": "Jun 8, 2004",
    "rating": 3,
    "shortname": "sf",
    "status": "not-complete",
    "notes": "A decent SRPG, but it didn\u0027t really grab me and I ended up losing interest and stalling for a while.",
    "completion-date": "2019-6-13"
  },
  {
    "game": "Phantasy Star Collection",
    "meta-rating": "76",
    "meta-user": "8.1",
    "date": "Nov 24, 2002",
    "rating": 2,
    "shortname": "psc",
    "status": "not-complete",
    "notes": "Classic JRPG collection. I found them a little too old and primitive to really be playable. Abbreviated item names with no explanation/description in game are too much for me. Interesting psuedo 3d dungeon crawling though.",
    "completion-date": "2019-6-13"
  },
  {
    "game": "Star Wars Episode III: Revenge of the Sith",
    "meta-rating": "73",
    "meta-user": "7.6",
    "date": "May 4, 2005",
    "rating": 4,
    "shortname": "sw3",
    "status": "complete",
    "notes": "Surprisingly solid brawler, nice animations and core combat. Quite short and repetitious, but in some ways a gem.",
    "completion-date": "2019-6-15"
  },
  {
    "game": "Rampage Puzzle Attack",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Nov 29, 2001",
    "rating": 2,
    "shortname": "rpa",
    "status": "not-complete",
    "notes": "Odd choice of puzzle spinoff from classic arcade title Rampage. Fairly mediocre core mechanic, a few different modes, I played a bit before stopping.",
    "completion-date": "2019-6-16"
  },
  {
    "game": "Max Payne",
    "meta-rating": "78",
    "meta-user": "8.1",
    "date": "Dec 18, 2003",
    "rating": 2,
    "shortname": "mp",
    "status": "not-complete",
    "notes": "Hot garbage. Attempts to directly adapt the source as an isometric shooter, fails miserably. Aiming is horrible, the signature bullet time is clunky (and the only way to fight with a vague chance of not getting hit) and you get shot from offscreen or just stupidly. Gave up after gameovering a few levels in.",
    "completion-date": "2019-6-16"
  },
  {
    "game": "Mario Golf: Advance Tour",
    "meta-rating": "84",
    "meta-user": "8.6",
    "date": "Jun 22, 2004",
    "rating": 5,
    "shortname": "mgat",
    "status": "complete",
    "notes": "Great arcade golf game that started me on the genre. Cool story mode with some rpg elements too.",
    "completion-date": "2019-6-22"
  },
  {
    "game": "Disney\u0027s Lilo \u0026 Stitch",
    "meta-rating": "80",
    "meta-user": "7.8",
    "date": "Jun 7, 2002",
    "rating": 2,
    "shortname": "ls",
    "status": "not-complete",
    "notes": "Suprisingly this is a split metal slug clone/puzzle platformer. The puzzle sections proved to be obnoxious.",
    "completion-date": "2019-6-26"
  },
  {
    "game": "Mat Hoffman\u0027s Pro BMX 2",
    "meta-rating": "82",
    "meta-user": "tbd",
    "date": "Aug 13, 2002",
    "rating": 2,
    "shortname": "mhpbmx2",
    "status": "not-complete",
    "notes": "Yet another extreme sports game. These are just not good on the gba.",
    "completion-date": "2019-6-26"
  },
  {
    "game": "Golden Sun",
    "meta-rating": "91",
    "meta-user": "9.1",
    "date": "Nov 11, 2001",
    "rating": 5,
    "shortname": "gs",
    "status": "complete",
    "notes": "Probably my favourite JRPG. Still delayed me for a long time. Found all the djinn!",
    "completion-date": "2019-10-07"
  },
  {
    "game": "Uno / Skip-Bo",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Oct 2, 2006",
    "rating": 2,
    "shortname": "usb",
    "status": "other",
    "status-note": "It\u0027s a board game conversion.",
    "notes": "Board game adaptation. Not particularly good board games either. Technically competent I guess. Passed pretty quickly.",
    "completion-date": "2019-10-07"
  },
  {
    "game": "Disney\u0027s Chicken Little",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Oct 20, 2005",
    "rating": 4,
    "shortname": "cl",
    "status": "complete",
    "notes": "Surprisingly competent platformer. Multiple characters (normal chicken, buff chicken, and hoverboarding fish) which all work ok. Slightly questionable minigames but otherwise ok. Disappointing final boss. The midgame bosses are interesting fights with the buff chicken and anti-gravity walls but the final boss is a disappoitingly awkward fight with the normal chicken.",
    "completion-date": "2019-10-07"
  },
  {
    "game": "Classic NES Series: Super Mario Bros.",
    "meta-rating": "84",
    "meta-user": "8.6",
    "date": "Jun 2, 2004",
    "rating": 4,
    "shortname": "cnsmb",
    "status": "complete",
    "notes": "Solid platformer, beginning of a great legacy obviously. Decent port to the gba. Controls are a little stiff by modern standards. You have very little air control and can easily miss a jump and have several seconds to contemplate your mistakes before actually dying. A few elements of the game stand out as obnoxious, notably the hammer bros who are dicks. Bowser boss fights are also not great, either trivial (with a fire flower to shoot or a mushroom to damage boost past) or a dice roll (when you\u0027re small and you have to hope you can jump past). Obnoxious lives/game over system somewhat saved by a \u0022cheat\u0022 to continue from the start of the current world on game over.",
    "completion-date": "2019-10-08"
  },
  {
    "game": "Duke Nukem Advance",
    "meta-rating": "81",
    "meta-user": "8.4",
    "date": "Aug 12, 2002",
    "rating": 4,
    "shortname": "dna",
    "status": "complete",
    "notes": "Decent adaptation of Duke Nukem, very reminiscent of the Doom ports. This one is original rather than a direct port of Duke Nukem for PC. Has full 3D elements (e.g. jumping), but as a result the control scheme is even more squashed. You activate switches and doors by ramming your face into them. Has incredibly annoying alarm sound effects. Has more of a story, including in-level cutscenes. Has some light uncomfortable 90s sexism.",
    "completion-date": "2019-10-09"
  },
  {
    "game": "NickToons Racing",
    "meta-rating": "78",
    "meta-user": "tbd",
    "date": "Jun 14, 2002",
    "rating": 3,
    "shortname": "nr",
    "status": "complete",
    "notes": "Competent technically, but uninspired and lacking anything to really stand out. Played through the available cups once and I\u0027m counting that, but it turns out the credits are in the menu.",
    "completion-date": "2019-10-10"
  },
  {
    "game": "Hi Hi Puffy AmiYumi: Kaznapped!",
    "meta-rating": "71",
    "meta-user": "5.4",
    "date": "Nov 20, 2005",
    "rating": 2,
    "shortname": "hhpak",
    "status": "not-complete",
    "notes": "Tie in platformer with an old cartoon based on a Japenese rock band? Totally bland and boring, just sapped my will to live.",
    "completion-date": "2019-10-12",
    "markdown": true
  },
  {
    "game": "Baldur\u0027s Gate: Dark Alliance",
    "meta-rating": "76",
    "meta-user": "6.8",
    "date": "Feb 10, 2004",
    "rating": 4,
    "shortname": "bgda",
    "status": "complete",
    "notes": "Baldur\u0027s Gate: Dark Alliance is a fairly straightforward hack and slash ARPG. You explore various dungeons on flimsy RPG premises, hack through hundreds of monsters and find loot and level up. It\u0027s pretty solidly built for a GBA game.\n\nCombat is not eartch shattering but has a little nuance, you can block (and blocking is a good idea) so it avoids being totally button mashy. Ranged attacks seemed awkward and mostly only useful for hitting enemies that run away from you. I picked the warrior so didn\u0027t engage much with the magic part of the game. You can abuse doorways to get cheap hits on enemies, which is classic ARPG really. In the end it mostly boils down to block and hit.\n\nFor some reason, the game forces you to run manually back to town any time you want to go to a shop, or need to get more plot from the NPCs. For example, you are forced to run through the initial tavern cellar _at least_ three times, and it\u0027s totally linear. Really could have used a shortcut back to the beginning, or a Town Portal mechanic. Eventually shortcuts do show up but it could have used some kind of fast travel I think.\n\nYou have to manually save, and death takes you back to your last manual save. Not a massive fan of that but it could be worse.\n\nAbout 90% of the plot (what\u0027s really going on) is dropped in one exposition dumb right at the end of the game. It gets quite repetetive towards the end too. No credits too.\n\nOverall a flawed game, but a decent take on a genre I like and mostly unique on the GBA, so it earns points from me for that.\n\nP.S. I think I spotted an intentional Diablo reference: the equipment shopkeeper\u0027s gretting line is the same as that of Griswold from Diablo 1: \u0022Now, what can I do for you?\u0022",
    "completion-date": "2019-10-19",
    "markdown": true
  },
  {
    "game": "Ty the Tasmanian Tiger 3: Night of the Quinkan",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Nov 1, 2005",
    "rating": 2,
    "shortname": "tttt3notq",
    "status": "complete",
    "notes": "No technical complaints, just a really uninspired platformer. Bad level design that involves lots of big arrows pointing you where to go. Weapon upgrades that aren\u0027t required or apparently very useful. Bosses repeated 10 times each. I was slogging through this one.",
    "completion-date": "2019-10-26",
    "markdown": true
  },
  {
    "game": "Frogger\u0027s Adventures 2: The Lost Wand",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Nov 5, 2002",
    "rating": 2,
    "shortname": "fa2tlw",
    "status": "complete",
    "notes": "This is a slightly odd genre - I guess \u0022action adventure\u0022 would be the best description. You hop around the levels, Frogger-style, and have to get to the end.\n\nFirst the good - the game is relatively short and doesn\u0027t drag things out too much. Each level generally has some unique elements, and they are spread out over a variety of worlds (albeit the video game default jungle/ice world/lava world/etc). There is some inventive design at times.\n\nOn the bad side, is that you always die in one hit. Any slipup will lead to your immediate death. And of course, there are lives and too much death gets obnoxiously punished by resetting the whole level. Checkpoints are occaisionally too widely spaced excarbating this. All collectibles only lead to getting more lives and they are fairly generous. This does mean I wasn\u0027t very motivated to explore off the beaten path.\n\nIf you ripped out the life system and made the collectibles actually collectible, this would be elevated to a pretty fun game I think.\n\nFinally the bosses aren\u0027t great - generally just endurance and reaction tests.\n",
    "completion-date": "2019-10-29",
    "markdown": true
  },
  {
    "game": "Earthworm Jim",
    "meta-rating": "72",
    "meta-user": "5.7",
    "date": "Jun 10, 2001",
    "rating": 2,
    "shortname": "ej",
    "status": "not-complete",
    "notes": "Dodgy platformer port. Very ugly background graphics (although some animations are quite nice) to the point levels are hard to navigate. Very uninspiring gameplay. I really wasn\u0027t feeling it and got a game over.",
    "completion-date": "2019-10-31",
    "markdown": true
  },
  {
    "game": "Ecks vs. Sever",
    "meta-rating": "80",
    "meta-user": "8.0",
    "date": "Nov 27, 2001",
    "rating": 2,
    "shortname": "evs",
    "status": "not-complete",
    "notes": "This is a tie in game for a dodgy action film, which has been converted into a pretty bad Doom-style FPS.\n\nAlthough the 3D FPS gameplay technically impressive for the GBA, it\u0027s ultimately inferior to Doom or Duke Nukem, both of which are struggling on the GBA. Combat is awkward, mainly due to the scarcity of ammo. Often the level design excerbates this by e.g. only giving you ammo for the godawful sniper rifle or the questionable grenades. \n\nIt starts off ok but becomes kind of bullshit later in the game as levels are filled with very tough enemies while you are struggling for ammo for any of the weapons that are really effective against them. Ended up rage quitting quite late in the game on a level where you are forced to use the aforementioned terrible sniper rifle.\n\nLevels try to introduce some variety but often end up being annoying. One level, for example, has the \u0022rival agent\u0022 character following you around, unkillable, for the whole level, forcing you to attempt to sprint around mowing down enemies to reach the exit, while the awkward controls make life painful.",
    "completion-date": "2019-11-08",
    "markdown": true
  },
  {
    "game": "Tak and the Power of Juju",
    "meta-rating": "79",
    "meta-user": "8.3",
    "date": "Oct 15, 2003",
    "rating": 3,
    "shortname": "tatpoj",
    "status": "not-complete",
    "notes": "Reasonable platformer tie in with a 3d action/adventure game on home consoles. Technically fine if a little uninspired. Only real gripe is the birds that appear from nowhere flying  at your face as a reaction test.\n\nStopped playing due to losing a significant amount of progress. The game apparently autosaves (no manual saving) but not very frequently. Maybe you need to explicitly quit? In any case, it\u0027s not good enough for me to replay a whole world\u002B.",
    "completion-date": "2019-11-10",
    "markdown": true
  },
  {
    "game": "Dragon Ball Z: Supersonic Warriors",
    "meta-rating": "73",
    "meta-user": "7.0",
    "date": "Jun 22, 2004",
    "rating": 4,
    "shortname": "dbzsw",
    "status": "complete",
    "notes": "Pretty decent 2d fighting game based on Dragon Ball Z. Very nice graphics and animations.\n\nThe gameplay isn\u0027t really my cup of tea, but it does seem to nicely capture the feel of Dragon Ball Z fights - you fly around punching and firing Ki blasts, and occaisionally someone crashes through a mountain. I never got the hang of the close combat punching, and it was hard to reliably trigger special moves due to the awkward button combo of R\u002BA\u002BB all at once.\n\nPlayed through one story mode, Trunks\u0027, which seemed to be a modified version of the anime story placing Trunks at the fore.",
    "completion-date": "2019-11-10",
    "markdown": true
  },
  {
    "game": "Disney\u0027s Kim Possible 2: Drakken\u0027s Demise",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Sep 15, 2004",
    "rating": 2,
    "shortname": "dkp2dd",
    "status": "not-complete",
    "notes": "Very generic platformer. Mildly interesting gadgets but they\u0027re quite clunky to use. My heart wasn\u0027t in it.",
    "completion-date": "2019-12-01",
    "markdown": true
  },
  {
    "game": "Donkey Kong Country 2",
    "meta-rating": "80",
    "meta-user": "8.9",
    "date": "Nov 15, 2004",
    "rating": 2,
    "shortname": "dkc2",
    "status": "not-complete",
    "notes": "This stalled me out for way too long. I didn\u0027t enjoy this one, and it seemed worse than the other 2 DKC games for some reason. Many problems with lack of FOV. This one had really terrible Beehive levels with terrible \u0022walljumping\u0022 off sticky walls, which broke me.",
    "completion-date": "2020-03-13",
    "markdown": true
  },
  {
    "game": "Broken Sword: The Shadow of the Templars",
    "meta-rating": "80",
    "meta-user": "8.3",
    "date": "Mar 17, 2002",
    "rating": 3,
    "shortname": "bstsott",
    "status": "complete",
    "notes": "Ok point and click adventure, which is somewhat unique for GBA. Some crazy logic in puzzles, animation was good although everything was too noisily pixelated. Not the best overall.",
    "completion-date": "2020-03-22",
    "markdown": true
  },
  {
    "game": "Classic NES Series: Castlevania",
    "meta-rating": "74",
    "meta-user": "8.6",
    "date": "Oct 25, 2004",
    "rating": 3,
    "shortname": "cnsc",
    "status": "not-complete",
    "notes": "It\u0027s classic castlevania. Hard as nails, awkward platforming, obnoxious medusa heads. Don\u0027t have the patience for it so gave up quickly.",
    "completion-date": "2020-03-22",
    "markdown": true
  },
  {
    "game": "Super Robot Taisen: Original Generation 2",
    "meta-rating": "82",
    "meta-user": "8.1",
    "date": "Nov 14, 2006",
    "rating": 3,
    "shortname": "srtog2",
    "status": "not-complete",
    "notes": "Much the same as the first one, slightly dodgy giant robot SRPG. Not the best with a bad interface. Gave up after a while.",
    "completion-date": "2020-03-22",
    "markdown": true
  },
  {
    "game": "ChuChu Rocket!",
    "meta-rating": "84",
    "meta-user": "8.4",
    "date": "Jun 10, 2001",
    "rating": 4,
    "shortname": "cr",
    "status": "complete",
    "notes": "Chu Chu Rocket is a nice puzzle game where you guide mice to their escape rockets while avoiding cats. I\u0027ve played a fair bit of it including recently, so I just replayed normal puzzle mode.",
    "completion-date": "2020-03-22",
    "markdown": true
  },
  {
    "game": "SpongeBob SquarePants: Revenge of the Flying Dutchman",
    "meta-rating": "71",
    "meta-user": "7.7",
    "date": "Sep 10, 2002",
    "rating": 2,
    "shortname": "ssrotfd",
    "status": "not-complete",
    "notes": "Yet another dodgy tie in platformer. Mildly interesting mechanics with bubble blowing, but quite clunky controls. Lost interesting pretty fast.",
    "completion-date": "2020-03-23",
    "markdown": true
  },
  {
    "game": "Tom Clancy\u0027s Rainbow Six: Rogue Spear",
    "meta-rating": "76",
    "meta-user": "tbd",
    "date": "Mar 18, 2002",
    "rating": 2,
    "shortname": "tcrsrs",
    "status": "not-complete",
    "notes": "Trying to cram way too much tactical shooter into too little console. Very dodgy control scheme which you can\u0027t really figure out by playing.",
    "completion-date": "2020-03-23",
    "markdown": true
  },
  {
    "game": "Tom Clancy\u0027s Splinter Cell",
    "meta-rating": "77",
    "meta-user": "8.6",
    "date": "Apr 27, 2003",
    "rating": 3,
    "shortname": "tcsc",
    "status": "not-complete",
    "notes": "Somewhat decent platformer adaptation of stealth game. Got bored fairly quickly. I\u0027m incredibly done with platformer tie ins.",
    "completion-date": "2020-03-24",
    "markdown": true
  },
  {
    "game": "Advance Wars",
    "meta-rating": "92",
    "meta-user": "9.0",
    "date": "Sep 9, 2001",
    "rating": 4,
    "shortname": "aw",
    "status": "not-complete",
    "notes": "Very solid turn based strategy for the GBA. Accessible but reasonably deep. Mainly let down by somewaht dodgy AI (which cheats on Fog-of-war maps). Got to the final campaign mission which is kind of massive slog against a big enemy starting army. Ended to avoid bogging down forever.",
    "completion-date": "2020-04-26",
    "markdown": true
  },
  {
    "game": "Aero the Acro-bat",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "May 14, 2002",
    "rating": 3,
    "shortname": "ata",
    "status": "not-complete",
    "notes": "Not as bad as the score might make you think, but not great. Decent little platformer which feels a little like Sonic. Suffers from making the character too big so the screen feels way too small, and requires too much exploration in its gameplay.",
    "completion-date": "2020-04-26",
    "markdown": true
  },
  {
    "game": "Sabre Wulf",
    "meta-rating": "75",
    "meta-user": "8.0",
    "date": "Jun 9, 2004",
    "rating": 4,
    "shortname": "sw",
    "status": "complete",
    "notes": "Sabrewulf is a real hidden gem. A simple platformer where you cross a level to the right until you find a treasure outside the titular wulf\u0027s den, then run back to the beginning being chased. Short levels keep this formula from being too obnoxious.\n\nWhat makes this game is the creature system. You accumulate and inventory of creatures you can place down in levels at any time, to do stuff like creating platforms, dropping bombs, or spawning a friendly creature to club enemies. The game allows really interesting emergent interactions between these creatures, enemies, and the environments, creating quite cool and unique gameplay possibilities. Have a creature kick a bomb over a gap to open up a wall. Place a platform to make an enemy bonk its head and fall into a pit. The possibilities are endless.\n\nHowever, this system is kind of underused and you can often just platform or bruteforce your way through levels. I think it would benefit a lot from more puzzle style levels rather than straight platforming, requiring you to mess with the creature interactions.\n\nThe game has a ton of polish, with quite a fleshed out overworld to explore between platforming levels, with sidequests, minigames, and amusing dialog from NPCs. This is less surprising when you realise this game was made by Rare.\n\nOverall I think Sabrewulf deserves more credit than its 75 score suggest. The game has flaws, like a very slow and easy start, and perhaps overstaying its welcome a little (with 8 worlds that become a bit of a slog later when the difficulty ramps up). But it\u0027s really one of the more unique and interesting games on the GBA.\n",
    "completion-date": "2020-05-02",
    "markdown": true
  },
  {
    "game": "Wing Commander: Prophecy",
    "meta-rating": "70",
    "meta-user": "8.3",
    "date": "Jun 4, 2003",
    "rating": 2,
    "shortname": "wcp",
    "status": "not-complete",
    "notes": "A heroic attempt at porting a space shooter to GBA, but let down by the system\u0027s lack of power and controls. Surprisingly faithful in menus and such, combat is mostly flying around shooting at tiny dots and wrestling with the controls.",
    "completion-date": "2020-05-03",
    "markdown": true
  },
  {
    "game": "TMNT",
    "meta-rating": "80",
    "meta-user": "6.1",
    "date": "Mar 20, 2007",
    "rating": 3,
    "shortname": "t",
    "status": "complete",
    "notes": "Solid enough Streets of Rage style beat-em-up. Short, but doesn\u0027t have enough going on to be any longer. Only annoying part was the final level which has enemies that can apparently stunlock you forever.",
    "completion-date": "2020-05-09",
    "markdown": true
  },
  {
    "game": "Breath of Fire",
    "meta-rating": "79",
    "meta-user": "7.9",
    "date": "Dec 13, 2001",
    "rating": 2,
    "shortname": "bof",
    "status": "not-complete",
    "notes": "Classic RPG port. Badly localised with abbreviated names and some hard to understand progression with weird balance issues. Ended up killing to maintain challenge pace.",
    "completion-date": "2020-05-24",
    "markdown": true
  },
  {
    "game": "It\u0027s Mr. Pants",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Nov 15, 2005",
    "rating": 2,
    "shortname": "imp",
    "status": "other",
    "status-note": "No real story mode",
    "notes": "Arcade puzzle game where you place blocks to create rectangles which then disappear. Not the most amazing mechanic. Super weird theme about a Mr. Pants... OK but not spectacular.",
    "completion-date": "2020-05-24",
    "markdown": true
  },
  {
    "game": "Road Rash: Jailbreak",
    "meta-rating": "78",
    "meta-user": "8.6",
    "date": "Sep 17, 2003",
    "rating": 2,
    "shortname": "rrj",
    "status": "not-complete",
    "notes": "Dodgy arcade motorbike racing with an emphasis on violence. Seemed weirdly hard, couldn\u0027t get past the first level. Not very motivated to try more.",
    "completion-date": "2020-05-24",
    "markdown": true
  },
  {
    "game": "Harvest Moon: More Friends of Mineral Town",
    "meta-rating": "82",
    "meta-user": "8.9",
    "date": "Jul 26, 2005",
    "rating": 3,
    "shortname": "hmmfomt",
    "status": "not-complete",
    "notes": "It\u0027s Harvest Moon, everyone\u0027s favourite farming simulator. The controls (not enough buttons really) and tiny inventory really hold this back. Good for the console, but couldn\u0027t bring myself to play much when Stardew Valley exists.",
    "completion-date": "2020-05-25",
    "markdown": true
  },
  {
    "game": "The Lost Vikings",
    "meta-rating": "75",
    "meta-user": "8.8",
    "date": "Mar 30, 2003",
    "rating": 2,
    "shortname": "tlv",
    "status": "not-complete",
    "notes": "Puzzle platformer by Blizzard from before they made infinity dollars from WoW. Control vikings and solve fairly boring puzzles using their unique abilities. I wasn\u0027t super into this.",
    "completion-date": "2020-05-26",
    "markdown": true
  },
  {
    "game": "Castlevania Double Pack",
    "meta-rating": "86",
    "meta-user": "8.4",
    "date": "Jan 11, 2006",
    "rating": 5,
    "shortname": "cdp",
    "status": "complete",
    "notes": "Replayed the bonus mode of both games, having played them in the challenge previously: Maxim mode of HoD and Julius mode of AoS.\n\nBoth are similar with you controlling an alternate character who starts fully powered up, and only need to wipe out the bosses before ending the game. Fun enough, difficulty was a little odd in both, Maxim was kinda-easy throughout and Julius starts pathetically easy but gets super challenging.\n\nLack of motivation to explore is the main flaw since most mechanics are blocked off for the bonus chars. Still good though.\n\nFor being such an amazing combo though, the pack as a whole gets 5/5.",
    "completion-date": "2020-05-30",
    "markdown": true
  },
  {
    "game": "Ninja Five-O",
    "meta-rating": "82",
    "meta-user": "8.2",
    "date": "Apr 22, 2003",
    "rating": 4,
    "shortname": "nf",
    "status": "complete",
    "notes": "Real hidden gem where you play a ninja policeman. Really good core gameplay with fun grappling hook swinging and decent fighting. Quite short and without too much to change up the gameplay though. Pretty fun.",
    "completion-date": "2020-05-31",
    "markdown": true
  },
  {
    "game": "The Legend of Zelda: A Link to the Past",
    "meta-rating": "95",
    "meta-user": "9.0",
    "date": "Dec 3, 2002",
    "rating": 5,
    "shortname": "tlozalttp",
    "status": "complete",
    "notes": "Took me way too long due to life, but it\u0027s a classic, real good game. The final dungeon maybe toes over into too much and some things are very hard to figure out without a guide, but otherwise pretty great.",
    "completion-date": "2020-07-28",
    "markdown": true
  },
  {
    "game": "Noddy: A Day in Toyland",
    "meta-rating": "72",
    "meta-user": "tbd",
    "date": "Oct 16, 2006",
    "rating": 1,
    "shortname": "nadit",
    "status": "not-complete",
    "notes": "Hot garbage even for a kid\u0027s tie in platformer. You move sooo slow. Boring driving minigame. Got bored after a level that was surprisingly punishing because of enemy hitboxes.",
    "completion-date": "2020-07-28",
    "markdown": true
  },
  {
    "game": "Rock \u0027N Roll Racing",
    "meta-rating": "80",
    "meta-user": "8.1",
    "date": "Jun 23, 2003",
    "rating": 2,
    "shortname": "rnrr",
    "status": "not-complete",
    "notes": "Arcadey/combat racer, played from an isometric perspective. Doesn\u0027t work super well, didn\u0027t grab me.",
    "completion-date": "2020-07-28",
    "markdown": true
  },
  {
    "game": "Karnaaj Rally",
    "meta-rating": "81",
    "meta-user": "7.6",
    "date": "Jan 2, 2003",
    "rating": 2,
    "shortname": "kr",
    "status": "not-complete",
    "notes": "Another racing game, top down this time. Played a bit but it\u0027s still not grabbing me.",
    "completion-date": "2020-07-29",
    "markdown": true
  },
  {
    "game": "Lady Sia",
    "meta-rating": "73",
    "meta-user": "tbd",
    "date": "Oct 15, 2001",
    "rating": 3,
    "shortname": "ls2",
    "status": "not-complete",
    "notes": "A kinda-decent platformer. It\u0027s at least trying to be a good game, but it falls prey to many of the common GBA platformer flaws, and I\u0027m still way too burnt out on mediocre platformers to give this too much play time.",
    "completion-date": "2020-07-31",
    "markdown": true
  },
  {
    "game": "Mortal Kombat: Deadly Alliance",
    "meta-rating": "81",
    "meta-user": "8.1",
    "date": "Nov 20, 2002",
    "rating": 2,
    "shortname": "mkda",
    "status": "not-complete",
    "notes": "Another fighting game. No move list or practice mode so I had no idea what was going on. Has a really rough 3D graphical style. Played a bit until I hit a wall.",
    "completion-date": "2020-08-01",
    "markdown": true
  },
  {
    "game": "Tekken Advance",
    "meta-rating": "82",
    "meta-user": "8.0",
    "date": "Jan 28, 2002",
    "rating": 2,
    "shortname": "ta",
    "status": "not-complete",
    "notes": "Yet another fighter straight away. Has a practice and move list. Still not up to too much though.",
    "completion-date": "2020-08-01",
    "markdown": true
  },
  {
    "game": "Tony Hawk\u0027s Underground 2",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Oct 4, 2004",
    "rating": 2,
    "shortname": "thu2",
    "status": "not-complete",
    "notes": "Yet another Tony Hawk game. These still don\u0027t work on GBA compared to home console. Still ugly.",
    "completion-date": "2020-08-03",
    "markdown": true
  },
  {
    "game": "Final Fight One",
    "meta-rating": "82",
    "meta-user": "7.8",
    "date": "Sep 26, 2001",
    "rating": 2,
    "shortname": "ffo",
    "status": "not-complete",
    "notes": "Follows the standard beatemup formula, but not the best executed version I\u0027ve played on GBA. No block or dodge, or much depth to the combat mechanics as far as I can tell, just hit first to avoid getting stunlocked. Has lives and game over and continues, played until running out of continues.",
    "completion-date": "2020-08-03",
    "markdown": true
  },
  {
    "game": "Bruce Lee: Return of the Legend",
    "meta-rating": "82",
    "meta-user": "7.2",
    "date": "Mar 28, 2003",
    "rating": 4,
    "shortname": "blrotl",
    "status": "complete",
    "notes": "Surprisingly good action platformer, I had a lot of fun with this. Decent combat and fast pace due to good run speed. Let down a little by sometimes questionable platforming, bad looks, and forced stealth sections.",
    "completion-date": "2020-08-05",
    "markdown": true
  },
  {
    "game": "Spyro 2: Season of Flame",
    "meta-rating": "76",
    "meta-user": "7.6",
    "date": "Sep 25, 2002",
    "rating": 4,
    "shortname": "s2sof",
    "status": "complete",
    "notes": "Straight sequel to Season of Ice. They added a map which makes the game so much better. Only falls over in bosses and towards the end with annoying moving platforms.",
    "completion-date": "2020-08-22",
    "markdown": true
  },
  {
    "game": "Dr. Mario / Puzzle League",
    "meta-rating": "74",
    "meta-user": "7.8",
    "date": "Nov 28, 2005",
    "rating": 3,
    "shortname": "dmpl",
    "status": "not-complete",
    "notes": "Two arcadey puzzle games. Seem fine enough, not really completable.",
    "completion-date": "2020-08-22",
    "markdown": true
  },
  {
    "game": "Sonic Pinball Party",
    "meta-rating": "77",
    "meta-user": "8.4",
    "date": "Jun 1, 2003",
    "rating": 1,
    "shortname": "spp",
    "status": "not-complete",
    "notes": "It\u0027s pinball... with a Sonic theme. Maybe someday I\u0027ll get into pinball, but today is not that day.",
    "completion-date": "2020-08-22",
    "markdown": true
  },
  {
    "game": "Gem Smashers",
    "meta-rating": "70",
    "meta-user": "8.6",
    "date": "Jul 1, 2003",
    "rating": 2,
    "shortname": "gs2",
    "status": "not-complete",
    "notes": "It\u0027s an arcade brick breaking puzzle game, with the twist that you control the ball and have to avoid skull blocks to not die. Slightly unique mechanic, but it\u0027s not actually that good.",
    "completion-date": "2020-08-22",
    "markdown": true
  },
  {
    "game": "Castlevania: Circle of the Moon",
    "meta-rating": "91",
    "meta-user": "8.6",
    "date": "Jun 10, 2001",
    "rating": 2,
    "shortname": "ccotm",
    "status": "not-complete",
    "notes": "I have a lot of nostalgia for this game, as the first GBA game I ever owned, and it should be good as a Castlevania game. However, it sucks, and is definitely the worst GBA Castlevania. \n\nThe core controls are horrible, because you default to walking at a stupid slow pace and have to double tap the d-pad to run at a good speed. This hampers the game throughout. It\u0027s full of unfun design. Multiple different forms of enemies that freeze you in place. Enemies that make you unable to attack for a really long time, like a minute, on contact. Crappy bosses that are only hard due to a combination of constant random projectiles and the poor controls. Boring level design with big rooms filled with many copies of the same enemy over and over. A levelling system that will make you fall behind if you don\u0027t grind through all the enemies leaving you doing piddly damage to enemies and bosses. Hearts that don\u0027t get refilled at save points and you have to grind torches to refill them. DSS cards that are gained by pure RNG, without any indication of which enemies drop them.\n\nI stalled for a long time as I didn\u0027t want to give up on this, but I didn\u0027t have a lot of fun. Sick music and good graphics though. Ultimately I got to the last phase of the last boss before realising it was too cheap to beat without grinding up a lot of levels.\n",
    "completion-date": "2020-12-18",
    "markdown": true
  },
  {
    "game": "Rayman Advance",
    "meta-rating": "84",
    "meta-user": "8.3",
    "date": "Jun 10, 2001",
    "rating": 4,
    "shortname": "ra",
    "status": "not-complete",
    "notes": "Rayman Advance is a port of the original PS1 version. It\u0027s a really good port, looks and plays great for a GBA game, capturing the original pretty well. The only real porting flaw is the camera which feels tighter on Rayman and makes some levels and jumps harder than they should be. I have some nostalgia for PS1 Rayman, as I played it back in the day. I remembered it being really hard, but I actually found the difficulty to be pretty good. Challenging but not frustrating for the most part.\n\nRayman does a really great job of theming. The worlds are very distinct, and avoid falling into classic \u0022Lava World, Ice World\u0022 platformer cliches. It even manages to use \u0022ice physics\u0022 (actually sliding on metal instrument tubes in the music themed world) to create actually fun levels. It also avoids overstaying its welcome. New mechanics are developed nicely, but not dragged out too much. Every level has something unique going on and they don\u0027t really ever feel like filler. The level design does use a lot of \u0022things suddenly appear\u0022, but this is slightly better than in some games due to hints that triggers exist, and a sound effect when something pops into existence. Secret hunting can still be baffling though. Nice graphics and pretty good music and sound.\n\nControls are good, very responsive and they do the job perfectly. You gain new abilities through the course of the game, and do have to backtrack to use them to find all the hidden cages (which are required to beat the game). Again though, as the levels aren\u0027t too long or repetetive this avoids being too much of a chore. The combat uses a unique and pretty fun boomerang fist mechanic. Bosses are generally fair and avoid falling into the boring cycle-based bosses a lot of platformers use.\n\nUltimately gave up rather than hunt down every cage to finish the game. Overall, one of the better GBA platformers I\u0027ve played despite not finishing.\n",
    "completion-date": "2020-12-28",
    "markdown": true
  },
  {
    "game": "Metroid Fusion",
    "meta-rating": "92",
    "meta-user": "9.1",
    "date": "Nov 17, 2002",
    "rating": 5,
    "shortname": "mf",
    "status": "complete",
    "notes": "Although it has its flaws, Metroid Fusion is still an amazing game. The totally linear design and unskipable dialog is annoying, but everything else about  the game is great. Burned through this pretty fast.",
    "completion-date": "2020-12-30",
    "markdown": true
  },
  {
    "game": "Breath of Fire II",
    "meta-rating": "81",
    "meta-user": "8.1",
    "date": "Apr 16, 2002",
    "rating": 2,
    "shortname": "bof2",
    "status": "not-complete",
    "notes": "Another JRPG with dodgy translation and interface. Didn\u0027t waste too much time on this one.",
    "completion-date": "2020-12-30",
    "markdown": true
  },
  {
    "game": "Jet Grind Radio",
    "meta-rating": "74",
    "meta-user": "8.0",
    "date": "Jun 26, 2003",
    "rating": 2,
    "shortname": "jgr",
    "status": "not-complete",
    "notes": "Yet another isometric extreme sports game with all the same problems. Stylish presentation, but otherwise dodgy. Graffiti controls that are badly converted analog stick motions are the standout here.",
    "completion-date": "2020-12-30",
    "markdown": true
  },
  {
    "game": "Kirby: Nightmare in Dream Land",
    "meta-rating": "81",
    "meta-user": "8.9",
    "date": "Dec 2, 2002",
    "rating": 4,
    "shortname": "knidl",
    "status": "complete",
    "notes": "A pretty fun and cute platformer. Standard kirby stuff really (although I haven\u0027t played a ton of kirby). Interesting to see a platformer where the main character can just fly. Smooth controls and good powerups from absorbing enemies. Had a good bit of fun.",
    "completion-date": "2021-01-02",
    "markdown": true
  },
  {
    "game": "Mary-Kate and Ashley: Girls Night Out",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Mar 19, 2002",
    "rating": 2,
    "shortname": "maagno",
    "status": "other",
    "status-note": "Rhythm game without a story",
    "notes": "It\u0027s a bad tie-in rhythm game. Didn\u0027t seem to work super well. Not very interested.",
    "completion-date": "2021-01-02",
    "markdown": true
  },
  {
    "game": "Kirby \u0026 the Amazing Mirror",
    "meta-rating": "80",
    "meta-user": "8.9",
    "date": "Oct 18, 2004",
    "rating": 4,
    "shortname": "ktam",
    "status": "complete",
    "notes": "Second and last Kirby game almost back to back. A bit of an improvement over the Nightmare in Dreamland, liked the more open exploration structure even if it\u0027s confusing at times. Final boss sequence was a bit excessive. Had fun over all.",
    "completion-date": "2021-01-07",
    "markdown": true
  },
  {
    "game": "Shining Soul II",
    "meta-rating": "74",
    "meta-user": "8.3",
    "date": "Apr 20, 2004",
    "rating": 4,
    "shortname": "ss2",
    "status": "not-complete",
    "notes": "I quite enjoyed this and consider it a hidden gem. Quite fun hack and slash RPG. Has a few issues around the economy which can break the flow of the game. Ended up stopping midway through as it was starting to get repetetive without too much changing.",
    "completion-date": "2021-01-11",
    "markdown": true
  },
  {
    "game": "Lemony Snicket\u0027s A Series of Unfortunate Events",
    "meta-rating": "72",
    "meta-user": "8.0",
    "date": "Nov 10, 2004",
    "rating": 3,
    "shortname": "lsasoue",
    "status": "not-complete",
    "notes": "Tie in platformer yet again. Not too bad, has light adventure puzzle elements. Still a bit meh though.",
    "completion-date": "2021-01-15",
    "markdown": true
  },
  {
    "game": "Dave Mirra Freestyle BMX 2",
    "meta-rating": "85",
    "meta-user": "tbd",
    "date": "Nov 25, 2001",
    "rating": 2,
    "shortname": "dmfb2",
    "status": "not-complete",
    "notes": "Yet another another extreme sports game. Similar to others. Didn\u0027t spend too long on it.",
    "completion-date": "2021-01-15",
    "markdown": true
  },
  {
    "game": "Dave Mirra Freestyle BMX 3",
    "meta-rating": "78",
    "meta-user": "tbd",
    "date": "Nov 26, 2002",
    "rating": 2,
    "shortname": "dmfb3",
    "status": "not-complete",
    "notes": "RNGesus why you do this to me.",
    "completion-date": "2021-01-15",
    "markdown": true
  },
  {
    "game": "Summon Night: Swordcraft Story 2",
    "meta-rating": "79",
    "meta-user": "8.4",
    "date": "Oct 17, 2006",
    "rating": 3,
    "shortname": "snss2",
    "status": "not-complete",
    "notes": "Pretty good, but I think I like it less than the sequel. A lot more story which interferes with the nice gameplay loop. Better crafting system though. Ended up ditching to avoid stalling forever.",
    "completion-date": "2021-02-02",
    "markdown": true
  },
  {
    "game": "Sega Arcade Gallery",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "May 21, 2003",
    "rating": 2,
    "shortname": "sag",
    "status": "other",
    "notes": "Millionth arcade collection. Not much to see here.",
    "completion-date": "2021-02-02",
    "markdown": true
  },
  {
    "game": "Crash Bandicoot: The Huge Adventure",
    "meta-rating": "78",
    "meta-user": "7.7",
    "date": "Feb 25, 2002",
    "rating": 5,
    "shortname": "cbtha",
    "status": "complete",
    "notes": "Really fun 2d platformer, as with the other one. I think it\u0027s better as it\u0027s not trying to outdo itself. Has a few rough patches with some jumps and the platform art, but mostly great.",
    "completion-date": "2021-02-05",
    "markdown": true
  },
  {
    "game": "Super Mario World: Super Mario Advance 2",
    "meta-rating": "92",
    "meta-user": "9.0",
    "date": "Feb 9, 2002",
    "rating": 5,
    "shortname": "smwsma2",
    "status": "complete",
    "notes": "My favourite Mario game due to nostalgia. Pretty great.",
    "completion-date": "2021-02-07",
    "markdown": true
  },
  {
    "game": "Harry Potter and the Chamber of Secrets",
    "meta-rating": "76",
    "meta-user": "7.9",
    "date": "Nov 14, 2002",
    "rating": 3,
    "shortname": "hpatcos",
    "status": "not-complete",
    "notes": "Not a platformer and surprisingly decent. Still not great though.",
    "completion-date": "2021-02-12",
    "markdown": true
  },
  {
    "game": "Mega Man Battle Network",
    "meta-rating": "79",
    "meta-user": "8.3",
    "date": "Oct 30, 2001",
    "rating": 4,
    "shortname": "mmbn",
    "status": "complete",
    "notes": "This is one that I\u0027ve been excited to play and finally finish. Did enjoy it a lot, but it has some design issues and gets a bit silly  towards the end of the game. Final few boss fights would have been really frustrating without save states. Got through it though.",
    "completion-date": "2021-03-20",
    "markdown": true
  },
  {
    "game": "ZooCube",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "May 14, 2002",
    "rating": 2,
    "shortname": "z",
    "status": "other",
    "notes": "Arcadey puzzle game. Wasn\u0027t super impressed by the mechanics.",
    "completion-date": "2021-03-21",
    "markdown": true
  },
  {
    "game": "Pokemon Emerald Version",
    "meta-rating": "76",
    "meta-user": "8.8",
    "date": "Apr 30, 2005",
    "rating": 4,
    "shortname": "pev",
    "status": "complete",
    "notes": "Another pokemon game, probably the best on the GBA overall. Had fun despite taking a long time over it. Rayquaza captured via master ball carried me fairly hard through the Elite 4, although my team was doing some work.",
    "completion-date": "2021-07-16",
    "markdown": true
  },
  {
    "game": "Super Dodge Ball Advance",
    "meta-rating": "79",
    "meta-user": "tbd",
    "date": "Jun 10, 2001",
    "rating": 3,
    "shortname": "sdba",
    "status": "not-complete",
    "notes": "A dodgeball simulator. Not something that particularly interests me. I\u0027m not very familiar with dodgeball but this seemed like a strange variant.",
    "completion-date": "2021-07-16",
    "markdown": true
  },
  {
    "game": "Golden Sun: The Lost Age",
    "meta-rating": "86",
    "meta-user": "9.2",
    "date": "Apr 14, 2003",
    "rating": 4,
    "shortname": "gstla",
    "status": "complete",
    "notes": "Took me way too long as it\u0027s a long JRPG I was determined never to give up on.\r\n\r\nShares many of the strengths of Golden Sun 1. Main criticisms are that the cutscenes can go on for too long and battles are a touch easy. Exploration and puzzles remain good.\r\n\r\nInteresting that the plot ends up being a kind of \u0022comedy of errors\u0022 where everyone is either trying to save the world or do what they think is right, and conflict comes from misunderstanding motives. The closest thing to a main villain is Alex, the only character acting for selfish reasons, and he never really takes center stage as a bad guy with his plot resolved in the epilogue.",
    "completion-date": "2022-2-7",
    "markdown": true
  },
  {
    "game": "Gradius Galaxies",
    "meta-rating": "78",
    "meta-user": "tbd",
    "date": "Nov 12, 2001",
    "rating": 3,
    "shortname": "gg",
    "status": "not-complete",
    "notes": "A fairly typical scrolling space shooter. Don\u0027t have the patience to grind through to completion.",
    "completion-date": "2022-2-7",
    "markdown": true
  },
  {
    "game": "ESPN Final Round Golf 2002",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Aug 28, 2001",
    "rating": 3,
    "shortname": "efrg2",
    "status": "other",
    "notes": "A fairly typical seriousish golf game. Might be the same engine as Mario Golf Advance or just very similar implementation. No main mode to complete here.",
    "completion-date": "2022-2-7",
    "markdown": true
  },
  {
    "game": "Mega Man Battle Network 2",
    "meta-rating": "81",
    "meta-user": "7.6",
    "date": "Jun 17, 2002",
    "rating": 3,
    "shortname": "mmbn2",
    "status": "not-complete",
    "notes": "Pretty similar to MMBN1. They have addressed some of my complaints about the original, with persistent health, a lower limit on identical chips, and better dungeon layouts. Ultimately reuses a lot of content from 1 and I decided to put it down since it was not holding my attention.",
    "completion-date": "2022-3-17",
    "markdown": true
  },
  {
    "game": "The Pinball of the Dead",
    "meta-rating": "79",
    "meta-user": "tbd",
    "date": "Jun 16, 2002",
    "rating": 2,
    "shortname": "tpotd",
    "status": "other",
    "notes": "It\u0027s another weird pinball adaptation. Not very interested.",
    "completion-date": "2022-3-17",
    "markdown": true
  },
  {
    "game": "Hot Potato!",
    "meta-rating": "74",
    "meta-user": "tbd",
    "date": "Jul 1, 2001",
    "rating": 2,
    "shortname": "hp",
    "status": "other",
    "notes": "A super weird arcade puzzle game. Or maybe it\u0027s a scrolling shooter? You shoot little coloured... things? potatos? at other ones on the road, matching colours to clear them. You only seem to need to match 2 identical ones. I see why this did not become the next tetris.",
    "completion-date": "2022-3-18",
    "markdown": true
  },
  {
    "game": "Defender of the Crown",
    "meta-rating": "72",
    "meta-user": "4.0",
    "date": "Oct 7, 2002",
    "rating": 3,
    "shortname": "dotc",
    "status": "not-complete",
    "notes": "This is an odd one. A turn based strategy game, effectively a very small Total War game, set in medieval England. Battles are just numbers going down until one side wins. Kind of clunky, didn\u0027t really capture my interest.",
    "completion-date": "2022-3-18",
    "markdown": true
  },
  {
    "game": "Disney\u0027s Kim Possible 3: Team Possible",
    "meta-rating": "76",
    "meta-user": "7.7",
    "date": "Aug 21, 2005",
    "rating": 2,
    "shortname": "dskp3tp",
    "status": "not-complete",
    "notes": "Yet another tie in platformer. Moving on quickly.",
    "completion-date": "2022-3-21",
    "markdown": true
  },
  {
    "game": "Mega Man Zero 2",
    "meta-rating": "81",
    "meta-user": "8.6",
    "date": "Oct 14, 2003",
    "rating": 3,
    "shortname": "mmz2",
    "status": "not-complete",
    "notes": "Similar to other ZM games, nice platformer but sky-high difficulty and frustration, and I\u0027ve played too many of them already.",
    "completion-date": "2022-3-23",
    "markdown": true
  },
  {
    "game": "Final Fantasy I \u0026 II: Dawn of Souls",
    "meta-rating": "79",
    "meta-user": "6.8",
    "date": "Nov 29, 2004",
    "rating": 4,
    "shortname": "ffi\u00262dos",
    "status": "complete",
    "notes": "FF1: It\u0027s janky and very unbalanced (seemed to get very easier from about 1/3 mark). But a lot of the defining FF elements are already in place, and it doesn\u0027t drag itself out too long. Definitely need a guide though as the game does not really tell you where to go a lot of the time.",
    "completion-date": "2022-4-12",
    "markdown": true
  },
  {
    "game": "Ultimate Muscle: The Kinnikuman Legacy - The Path of the Superhero",
    "meta-rating": "70",
    "meta-user": "8.1",
    "date": "Jun 5, 2003",
    "rating": 2,
    "shortname": "umtkl-tpots",
    "status": "not-complete",
    "notes": " It’s a wrestling game based on a weird anime that I actually do remember a bit of from my youth. The game is alright although its systems are a bit strange and convoluted.",
    "completion-date": "2022-4-12",
    "markdown": true
  },
  {
    "game": "Bomberman Max 2: Blue Advance",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "May 30, 2002",
    "rating": 3,
    "shortname": "bm2ba",
    "status": "not-complete",
    "notes": "I\u0027m not a fan of Bomberman as a single player game. Haven\u0027t got much time for this one.",
    "completion-date": "2022-4-13",
    "markdown": true
  },
  {
    "game": "Mech Platoon",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Jan 3, 2002",
    "rating": 3,
    "shortname": "mp2",
    "status": "not-complete",
    "notes": "Quite an ambitious RTS for the GBA. Very clunky controls. Difficulty all over the place, ended up putting it down about half way through.",
    "completion-date": "2022-4-15",
    "markdown": true
  },
  {
    "game": "Spider-Man: Mysterio\u0027s Menace",
    "meta-rating": "84",
    "meta-user": "8.7",
    "date": "Sep 19, 2001",
    "rating": 4,
    "shortname": "smsm",
    "status": "complete",
    "notes": "It\u0027s a tie in platformer which is actually pretty good. Apart from the final level (annoying) and boss (grindy and boring) it was pretty good and I enjoyed it. Really nice web swinging stuff.",
    "completion-date": "2022-4-16",
    "markdown": true
  },
  {
    "game": "Monster Truck Madness",
    "meta-rating": "75",
    "meta-user": "tbd",
    "date": "Aug 11, 2003",
    "rating": 3,
    "shortname": "mtm",
    "status": "other",
    "notes": "It\u0027s a monster truck racing game. It seems alright, classic bad GBA 3D graphics, very loose controls, not a ton going on reallly.",
    "completion-date": "2022-4-16",
    "markdown": true
  },
  {
    "game": "Sonic Advance",
    "meta-rating": "87",
    "meta-user": "8.2",
    "date": "Feb 3, 2002",
    "rating": 3,
    "shortname": "sa",
    "status": "complete",
    "notes": "Well made platformer but I just don\u0027t like Sonic games that much. I find that they transition from fast and breezy to just obnoxious in later stages when they\u0027re actually trying to create difficulty.",
    "completion-date": "2022-4-18",
    "markdown": true
  },
  {
    "game": "Harvest Moon: Friends of Mineral Town",
    "meta-rating": "81",
    "meta-user": "9.5",
    "date": "Nov 17, 2003",
    "rating": 3,
    "shortname": "hmfomt",
    "status": "not-complete",
    "notes": "It\u0027s almost exactly the same as the other Harvest Moon.",
    "completion-date": "2022-4-19",
    "markdown": true
  },
  {
    "game": "AirForce Delta Storm",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Sep 16, 2002",
    "rating": 2,
    "shortname": "ads",
    "status": "not-complete",
    "notes": "Another GBA title that\u0027s trying to do too much with too few buttons and too little graphics hardware. Trying to navigate and aim in 3D space with the 2D top down view \u002B altimeter is very painful.",
    "completion-date": "2022-4-19",
    "markdown": true
  },
  {
    "game": "The Urbz: Sims in the City",
    "meta-rating": "72",
    "meta-user": "8.9",
    "date": "Nov 9, 2004",
    "rating": 2,
    "shortname": "tusitc",
    "status": "not-complete",
    "notes": "It\u0027s a spinoff of The Sims which is trying way too hard to be edgy and down with the kids. Has only gotten more hilarious with age. As a game, it\u0027s doing some light adventure gameplay with some systems like needs and relationships, along with some fairly uninspired minigames.",
    "completion-date": "2022-4-19",
    "markdown": true
  },
  {
    "game": "Puyo Pop",
    "meta-rating": "84",
    "meta-user": "6.6",
    "date": "Feb 11, 2002",
    "rating": 3,
    "shortname": "pp2",
    "status": "not-complete",
    "notes": "It\u0027s an arcade puzzle game. It\u0027s not tetris.",
    "completion-date": "2022-4-20",
    "markdown": true
  },
  {
    "game": "Frogger\u0027s Adventures: Temple of the Frog",
    "meta-rating": "73",
    "meta-user": "7.8",
    "date": "Nov 24, 2001",
    "rating": 2,
    "shortname": "fsatotf",
    "status": "not-complete",
    "notes": "I considered persisting with Frogger but as with many GBA games they’ve put in a lives/game over system which just serves to make the game artificially longer. Fundamentally it’s not a particularly fun or interesting game, and beating it won’t be particularly hard but will involve occaisionally messing up and having to replay a whole level, which is just annoying.",
    "completion-date": "2022-4-21",
    "markdown": true
  },
  {
    "game": "Need for Speed Underground 2",
    "meta-rating": "72",
    "meta-user": "8.2",
    "date": "Nov 15, 2004",
    "rating": 2,
    "shortname": "nfsu2",
    "status": "other",
    "notes": "It\u0027s another racer adaptation with eye bleeding graphics. Not much to do here.",
    "completion-date": "2022-4-21",
    "markdown": true
  },
  {
    "game": "Gunstar Super Heroes",
    "meta-rating": "83",
    "meta-user": "8.5",
    "date": "Oct 25, 2005",
    "rating": 5,
    "shortname": "gsh",
    "status": "complete",
    "notes": "Wow. Incredible hidden gem (hidden for me anyway). Core gameplay is a run-and-gun shooter somewhat like Metal Slug. Has amazing action set pieces with really varied gameplay, including unique uses of rotation. Great graphics with both nice pixel art and really good usage of the GBA\u0027s graphical capabilities to make special effects. I\u0027m going to be honest, I played on easy which I think was the right decision as I had a light and fun run through the action. Even so, didn\u0027t seem excessively hard at any point and probably is also good on normal (and I could even imagine playing this a bunch and getting good at it). Has some replayability with difficulties, alternate character and score/time attack. Final stage includes a boss rush which is the same boss characters with new fights. It even gets that right!",
    "completion-date": "2022-4-23",
    "markdown": true
  },
  {
    "game": "Ballistic: Ecks vs. Sever II",
    "meta-rating": "72",
    "meta-user": "4.8",
    "date": "Sep 14, 2002",
    "rating": 2,
    "shortname": "bevs2",
    "status": "not-complete",
    "notes": "My complaints about the first game return. First person shooters on the GBA need to basically play like Duke Nukem or Doom, otherwise they\u0027re just going to be unfun.",
    "completion-date": "2022-4-23",
    "markdown": true
  },
  {
    "game": "Scurge: Hive",
    "meta-rating": "76",
    "meta-user": "8.6",
    "date": "Oct 31, 2006",
    "rating": 4,
    "shortname": "sh",
    "status": "complete",
    "notes": "Pretty good. Isn\u0027t as much of a metroidvania as you might think (despite plot ripping off Fusion) as it\u0027s perfectly linear with no extra upgrades rewarding exploration. Outstays its welcome a bit. You have to collect so many keycards and press so many switches.",
    "completion-date": "2022-5-11",
    "markdown": true
  },
  {
    "game": "Advance Wars 2: Black Hole Rising",
    "meta-rating": "89",
    "meta-user": "9.3",
    "date": "Jun 24, 2003",
    "rating": 4,
    "shortname": "aw2bhr",
    "status": "not-complete",
    "notes": "Although Advance Wars 2 is really good, I ended up putting it down. The problem is as the campaign goes on the battles become larger and more complex, and generally longer. I find I have the most fun on smaller battles that can be done in a short amount of time, rather than a long slog. These long battles usually end up lacking really strong tactics too and become \u0022fight efficiently and churn out units to counter what the enemy is doing\u0022 until you win, rather than any interesting strategy.",
    "completion-date": "2022-5-14",
    "markdown": true
  },
  {
    "game": "Double Dragon Advance",
    "meta-rating": "75",
    "meta-user": "8.4",
    "date": "Nov 14, 2003",
    "rating": 3,
    "shortname": "dda",
    "status": "not-complete",
    "notes": "It\u0027s a beat-em-up. Seems fine, this type of game rarely clicks with me.",
    "completion-date": "2022-5-14",
    "markdown": true
  },
  {
    "game": "DK: King of Swing",
    "meta-rating": "70",
    "meta-user": "5.0",
    "date": "Sep 19, 2005",
    "rating": 3,
    "shortname": "dkos",
    "status": "complete",
    "notes": "This has kind of a special significance for the GBA challenge as it\u0027s the reason why I dropped the floor on game ratings down to 70 and have put up with so many bad platformers. Was it worth it? Not really... A unique core mechanic but some weird design choices and it doesn\u0027t have a ton of legs.",
    "completion-date": "2022-5-15",
    "markdown": true
  },
  {
    "game": "Pokemon Ruby Version",
    "meta-rating": "82",
    "meta-user": "8.7",
    "date": "Mar 18, 2003",
    "rating": 4,
    "shortname": "prv",
    "status": "complete",
    "notes": "So since this isn\u0027t the first gen 3 game I\u0027ve played for the challenge, this time I tried doing a solo pokemon run. Swampert proved to be a beast as his only weakness is grass and there\u0027s no grass gym leader/E4. Honestly the hardest fight was probably the rival in the early/midgame (before acquiring an ice move).",
    "completion-date": "2022-5-17",
    "markdown": true
  },
  {
    "game": "Mario Tennis: Power Tour",
    "meta-rating": "81",
    "meta-user": "8.0",
    "date": "Dec 5, 2005",
    "rating": 3,
    "shortname": "mtpt",
    "status": "not-complete",
    "notes": "This is from the same stable as some of my favourite games like Mario Golf and Golden Sun. However, I just don\u0027t enjoy playing tennis against the AI that much. It gets repetetive pretty fast.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "Kelly Slater\u0027s Pro Surfer",
    "meta-rating": "72",
    "meta-user": "tbd",
    "date": "Aug 21, 2002",
    "rating": 2,
    "shortname": "kssps",
    "status": "not-complete",
    "notes": "Another entry into the \u0022extreme sports games that don\u0027t scale well onto GBA\u0022. Not much here.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "Mega Man Battle Network 3 White",
    "meta-rating": "77",
    "meta-user": "8.5",
    "date": "Jun 24, 2003",
    "rating": 3,
    "shortname": "mmbn3w",
    "status": "not-complete",
    "notes": "My problem with this is the same as MMBN2 - it\u0027s very similar to MMBN1 which I did not enjoy enough to support 3 games of content.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "Lunar Legend",
    "meta-rating": "79",
    "meta-user": "7.8",
    "date": "Dec 8, 2002",
    "rating": 3,
    "shortname": "ll",
    "status": "not-complete",
    "notes": "A pretty generic jrpg which failed to grab me.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "River City Ransom EX",
    "meta-rating": "75",
    "meta-user": "8.4",
    "date": "May 25, 2004",
    "rating": 2,
    "shortname": "rcre",
    "status": "not-complete",
    "notes": "This is a beat-em-up. A bit of an odd one, I found the character art style very odd. Gameplay seemed a bit rough with enemies moving a lot faster than you can.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "CT Special Forces",
    "meta-rating": "71",
    "meta-user": "tbd",
    "date": "Jan 4, 2004",
    "rating": 2,
    "shortname": "csf",
    "status": "not-complete",
    "notes": "This is another odd one. It wants to be a run and gun platformer like Metal Slug, but fails to capture anything that makes that genre fun. Controls are stiff and awkward, your default gun is very bad and you don\u0027t get a ton of ammo for other guns. Gameplay is slowed down by awkward platforming and somewhat mazelike levels. Didn\u0027t enjoy it.",
    "completion-date": "2022-5-18",
    "markdown": true
  },
  {
    "game": "Drill Dozer",
    "meta-rating": "81",
    "meta-user": "8.8",
    "date": "Feb 6, 2006",
    "rating": 5,
    "shortname": "dd",
    "status": "complete",
    "notes": "A really solid platformer with a novel drilling mechanic that gets fully explored. Well designed levels, all of which bring something new, doesn\u0027t outstay its welcome. Can\u0027t ask for much more.",
    "completion-date": "2022-5-20",
    "markdown": true
  },
  {
    "game": "Tony Hawk\u0027s Pro Skater 3",
    "meta-rating": "90",
    "meta-user": "8.0",
    "date": "Mar 4, 2002",
    "rating": 2,
    "shortname": "thsps3",
    "status": "not-complete",
    "notes": "How many Tony Hawk games is this now? At least this is the last one.",
    "completion-date": "2022-5-20",
    "markdown": true
  },
  {
    "game": "Harry Potter and the Goblet of Fire",
    "meta-rating": "71",
    "meta-user": "6.0",
    "date": "Nov 8, 2005",
    "rating": 3,
    "shortname": "hpatgof",
    "status": "not-complete",
    "notes": "A top down adventure. I found it kind of funny that you just press a to fire a generic magic bolt and the game describes it as being one of 5 different canonical HP spells based on context. Anyway, not up to too much.",
    "completion-date": "2022-5-20",
    "markdown": true
  },
  {
    "game": "Eragon",
    "meta-rating": "70",
    "meta-user": "7.0",
    "date": "Nov 14, 2006",
    "rating": 3,
    "shortname": "e",
    "status": "not-complete",
    "notes": "I was surprised that this was actually kind of a jrpg. Not that good though.",
    "completion-date": "2022-5-20",
    "markdown": true
  },
  {
    "game": "Justice League Heroes: The Flash",
    "meta-rating": "72",
    "meta-user": "7.4",
    "date": "Oct 17, 2006",
    "rating": 3,
    "shortname": "jlhtf",
    "status": "not-complete",
    "notes": "Some neat Flash features, including slow-mo and a zoom-to-enemies button. Outside of that, kind of a mindless button bashy beat-em-up.",
    "completion-date": "2022-5-20",
    "markdown": true
  },
  {
    "game": "Yggdra Union",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Nov 21, 2006",
    "rating": 4,
    "shortname": "yu",
    "status": "not-complete",
    "notes": "Interesting SRPG with a bunch of weird systems including using cards for turns, persistent health and items, only one attack per turn, etc. Doesn\u0027t quite land I think but an interesting game.",
    "completion-date": "2022-5-21",
    "markdown": true
  },
  {
    "game": "Super Ghouls \u0027n Ghosts",
    "meta-rating": "78",
    "meta-user": "8.4",
    "date": "Sep 23, 2002",
    "rating": 3,
    "shortname": "sgng",
    "status": "complete",
    "notes": "Infamously nintendo-hard action platformer. Requires near perfect play to progress as you can only take 2 hits before dying and health pickups seem to be rare. Not really for me.",
    "completion-date": "2022-5-21",
    "markdown": true
  },
  {
    "game": "Disney\u0027s Extreme Skate Adventure",
    "meta-rating": "70",
    "meta-user": "tbd",
    "date": "Sep 3, 2003",
    "rating": 2,
    "shortname": "dsesa",
    "status": "not-complete",
    "notes": "Turns out I was wrong when I thought I\u0027d played the last Tony Hawk\u0027s skateboarding game. Being a licensed tie-in did not improve this game.",
    "completion-date": "2022-5-21",
    "markdown": true
  },
  {
    "game": "Denki Blocks!",
    "meta-rating": "77",
    "meta-user": "tbd",
    "date": "Oct 30, 2001",
    "rating": 3,
    "shortname": "db",
    "status": "not-complete",
    "notes": "Kind of a simple puzzle game. Pressing directions moves all the blocks in the level, match each colour into one big block. In general just completing each puzzle seems easy but it has some bonus objectives which would actually be challenging to acheive. Didn\u0027t end up sticking with it.",
    "completion-date": "2022-5-21",
    "markdown": true
  },
  {
    "game": "Zone of the Enders: The Fist of Mars",
    "meta-rating": "71",
    "meta-user": "8.4",
    "date": "Mar 3, 2002",
    "rating": -1
  }
]